default bettyEricBardiesroom = False  # Бетти согласилась задрать юбку при Эрике


# прачечная (когда Моника вышла из дома)
label ep210_dialogues3_bardie_erik_betty_1:

    return

label ep210_dialogues3_bardie_erik_betty_1a:
    # Моника комментирует
    mt "Мне показалось или здесь был какой-то звук?"
    mt "Кажется, кричала Бетти. Интересно на кого?"
    return

# комната Барди
label ep210_dialogues3_bardie_erik_betty_2:

    return


#################### в v0.11 #########################
# для разговора с Фредом Мелани придет во двор дома Моники
# ее там увидят все обитатели дома, включая Барди
# проработать, как Мелани выйдет на Фреда (игра будет за Мелани)
# Мелани выходит на Фреда, чтобы выяснить что-то про Викторию
# он взамен просит что-то, но Мелани ему отказывает
# тогда он говорит, давай тогда Миссис Бакфетт это сделает
#
# Фред должен принести компромат
# на встречу приходит он, а за ним приходит Виктория
# он говорит, что Виктория пообещала ему секс с Мелани, если он встанет на ее сторону
# поэтому он
