# Комната Барди.
# Моника спрашивает, получил-ли Барди чего хотел? И что там с Бетти?
# Барди отвечает что все отлично. И теперь Бетти ответит за все.
# Моника спрашивает и что, она занималась какими-то отвратительными вещами с инструктором?
# В зависимости от того занималась Бетти или нет, Барди отвечает.
# Что да, эта Бетти трахается со всеми подряд, как я и думал.
# У Бетти с Ральфом подписан брачный договор.
# И, если Бетти не хочет остаться без всего что имеет и уехать назад в свою дыру, то ей придется хорошо себя вести.
# Но это теперь моя забота! И только попробуй рассказать об этом кому-то!
# Только Барди имеет право говорить об этом Ральфу, иначе Моника сама знает что будет!
# Моника злая спрашивает и что будет?
# Барди говорит что имеет ввиду штраф.
# Моника морщится.
# Если Бетти не трахалась, то Барди говорит что она этого не делала, но того что он снял
# вполне достаточно для того чтобы так казалось.
# У Бетти с Ральфом подписан брачный договор.
# И, если Бетти не хочет остаться без всего что имеет и уехать назад в свою дыру, то ей придется хорошо себя вести.
# И Барди имеет право говорить об этом Ральфу, иначе Моника сама знает что будет!
# Моника злая спрашивает и что будет?
# Барди говорит что имеет ввиду штраф.
# Моника морщится.

label ep24_dialogues4_bardie1:


    return




label ep24_dialogues4_bardie2:
# Барди делает замечания когда видит что Моника в трусиках.


    return

label ep24_dialogues4_bardie3:

    return


label ep24_dialogues4_bardie4:

    return





#
