label ep24_dialogues5_betty0a:
    help "Прогресс Бетти активирован!"
    return


label ep24_dialogues5_betty0:
    # Нажато в меню Согласиться и предупредить Барди
    music Hidden_Agenda
    img 10607
    with fade
    m "Миссис Робертс, Вы дадите мне минуту, чтобы собраться?"
    img 6027
    betty "Не более минуты, гувернантка. Я не собираюсь ждать тебя."
    img 10608
    with fade
    m "Да, Миссис Робертс, я быстро вернусь..."
    return

label ep24_dialogues5_betty1:


    return



label ep24_dialogues5_betty2:

    return

label ep24_dialogues5_betty2b:


    return


label ep24_dialogues5_betty3:

    return

label ep24_dialogues5_betty4:

    return



# Все это происходит пока прогресс Барди не достигнет след. уровня
# После этого, Моника, при входе в любую локацию дома из подвала, натыкается на Бетти.
# Снова цена Бетти, Моника и подглядывающий Барди.
# Бетти говорит Монике что теперь в доме новые правила.
# Моника спрашивает подозрительно какие новые правила, Миссис Робертс?
# Бетти говорит что теперь в доме Моника должна ходить и убираться без трусиков.
# Моника в шоке!
# Но почему, Миссис Робертс?!
# Ведь она просто наемный работник и Бетти не имеет права требовать этого!
# Бетти злится и кричит что если еще раз увидит гувернантку в трусиках, та вылетит из дома в тот же миг!
# Моника оборачивается на Барди и шипит: мелкий гаденышь! я знаю, это все ты!!!
# Барди улыбается.

label ep24_dialogues5_betty5:

    return

label ep24_dialogues5_betty5a:
    mt "Мелкий гаденыш!"
    return

# После этого, когда Моника проверяет у Бетти трусики в спальне, либо у зеркала и у Моники что-то надето,
# то она комментирует что не будет проверять у Бетти трусики, потому что сама сейчас носит их.
# И Бетти может попросить проверить в ответ и Моника рискует потерять крышу над головой.

label ep24_dialogues5_betty6:

    return

label ep24_dialogues5_betty7:
    # Моника проверяет без трусиков Бетти у зеркала

    return


















#
