
label gallery_21819:
    # Сцена меняется на кабинет
    music stop
    img black_screen
    with diss
    pause 1.0
    sound snd_jail_door
    pause 1.0
    sound snd_fabric1
    pause 2.0
    sound highheels_run2
    pause 2.0
    music Groove2_85
    img 21790
    with fadelong
    marcus "О, Миссис Бакфетт..."
    marcus "Рад снова видеть Вас!"
    img 21791
    with diss
    marcus "У Вас красивое платье."
    marcus "Жаль это подделка. Вы достойны лучшего..."
    sound highheels_short_walk
    img 21792
    with fade
    marcus "Пожалуйста, присаживайтесь..."
    marcus "Платье можете пока оставить на себе."
    # Моника садится
    m "Сссспасибо... Мистер Маркус..."
    sound highheels_short_walk
    img 21793
    with diss
    m "ССсскажите... Что со мной будет?..."
    mt "Все, что угодно... Только не ферма!"
    img 21794
    with fade
    marcus "Миссис Бакфетт, скажите, Вам удобно?"
    img 21795
    with diss
    m "Да, Мистер Маркус. Мне вполне удобно."
    img 21796
    with fade
    marcus "Вам ничего не мешает?"
    img 21797
    with diss
    m "Нет, Мистер Маркус..."
    show screen photoshot_screen()
    with hpunch
    pause 0.7
    hide screen photoshot_screen
    mt "Мне ужасно больно! Я хочу вытащить это поскорее!!!"
    music Master_Disorder
    img 21798
    with fade
    marcus "Вы ведь ничего не вынимали из себя?"
    marcus "Я к тому... Вам ведь действительно нравится то, что находится в Вас?"
    marcus "Вы меня не обманывали?"

    img 21799
    with diss
    m "Нет, Мистер Маркус..."
    m "Во мне... Во мне до сих пор это..."

    img 21800
    with fade
    marcus "Миссис Бакфетт, Вы бы хотели, чтобы это оставалось в Вас все время?"
    img 21801
    with diss
    m "Мистер Маркус... Я бы... Я бы хотела немного отдохнуть... От этого..."

    music stop
    img black_screen
    with diss
    pause 1.5
    music Groove2_85
    img 21802
    with fadelong
    marcus "Миссис Бакфетт..."
    marcus "Я вспоминаю нашу первую встречу..."
    marcus "Вы пришли сюда и начали кричать на меня."
    marcus "Вы действительно были девушкой высокого положения и остаетесь ей."
    marcus "Но Вы сами сказали о том, что благодарны мне."
    marcus "Скажите, разве я заслуживал такого отношения к себе?"

    music Malicious
    img 21803
    with diss
    mt "О Боже..."
    mt "Что я ему тогда наговорила?! Знала бы я, что это за человек..."
    mt "..."
    music Hidden_Agenda
    m "Мистер Маркус... Я..."
    m "Я приношу свои извинения Вам."
    m "Это было ошибкой с моей стороны."
    m "Я... Я недооценила Вас."
    img 21804
    with diss
    m "Просто это было все было так неожиданно..."
    m "Я прошу Вас простить меня..."
    music Groove2_85
    img 21805
    with fade
    marcus "Мне нравятся Ваши слова, Миссис Бакфетт."
    marcus "Скажите, ведь Вы все та же сильная леди, которая вошла сюда?"
    marcus "Ведь Вы ничуть не изменились, правда?"
    music Master_Disorder
    img 21806
    with diss
    marcus "Для меня важно, чтобы эти слова говорила именно она."
    img 21807
    with diss
    m "Да, Мистер Маркус..."
    img 21808
    with fade
    marcus "Это неубедительно. Скажите кто Вы."
    marcus "Сделайте это так, как Вы умеете говорить!"
    # Моника встает, расправляет плечи и говорит ледяным тоном
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.5
    music Pyro_Flow
    img 21809
    with fadelong
    w
    img 21810
    with diss
    m "Я - Моника Бакфетт."
    m "Я - владелица Модного Журнала."
    m "Все люди вокруг подчиняются мне."
    m "Моя красота и богатство не имеют равных далеко за пределами этого места."
    music Master_Disorder
    img 21811
    with fade
    marcus "Хорошо. Теперь покажите мне."
    music Pyro_Flow
    img 21812
    with diss
    m "Показать ЧТО?"
    music Master_Disorder
    img 21813
    with fade
    marcus "Ту вещь, которая в Вас. Я хочу Вам помочь..."
    img 21814
    with diss
    m "!!!"
    img 21815
    with fade
    marcus "Владелица Модного Журнала, поднимите юбку. Не стесняйтесь."
    marcus "Я хочу проверить Ваши слова."
    img 21816
    with diss
    mt "Он смеется надо мной!!! Да как он..."
    mt "Черт!"
    m "..."

    # Моника задирает платье и показывает пробку, которая в нее вставлена
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.0
    music Master_Disorder
    img 21817
    with fadelong
    w
    img 21818
    with diss
    w
    sound snd_fabric1
    img 21819
    with diss
    w
    marcus "О, Миссис Бакфетт..."
    marcus "Вы подобрали правильный цвет платья..."
    marcus "Должен признать, что Вы действительно разбираетесь в моде."
    img 21820
    with diss
    marcus "Ваша интуиция позволяет Вам соблюсти правильное сочетание цветов в любой ситуации."
    marcus "Даже в той, которую Вы не можете предугадать заранее."
    img 21821
    with fade
    marcus "Вы можете подойти ко мне, я помогу Вам."
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.0
    music Master_Disorder
    img 21822
    with fadelong
    marcus "Повернитесь спиной."
    # Моника подходит
    # Маркус вытаскивает пробку (анимация)
    sound highheels_short_walk
    img 21823
    with diss
    w
    img 21824
    with diss
    w
    music stop
    img 21825
    with diss
    w
    scene black
    sound Monica_butt_plug_v
    image videov_Marcus_Monica_Dildo_1_1 = Movie(play="video/v_Marcus_Monica_Dildo_1_1.mkv", fps=30, loop=False, image="/images/Slides/v_Marcus_Monica_Dildo_1_1_stop.jpg")
    show videov_Marcus_Monica_Dildo_1_1
    pause 2.5
    music Master_Disorder
    wclean

#    img 21826
#    img 21827
    sound snd_woman_pain
    img 21828
    with hpunch
    m "ААААЙ!!"
    # Моника оборачивается
    sound highheels_short_walk
    img 21829
    with diss
    w
    music stop
    w
    # Маркус держит пробку.

    # Маркус нюхает пробку
    sound snd_sniff1
    img 21830
    with fade
    marcus "Ммммм... Превосходно!"
    music Master_Disorder
    img 21831
    with diss
    marcus "Не хотите попробовать?"
    m "Что?!"
    img 21832
    with fade
    marcus "Попробуйте это, Миссис Бакфетт."
    marcus "Мне это нравится, а Вам?"
    music stop
    m "???"
    sound snd_sniff1
    img 21833 # Моника нюхает
    with diss
    mt "Это... Это просто отвратительно!"

    music Groove2_85
    img 21834
    with fade
    marcus "Вы достаточно сказали сегодня."
    img 21835
    with diss
    marcus "Теперь Я хочу кое-что Вам рассказать."
    marcus "Вы женщина очень высокого положения. Вы привыкли говорить, а не слушать."
    marcus "И, для того, чтобы быть уверенным, что Вы не будете перебивать меня..."
    img 21836
    with diss
    marcus "Возьмите это в рот."

    music Power_Bots_Loop
    img 21837
    with hpunch
    mt "Что?! В рот?! Он достал это из моей попы только что!"
    m "!!!"
    m "Но..."
    marcus "Вы же не собираетесь перебивать меня, Миссис Бакфетт?"
    m "Нет..."
    img 21838
    with diss
    marcus "Тогда нет причин не взять в рот это..."
    marcus "Или есть какие-то причины?"

    m "Нннет..."

    # Маркус засовывает пробку Монике в рот
    music stop
    img black_screen
    with diss
    pause 1.5
    music Malicious
    img 21839
    with fadelong
    mt "Фуууу!!! Как это противно!"
    mt "Но если я откажусь..."
    w
    sound snd_gulp
    img 21840
    with diss
    w
    music Groove2_85
    img 21841
    with fade
    marcus "Вы можете присесть."
    # Моника садится
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.5
    music Groove2_85
    img 21842
    with fadelong
    w
    img 21843
    with diss
    marcus "Итак, Миссис Бакфетт..."
    marcus "Я удивлен и обрадован Вашему визиту."
    marcus "Пока Вы меня ожидали, я был в отъезде."
    music Villainous_Treachery
    img 21844
    with fade
    marcus "И как раз собирался, по возвращению, арестовать Вас."
    img 21845
    with diss
    m "!!!"
    music Groove2_85
    img 21846
    with fade
    marcus "Вы спросите насчет Мистера Дика?"
    marcus "Да, действительно, его действия являются определенным препятствием между нами."
    img 21847
    with diss
    marcus "Однако, я нашел способ обойти его."
    music Malicious
    img 21848
    with hpunch
    m "!!!"
    label gallery_21860:
    music Groove2_85
    img 21849
    with fade
    marcus "Видите-ли, за мной стоят еще люди, с которыми я вынужден считаться..."
    marcus "И эти люди также хотят заполучить Вас."
    m "..."
    img 21850
    with diss
    marcus "Они видят препятствие только в действиях Мистера Дика."
    marcus "Но не знают о том, что в действиях Мистера Дика есть слабая сторона."
    marcus "Дело в том, что я работаю здесь, на месте. И вижу больше них..."
    music Malicious
    img 21851
    with diss
    m "!!!"
    music Groove2_85
    img 21852
    with fade
    marcus "И Я, и Эти Люди - всецело доверяем друг другу."
    marcus "С моей стороны было бы крайне неудобно не сообщать им новую информацию..."
    music Villainous_Treachery
    marcus "Поэтому, я собирался сообщить им о ней и арестовать Вас немедленно..."
    music Malicious
    img 21853
    with diss
    m "!!!"
    music Groove2_85
    img 21854
    with fade
    marcus "Для меня было удивлением, что Вы сделали такой своевременный упреждающий шаг..."
    m "..."
    music Master_Disorder
    img 21855
    with diss
    marcus "Как-будто кто-то очень мудрый подсказал Вам его..."
    img 21856
    with diss
    m "!!!"
    music Groove2_85
    img 21857
    with fade
    marcus "Но, думаю, это Ваша женская интуиция, которая помогает Вам..."
    img 21858
    with diss
    m "..."
    img 21859
    with fade
    marcus "Вы пытаетесь заставить меня думать, что играть с Вами ЗДЕСЬ будет интереснее, чем играть на Ранчо 218."
    marcus "Заставить быть ребенком, который не хочет делиться своей игрушкой с остальными..."
    img 21860
    with diss
    m "..."
    img 21861
    with fade
    marcus "Интересная попытка..."
    marcus "И, Вы знаете... Я заинтересован..."
    img 21862
    with diss
    m "..."
    music Master_Disorder
    img 21863
    with fade
    marcus "Понимаете-ли... Имея неограниченную власть..."
    marcus "Становится все сложнее и сложнее развлекать себя..."
    img 21864
    with diss
    marcus "Вы ведь меня понимаете, Миссис Бакфетт, правда?"
    img 21865
    m "!!!"
    music stop
    img black_screen
    with diss
    pause 1.0
    music Master_Disorder
    img 21866
    with fade
    marcus "Вы можете идти, на этот раз..."
    marcus "Я пока не буду сообщать никому о той информации, что у меня есть..."
    marcus "Пока..."
    img 21867
    with diss
    marcus "И, не забывайте, я не единственный, кто стоит за всем этим."
    marcus "Стоит Вам хоть немного оступиться, и об этом узнают ТАМ."
    marcus "Даже в этом кабинете. Сейчас очень редкое короткое окно, когда я уверен, что нас не слышат."

    # Моника встает, продолжая держать пробку во рту
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.5
    music Groove2_85
    img 21868
    with fadelong
    marcus "Да, и Вы можете снова придти ко мне, когда будете готовы..."
    marcus "Заинтересовать меня еще раз..."
    music Master_Disorder
    img 21869
    with diss
    marcus "Пока я не успел потерять тот интерес, что у меня есть сейчас..."
    img 21870
    with diss
    m "!!!"
    marcus "Можете идти."
    sound highheels_short_walk
    img 21871
    with fade
    marcus "И сохраните эту вещь. Она будет Вам напоминать о нашей дружбе..."
    # Моника уходит

    return

############ Melanie 1############

label gallery_8735:
    $ store_music()
    if ep23_dialogues5_2_first_time == True:
        music Hidden_Agenda
        img 8693
        with fade
        m "Мелани... Я хочу поговорить с тобой..."
        melanie "О чем Вы хотите поговорить со мной, Миссис Бакфетт?"

        img 8692
        m "Может мы отойти с тобой куда-нибудь?"
        "Я бы не хотела чтобы Алекс слышал наш разговор?"

        # Если Моника была злой с Мелани
        if melanieOffended2 == False and melanieOffended1 == False:
            pass
        else:
            music Groove2_85
            img 8694
            with fade
            melanie "Миссис Бакфетт, у нас с Вами официальные отношения."
            "Я бы хотела чтобы у нас не было никаких секретов."
            "Это может повредить моей карьере..."
            img 8695
            with fade
            mt "Мне надо как-то уговорить Мелани пойти со мной."
            "Я не собираюсь заводить разговор здесь, в присутствии Алекса!"
            "..."
            "Мелани любит лесть..."
            menu:
                "Попросить вежливо.":
                    music Hidden_Agenda
                    img 8696
                    with fade
                    m "Мелани, пожалуйста..."
                    "Да, у нас официальные отношения и ты отличный профессионал."
                    "Ты самая красивая модель в этом журнале."
                    "И я бы хотела поговорить с тобой наедине..."
                "Уйти.":
                    return

        img 8697
        with fade
        melanie "Хорошо, Миссис Бакфетт."
        "Пройдемте в гримерную комнату."

        # заходят в гримерку
        #fadelong
        music Groove2_85
        sound heel1
        img 8698
        with fadelong
        mt "Хм..."
        "Я смотрю Мелани здесь неплохо обосновалась, пока меня нет..."

        # В гримерке Моника говорит что хочет попросить Мелани об услуге.
        # Мелани интересуется чем-же она таким может помочь Монике Бакфетт.
        img 8699
        melanie "Итак, Миссис Бакфетт?"
        m "Мелани, я хочу попросить тебя об услуги..."
        melanie "Интересно... Чем же я могу помочь Миссис Бакфетт?"

        # Моника говорит что это касается мужчины, а Мелани в этом очень сильна.
        # И это касается решения ее небольших проблем. И что она будет очень благодарна Мелани за это.
        # И повысит ее значительно выше, когда вернется назад.
        music Hidden_Agenda
        img 8700
        with fade
        m "Это... Это касается одного мужчины..."
        "А ты, Мелани, насколько я знаю, очень сильна в этих вопросах..."
        "Это касается решения кое-каких небольших проблем, которые у меня возникли в последнее время..."
        img 8701
        with Dissolve(0.5)
        "Я обещаю что повышу тебя значительно выше, чем ты сейчас..."
        "Когда верну все назад..."

        # Мелани говорит что не понимает зачем Моника ходит в таком виде. Она развелась с мужем и он забрал все ее деньги?
        # Моника говорит что муж у нее плохой, на что Мелани отвечает что не бывает плохих мужчин, надо просто знать к ним подход.
        # Так что, надо помочь с мужем?
        music Groove2_85
        img 8702
        with fade
        melanie "Да, Миссис Бакфетт."
        "По Вашему виду можно сказать что у Вас возникли небольшие проблемы."
        "Мне не совсем понятно, зачем вы ходите в этом..."
        "Вы развелись с мужем и он забрал все Ваши деньги?"
        img 8703
        m "Нет, Мелани... Муж у меня..."
        "Не будем об этом... Я не могу сказать ничего положительного про него..."
        img 8704
        melanie "Миссис Бакфетт. Не бывает плохих мужчин."
        "Просто надо знать подход к ним..."
        "Так Вам надо помочь с Вашим мужем?"

        # Моника отвечает что нет, надо помочь с другим мужчиной.
        # Мелани удивляется. Значит в этом замешан еще один мужчина? Это, значит любовь?
        # Как я сразу не догадалась. Только любовь может заставить Монику Бакфетт идти на такие жертвы у всех на виду.
        # Моника говорит что это не совсем любовь, и на пути стоит еще одна женщина.
        # Мелани говорит что еще одна женщина? Это становится интересно.
        # И что же сама Миссис Бакфетт хочет от Мелани?

        img 8705
        with Dissolve(0.5)
        m "Нет, Мелани..."
        m "Мне надо помочь с... другим мужчиной..."
        img 8706
        with fade
        melanie "Значит в этом замешан еще один мужчина?"
        melanie "Значит это любовь?!"
        melanie "Как я сразу не догадалась!"
        melanie "Только любовь может заставить Монику Бакфетт идти на такие жертвы!"
        img 8707
        with fade
        "У всех на виду!"
        music Hidden_Agenda
        img 8708
        with Dissolve(0.5)
        m "Мелани... знаешь..."
        "Это... не совсем любовь..."
        "Это касается еще одной женщины... на моем пути..."
        music Groove2_85
        img 8709
        with fade
        melanie "Еще одной женщины?"
        "Это становится интересно!"
        "И что же САМА Миссис Бакфетт хочет от Мелани?"

        # Моника говорит что у нее есть подозрения, что этот человек замешан в том что у нее возникли небольшие временные трудности.
        # Этот мужчина был поклонником Моники и любил ее, бегал за ней как пудель, но вдруг он изменился.
        # И еще там появилась другая женщина. И Моника предполагает что ее проблемы могут быть связаны с этим.
        # Моника пыталась найти подход к нему, но потерпела неудачу.
        # Этот мужчина любит женщин и перед Мелани он не устоит.
        # Если Дик признавался что хочет Мелани, то Моника об этом говорит. Мелани улыбается и отвечает что получает тысячи признаний в любви каждый день.
        # А как же Вы? Вы считаете что я красивее Вас, Миссис Бакфетт? Что я могу затмить ту женщину, которая встала между Вами?
        # Моника думает.
        img 8710
        with fade
        m "У меня есть подозрения, что этот мужчина замешан в том, что у меня возникли небольшие временные трудности..."
        "Этот мужчина был моим поклонником и любил меня. Бегал за мной как пудель, но..."
        "Но, вдруг, он изменился."
        img 8711
        with Dissolve(0.5)
        "Впоследствии еще появилась другая женщина."
        "И у меня серьезные подозрения, что все проблемы могут быть связаны с этим."
        img 8712
        with Dissolve(0.5)
        "Я пыталась найти подход у этому мужчине, но потерпела неудачу."
        "Не знаю почему!!!"
        "Но этот мужчина любит женщин и перед тобой он вряд-ли устоит!"

        #Если Дик признавался что хочет Мелани
        if richHotelRestaurantDickOffended1 == True or dickWantFuckMelanie == True:
            img 8713
            m "Еще он как-то проговорился о том что мечтает о тебе..."
            melanie "Ой, Миссис Бакфетт..."
            "Я получаю тысячи признаний в любви каждый день..."
        #

        img 8714
        with fade
        melanie "А как же Вы?"
        "Вы считаете что я красивее Вас, Миссис Бакфетт?"
        "Что я смогу затмить ту женщину, которая встала между Вами?"
    else:
        if ep23_dialogues5_2a_first_time == True:
            music Groove2_85
            img 8692
            with fade
            m "Мелани... Я хочу поговорить с тобой..."
            melanie "Хорошо, Миссис Бакфетт."
            "Пройдемте в гримерную комнату."
            img 8713
            m "Я... про наш разговор..."
            img 8714
            melanie "Что же Вы ответите?"
            "Вы считаете что я красивее Вас, Миссис Бакфетт?"
            "Что я смогу затмить ту женщину, которая встала между Вами?"

    if ep23_dialogues5_2a_first_time == True:
        # Возможен ответ да или нет. Если нет, то выход. Затем диалог короче.
        img 8716
        with fade
        menu:
            "Да, Мелани, возможно ты справишься лучше.":
                pass
            "Нет, Мелани. Я не думаю что ты лучше меня.":
                music Pyro_Flow
                img 8715
                with fade
                m "Нет, Мелани. Я не думаю что ты лучше меня."
                return
        # Моника говорит что красота - это условная вещь, но в чем Мелани хорошо разбирается- так это в том как управлять мужчинами.
        # Мелани улыбается и говорит что это очевидно и она рада что Моника это признала.
        # Моника говорит что этим мужчиной будет управлять не так просто.
        # Мелани говорит что любым мужчиной управлять просто. Мужчины готовы идти на любые жертвы, воевать друг с другом.
        # Ради женщины. Им надо всего-лишь показать что Вы именно та женщина, ради которой стоит это делать.
        # Любой мужчина готов на все ради меня, Миссис Бакфетт.
        # Моника говорит что у нее тоже много поклонников.
        # Мелани спрашивает, почему тогда вы не попросите о помощи их?
        # Нет, Миссис Бакфетт. Вы не умеете управлять мужчинами.
        # Оставьте это мне. Так кто тот мужчина, с которым Вам никак не справиться?
        music Groove2_85
        img 8717
        with fade
        m "Видишь ли, Мелани."
        "Красота - это условная вещь."
        "Но в чем ты, Мелани, действительно разбираешься..."
        "Так это в том как управлять мужчинами..."
        img 8718
        melanie "Миссис Бакфетт, это очевидно. Я рада что Вы, наконец-то, это признали..."
        img 8719
        with fade
        m "Но мужчиной, про которого я говорю, будет управлять не так просто."
        img 8720
        with fade
        melanie "Миссис Бакфетт, любым мужчиной управлять просто."
        "Мужчины готовы идти на любые жертвы, воевать друг с другом."
        "Ради женщины..."
        img 8721
        with Dissolve(0.5)
        "Им надо, всего-лишь, показать что Вы именно та женщина..."
        "Ради которой стоит это делать..."
        "..."
        "Любой мужчина готов на все ради меня, Миссис Бакфетт."
        img 8722
        m "У меня тоже много поклонников!"
        music ZigZag
        img 8723
        with fade
        w
        img 8724
        w
        img 8725
        with fade
        melanie "Почему же тогда Вы не попросите помощи их?"
        img 8726
        mt "!!!"
        img 8727
        with fade
        melanie "Нет, Миссис Бакфетт... Вы не умеете управлять мужчинами."
        "Оставьте это мне..."
        "Так кто тот мучжина, с которым Вам никак не справиться?"

        # Моника говорит что скажет если Мелани согласится помочь ей.
        # Мелани говрит что поможет, если Моника поучаствует в фотосессии с Мелани.
        # Биф хочет от нее какую-то пошлятину и Моника может помочь. Мелани не собирается задерживаться здесь, но хочет завершить подписанный контракт.
        # Моника спрашивает чем-же она может помочь в этом?
        # Мелани отвечает что там что поучаствует вместе с ней (улыбается)
        # Моника надменно улыбается, значит Биф от тебя что-то хочет? И почему-же ты не управляешь им, а?
        # Мелани отвечает что именно это она и делает (улыбается)
        music Groove2_85
        img 8728
        with fade
        m "Я скажу тебе если ты согласишься помочь мне!"
    else:
        music Hidden_Agenda
        img 8692
        with fade
        m "Мелани... Я хочу поговорить с тобой..."
        melanie "Хорошо, Миссис Бакфетт."
        "Пройдемте в гримерную комнату."
        music Groove2_85
        img 8713
        m "Я... про наш разговор..."
    img 8729
    with fade
    melanie "Я помогу Вам, Миссис Бакфетт, если..."
    img 8730
    m "Если?"
    img 8731
    with fade
    melanie "Если Вы поучаствуете со мной в фотосессии."
    melanie "Биф хочет от меня какую-то пошлятину и Вы можете помочь мне с этим."
    img 8732
    melanie "В любом случае я не собираюсь задерживаться здесь."
    melanie "Я лишь хочу завершить подписанный контракт."
    img 8733
    m "И чем-же я могу помочь тебе?"
    img 8734
    melanie "Тем что поучаствуете вместе со мной..."
    img 8735
    with fade
    m "Значит Биф что-то требует от тебя?"
    "И почему-же ты не управляешь им, а?"

    img 8736
    with fade
    melanie "Миссис Бакфетт... Я именно это и делаю..."
    img 8734
    melanie "Ну так что?"
    img 8737
    with fade
    # Моника соглашается, либо нет. Если нет, то выход. Затем диалог короче.
    menu:
        "Хорошо, я согласна.":
            pass
        "Я не хочу участвовать в каких-то сомнительных фотосессиях.":
            music Pyro_Flow
            img 8739
            with fade
            m "Я не хочу участвовать в каких-то сомнительных фотосессиях."
            img 8734
            melanie "Значит мы отложим этот разговор..."
            return

    # Моника говорит что согласна и спрашивает когда будет фотосессия.
    # Если соглашается, но фотосессия не открыта, то Мелани говорит что это запланировано после фотосессий с Вами.
    # Если открыто, то говорит что завтра вечером.
    # Моника думает что очередная глупая фотосессия, но ей надо добраться до Дика!
    # Далее в зависимости от того Моника сучка или нет, про себя ругается на Мелани что та сучка.
    music Hidden_Agenda
    img 8738
    with fade
    m "Хорошо, Мелани..."
    "Я... Согласна сделать с тобой фотосессию..."
    "Когда она будет?"


    # Если фотосессия не открыта
    img 8740
    with fade
    melanie "Насколько я знаю, до этого Биф запланировал некоторые фотосессии с Вами."
    "Сделайте их и мы начнем."
    music Groove2_85
    img 8741
    with fade
    mt "Итак... Очередная глупая фотосессия..."
    "Но я сделаю ее, мне надо добраться до Дика!"
    if monicaBitch == True:
        music Pyro_Flow
        img 8742
        with Dissolve(0.5)
        mt "Сучка Мелани! Ставит какие-то глупые условия мне!"
        "МНЕ, МОНИКЕ БАКФЕТТ! ЕЕ БОССУ!!!"
        music Groove2_85
    return

label gallery_8986:

    # Мелани отвечает спасибо и предлагает Дику присесть.
    # И предлагает чай, вино или виски?
    # Дик говорит что хотел бы сразу взять номер того негодяя, потому что боится что потом может забыть.
    # Что при виде Мелани у него путаются мысли и он уже не может сосредоточиться.
    # Мелани говорит что да, конечно. И спрашивает не кажется-ли Мистеру Дику что здесь очень жарко.
    # Я пойду одену что-то более легкое, вы не возражаете если я отойду?
    # Дик говорит что конечно нет.
    music stop
    sound snd_car_engine
    scene black_screen
    with Dissolve(1)
    stop music fadeout 1.0
    call textonblack(t_("У МЕЛАНИ ДОМА...")) from _rcall_textonblack_30
    scene black_screen
    with Dissolve(1)
    music ZigZag
    img 8964
    with fade
    dick "Мелани! У Вас такое уютное гнездышко!"
    img 8965
    dick "Вы имеете отличный вкус!"
    img 8966
    melanie "Спасибо, Мистер Дик..."
    img 8967
    with fade
    w
    img 8968
    w
    img 8969
    with Dissolve(0.5)
    w

    img 8970
    with fadelong
    melanie "Присаживайтесь, Мистер Дик."
    img 8971
    melanie "Давайте я Вас чем-нибудь угощу?"
    img 8972
    with fade
    melanie "Что Вы предпочитаете? Кофе, вино или виски?"
    img 8973
    dick "Мелани, я хотел бы сразу записать номер того негодяя."
    "Я боюсь что могу забыть потом."
    img 8974
    with fade
    dick "Мелани, при виде Вас у меня путаются мысли."
    img 8975
    with Dissolve(0.5)
    "Я даже сейчас уже не могу сосредоточиться...."
    img 8976
    with fade
    melanie "Да, конечно, Мистер Дик."
    img 8977
    with fadelong
    "Аххххх..."
    "Не кажется-ли Вам что здесь очень жарко?"
    img 8978
    with fade
    "Я пойду одену что-то более легкое."
    img 8979
    "Вы не возражаете если я отойду на минутку?"
    dick "Что Вы, Мелани? Конечно я не возражаю."
    music stop
    scene black_screen
    with Dissolve(1)
    pause 1.0

    # Мелани возвращается одетая в трусики и шубку.
    # Подходит к Дику и спрашивает нравится-ли Дику ее образ? Не слишком-ли он будет смущать Мистера Дика?
    # Дик просто в шоке.
    # Он, запинаясь, говорит Мелани что его не будет смущать.
    # Мелани открывает шубку, там грудь. А так?
    # Дик в шоке.
    # О Мелани! Я прошу Вас! Можно я сделаю несколько кадров? Я всегда мечтал об этом!
    # Дик, но у Вас нет камеры.
    # У меня есть телефон! Я могу сделать кадры на него!
    # Мелани говорит что она любит фотографироваться, как Мистер Дик уже, наверное, знает.
    # Но она любит хорошее качество фото.
    music Loved_Up
    img 8980
    with fadelong
    melanie "Мистер Дик, нравится-ли Вам мой образ?"
    img 8981
    with Dissolve(0.5)
    "Не слишком-ли он будет смущать Вас?"
    img 8982
    dick "..."
    img 8983
    dick "!!!"
    img 8984
    melanie "..."
    img 8985
    with fade
    dick "Ммм... Мелани..."
    dick "Нет... Этот образ... Не будет смущать меня..."
    img 8986
    with fadelong
    with hpunch
    melanie "А так?"
    sound Jump2
    img 8987
    dick "!!!"
    img 8988
    w
    img 8989
    with fade
    dick "..."
    img 8990
    with Dissolve(0.5)
    w
    img 8991
    dick "!!!"
    dick "О, Мелани!"
    "Я прошу Вас!"
    "Можно я сделаю несколько кадров?"
    "Я всегда мечтал об этом!"
    img 8992
    with fade
    melanie "Дик, но у Вас нет камеры."
    img 8993
    with Dissolve(0.5)
    dick "У меня есть телефон! Я могу сделать кадры на него!"
    img 8994
    with fade
    melanie "Мистер Дик, я люблю фотографироваться. Вы уже, наверное, это знаете."
    "Но я люблю хорошее качество фото."

    # Дик говорит что это будут самые лучшие фотографии для него! И никто их не увидит никогда!
    # Только Дик сможет оценивать красоту и качество сделанных фото!
    # Так что неважно на какую камеру они будут сделана, для Дика они будут лучшие, потому что
    # На них будет Мелани!
    # Хорошо, Мистер Дик. Вы знаете, мне незачем стесняться своей груди, но я бы не хотела чтобы мир увидел их раньше времени.
    # Дик отвечает что клянется, никто не увидит это. Только пожалуйста, пусть она даст возможность!
    # Мелани отвечает что хорошо, только трогать нельзя.
    # Дик отвечает что все будет как Мелани скажет ему!
    img 8995
    dick "Для меня это будут самые лучшие фото!"
    "Их больше никто никогда не увидит!"
    "Только я смогу оценивать их бесконечную красоту!"
    "И неважно на какую камеру они сделаны!"
    "Они лучшие, потому что на них будете Вы, Мелани!"
    img 8996
    melanie "Хорошо, Мистер Дик. Вы знаете, мне незачем стесняться своей груди."
    "Но я бы не хотела чтобы мир увидел ее раньше времени..."
    img 8997
    dick "Мелани! Я клянусь! Никто не увидит это!"
    "Только пожалуйста, дайте мне возможность!"
    img 8998
    with fade
    melanie "Хорошо, Мистер Дик. Но трогать нельзя..."
    img 8997
    dick "Мелани! Все будет так как скажете ВЫ!"

    music stop
    scene black_screen
    with Dissolve(1)
    pause 1.0
    # Начинается фотосессия Мелани с Диком.
    # Дика почти не видно, фото чисто с Мелани.
    # Вертятся везде по дому.
    # photo
    music Molten_Alloy
    img 8999
    with fadelong
    w
    call photoshop_flash() from _rcall_photoshop_flash_167
    w
    img 9000
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_168
    w
    img 9001
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_169
    w
    img 9002
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_170
    w
    img 9003
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_171
    w
    img 9004
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_172
    w
    img 9005
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_173
    w
    img 9006
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_174
    w
    img 9007
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_175
    w
    img 9008
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_176
    w
    img 9009
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_177
    w
    img 9010
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_178
    w
    img 9011
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_179
    w
    img 9012
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_180
    w
    img 9013
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_181
    w
    img 9014
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_182
    w
    img 9015
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_183
    w
    img 9016
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_184
    w
    img 9017
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_185
    w
    img 9018
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_186
    w
    img 9019
    with fade
    w
    call photoshop_flash() from _rcall_photoshop_flash_187
    w
    label gallery_9023:
    img 9020
    with fade
    melanie "Мистер Дик, Вам нравится?"
    dick "Мелани, я просто без ума!"
    melanie "Идите сюда..."
    img 9021 #nophoto
    with fade
    w
    melanie "Я разрешаю сделать Вам последний кадр..."

    if richHotelRestaurantDickOffended1 == True or dickWantFuckMelanie == True:
        img 9022 #nophoto
        with fade
        w
        img 9023
        with Dissolve(0.8)
        w
        call photoshop_flash() from _rcall_photoshop_flash_188
        w

    else:
        w
        call photoshop_flash() from _rcall_photoshop_flash_189
        w

    #end_photo


    # Дик садится на колени перед Мелани и говорит что он восхищается ей!
    music Continue_Life
    img 9024
    with fadelong
    dick "О, Мелани!"
    img 9025
    with Dissolve(0.5)
    w
    img 9026
    with Dissolve(0.5)
    w
    img 9027
    "Я восхищаюсь ВАМИ!"
    img 9028
    with fade
    melanie "..."
    # Сцена заканчивается.
    scene black_screen
    with Dissolve(1)
    music stop
    pause 2.0
    return

label gallery_9206:
#    jump scene_test2
    # Моника приходит к Мелани в гримерку.
    # Спрашивает к Мелани, когда она сходит к Маркусу?
    # Мелани говорит что после кастинга.
    # Готова-ли Миссис Бакфетт пройти его?
    # Ответ да или нет
    # Если да, то Мелани говорит что пойдемте в Ваш кабинет. Там Вас уже ждут...
    music Groove2_85
    img 9181
    with fade
    m "Мелани, когда ты пойдешь к Маркусу?"
    img 9182
    melanie "После кастинга, Миссис Бакфетт...."
    "Готовы-ли Вы пройти его?"
    music Power_Bots_Loop
    img 9183
    menu:
        "Да, я готова (черт!)":
            pass
        "Я пока не решилась на это...":
            music Groove2_85
            m "Я пока не решилась на это..."
            return

    music Groove2_85
    m "Да, я готова..."
    # Моника приходит в кабинет, там сидит мартышка в ее платье.
    # Мелани сидит на краю стола и улыбается

    # Моника: ТЫ?!?!
    # .....
    # ЭТО... МОЕ ПЛАТЬЕ?!?!
    music stop
    img black_screen
    with Dissolve(1.0)
    music RnB3_65
    img 9184
    with fadelong
    mt "Моника, дыши глубже..."
    "Пусть Мелани поиграет в Босса... Ничего страшного..."
    "Зато она поможет мне вернуть мою нормальную жизнь..."
    "Я сделаю все что мне скажут, я готова пойти на это..."
    "Все зашло слишком далеко и я готова на что угодно!"

    img 9185
    with fadelong
    mt "Я дышу глубоко... Я готова..."

    img 9186
    with Dissolve(0.5)
    w
    music stop
    sound plastinka
    img 9187
    with hpunch
    w
    music Power_Bots_Loop
    img 9188
    w
    img 9189
    with fade
    m "ТЫ?!?!"
    if monkeysOffended1 == True:
        m "ГРЕБАНАЯ МАРТЫШКА!"
    m "..."
    img 9190
    with fade
    m "ЭТО... МОЕ ПЛАТЬЕ?!?!"
    img 9189
    m "Оно не сидит на тебе! Оно МОЕ!!!"

    # Мартышка отвечает молчать сучка!
    img 9191
    with fade
    model1 "Молчать, сучка!"
    # Моника ошарашенная смотрит на Мелани.
    img 9192
    with fade
    m "..."
    # Мелани говорит что Вы помните условие...
    img 9193
    with Dissolve(0.5)
    melanie "Вы помните условие..."

    # Выбор
    # Уйти или остаться и выполнять приказы
    img 9192
    with fade
    menu:
        "Остаться и выполнять приказы.":
            pass
        "Уйти.":
            # Я не собираюсь участвовать в этом фарсе!
            img 9194
            m "Я не собираюсь участвовать в этом фарсе!"
            return

    # остаться
    # Мартышка говорит Монике зачем та пришла.
    # Моника отвечает что пришла пройти кастинг, чтобы устроиться в журнал.
    # Мартышка говорит чтобы та показала на что она способна.
    # Попринимала разные позы, привлекла внимание.
    music Groove2_85
    img 9195
    with fade
    model1 "Итак, сучка..."
    "Зачем ты пришла сюда?"
    img 9196
    m "Я..."
    "Я пришла пройти кастинг, чтобы устроиться работать в журнал."
    img 9197
    model1 "Хорошо, сними эту куртку"
    "Попринимай разные позы."
    "Привлеки внимание."

    # Моника начинает принимать позы (смущенно)
    # Мелани смотрит
    img 9198
    with fade
    w
    img 9193
    with fade
    w
    sound snd_fabric1
    img 9199
    with fade
    w
    music Loved_Up
    img 9200
    with Dissolve(0.3)
    w
    img 9201
    with Dissolve(0.3)
    w
    img 9202
    with Dissolve(0.3)
    w
    img 9203
    with Dissolve(0.3)
    w
    img 9204
    with Dissolve(0.3)
    w
    img 9205
    with Dissolve(0.3)
    w
    img 9206
    with Dissolve(0.3)
    w
    img 9207
    with Dissolve(0.3)
    w



    # Мартышка говорит что стоп! Так не годится!
    # Виляй своей задницей посильнее! Не веди себя как жирная муха!
    music Groove2_85
    img 9208
    model1 "Стоп! Так не годится!"
    model1 "Виляй своей задницей посильнее!"
    "Не веди себя как жирная муха!"

    # Моника злится!!!
    # Смотрит на Мелани
    # Мелани улыбается
    music Power_Bots_Loop
    img 9209
    with fade
    m "!!!"
    img 9193
    with fade
    melanie "..."

    music Groove2_85
    img 9210
    with Dissolve(0.5)
    model1 "Иди сюда и покажи свою жирную задницу мне!"
    img 9211
    with fade
    w
    img 9212
    w

    # Мартышка говорит Монике снять верх.
    # Моника стесняется
    # Мартышка кричит чтобы быстрее снимала верх или убиралась отсюда!
    # Моника про себя говорит сучка, ненавижу!
    img 9213
    model1 "Сними свой верх, я хочу разглядеть твои дряхлые сиськи!"
    m "..."
    music Power_Bots_Loop
    img 9214
    with fade
    "!!!"

    img 9215
    model1 "А ну-ка быстро снимай верх!"
    "Или можешь убираться отсюда!!!"
    img 9216
    with fade
    mt "СУЧКА!!!"
    "НЕНАВИЖУ!!!"

    # Мартышка говорит чтобы попозировала так...
    music Groove2_85
    sound snd_fabric1
    img 9217
    with fade
    w
    img 9218
    with fade
    w
    img 9219
    model1 "Что ты так на меня смотришь, сучка?!"
    model1 "Убирай свои руки, я хочу тебя видеть!"

    music Power_Bots_Loop
    img 9220
    with fade
    w
    img 9221
    model1 "Начинай позировать..."
    music Loved_Up
    img 9222
    with fade
    w
    img 9223
    with Dissolve(0.3)
    w
    img 9224
    with Dissolve(0.3)
    w
    img 9225
    with Dissolve(0.3)
    model1 "Руки! Не закрывай руками!"
    "Это кастинг! Ты должна показать все что у тебя есть!"

    img 9226
    with Dissolve(0.3)
    w
    model1 "Нагнись ко мне! Я хочу рассмотреть их поближе!"
    music Groove2_85
    img 9227
    with fade
    w
    img 9228
    with Dissolve(0.3)
    w
    "Вот так, да..."
    img 9229
    mt "Я убью эту сучку..."
    model1 "Подвинься ближе!"
    img 9230
    with fade
    model1 "Я хочу потрогать твою грудь..."
    img 9231
    model1 "Надо-же... Я думала она менее уругая..."
    img 9232
    with fade
    w
    img 9233
    with Dissolve(0.5)
    w
    # Затем говорит что Стоп!
    # Это никуда не годится!
    music RocknRoll_loop
    img 9234
    with fade
    model1 "Стоп!"
    "Это никуда не годится!"

    img 9235
    with fade
    w
    img 9236
    with fade
    w



    # Довольная встает, идет, берет стул и садится как Моника тогда.

    # Говорит Монике встать сюда, указывая пальцем.
    # Моника в бешенстве, но встает.
    # Про себя думает что надо пережить это унижение, потом она сотрет ее в порошок!
    # Мартышка говорит Монике повернуться своей жирной задницей и снять все что осталось!
    # Моника говорит я не буду этого делать!
    # Мартышка говорит что тогда убирайся и не трать мое время!
    # Моника смотрит на Мелани, Мелани улыбается.
    # Моника начинает снимать колготки с шортами.
    # Мартышка улыбается.
    img 9237
    with fade
    model1 "Встань сюда!"
    img 9238
    with Dissolve(0.5)
    mt "!!!"
    img 9239
    with fade
    mt "Мне надо как-то собраться с силами..."
    "И пережить это унижение..."
    "Меня греет то что я сотру в порошок эту тварь..."
    img 9240
    with fade
    model1 "Повернись ко мне своей жирной задницей и сними все что на тебе осталось!"
    music Power_Bots_Loop
    img 9241
    m "Я не буду этого делать!"
    img 9242
    model1 "Тогда убирайся отсюда и не трать мое время!"
    img 9243
    with fade
    m "???"
    img 9244
    melanie "..."
    img 9245
    with fade
    w
    img 9246
    model1 "..."

    img 9247
    w
    music RocknRoll_loop
    sound snd_fabric1
    img 9248
    with fadelong
    w
    img 9249
    with Dissolve(0.5)
    w
    img 9250
    with fade
    model1 "Повернись ко мне задом!"
    img 9251
    with fade
    w
    img 9252
    with Dissolve(0.8)
    w
    img 9253
    model1 "Эй! Убери руки!"
    model1 "Что ты там прячешь?!"
    model1 "Если ты хочешь быть моделью, то у тебя не должно быть секретов!"
    img 9254
    w
    # Мартышка говорит чтобы встала задом и нагнулась!
    # Затем положила руки себе на зад и показала задницу как полагается.
    # Что мартышка хозяйка журнала и должна оценить моделей во всех ракурсах!

    img 9255
    model1 "А теперь нагнись!"
    model1 "Положи руки себе на зад и покажи свою задницу как полагается!"
    img 9256
    with fade
    model1 "Я хозяйка журнала и должна оценить моделей во всех ракурсах!"

    # Выбор положить руки или убежать.
    img 9257
    with fade
    menu:
        "Положить руки на зад.":
            pass
        "Убежать.":
            music Power_Bots_Loop
            img 9258
            with fade
            m "Я не буду этого делать!"

            return

    # Моника кладет руки.

    # Мартышка говорит: Итак, ты хочешь стать моделью этого журнала?
    img 9259
    with fadelong
    w
    model1 "Нагнись сильнее!"
    model1 "Мне так ничего не видно!"
    model1 "И не убирай руки со своей задницы!"
    img 9260
    with fade
    w
    img 9261
    model1 "Ха-ха! Славная задница!"
    img 9263
    with Dissolve(0.5)
    model1 "Мелани, отвечай!"
    model1 "Тебе нравится этот зад?"
    img 9264
    with fade
    melanie "Да, этот зад мне нравится..."
    melanie "Но все на Ваше усмотрение..."



    img 9265
    with fade
    model1 "Итак, ты хочешь стать моделью этого журнала?"
    music Power_Bots_Loop
    img 9266
    with fade
    menu:
        "Да, хочу.":
            pass
        "Убежать.":
            music Power_Bots_Loop
            img 9258
            with fade
            m "Я больше не могу этого выносить!"
            return
    mt "Мне надо как-то выдержать это унижение..."
    "Я знаю, Мелани доставляет удовольствие эта сцена..."
    "Но она сейчас мой единственный шанс на свободу..."
    "И мне придется пойти на все, чтобы использовать этот шанс..."
    music RocknRoll_loop
    img 9267
    with fade
    m "Да, хочу."
    # Моника отвечает: да, хочу
    img 9268
    model1 "Очень хочешь???"
    # ОЧень хочешь?
    music Power_Bots_Loop
    img 9269
    with fade
    menu:
        "Очень хочу!":
            pass
        "Убежать.":
            music Power_Bots_Loop
            img 9258
            m "Я больше не могу этого выносить!"
            return
    # Очень хочу!

    music RocknRoll_loop
    img 9270
    with fade
    m "Очень хочу!"

    img 9271
    with fade
    model1 "Тогда я буду говорить тебе какие позы принимать!"
    model1 "Давай, повеселимся!"
    # Далее идет серия кадров как Моника принимает разные обнаженные позы, а мартышка и Мелани улыбаются.

    img 9272
    with fade
    model1 "Начнем с этой!"
    img 9273
    with fade
    w
    model1 "Хе-хе!"
    model1 "Давай следующую!"
    img 9274
    with fade
    w
    img 9275
    with fade
    w
    model1 "Убери руку!"
    model1 "Не обязательно прикрываться, у тебя нет от нас секретов!"
    img 9276
    with Dissolve(0.3)
    w
    img 9277
    with Dissolve(0.3)
    w
    img 9278
    with fade
    model1 "Давай! Поползай еще!"
    model1 "Тебе это идет!"
    "Ползай, давай!"
    img 9279
    with Dissolve(0.3)
    w
    mt "Я выдержу!"
    mt "Я клянусь! Я выдержу!"

    img 9280
    with Dissolve(0.3)
    model1 "Встань на цыпочки! Покажи свою киску поближе!"

    img 9281
    with Dissolve(0.3)
    w
    model1 "Да, вот так! И не смотри на меня таким взглядом!"
    model1 "Я ведь знаю что тебе это нравится!"
    label gallery_9290:
    music Power_Bots_Loop
    img 9282
    m "Мелани!"
    m "Скоро это закончится?!"
    model1 "Молчать! Сучка!"
    model1 "Ты открыла рот! Ты не прошла кастинг!"

    music Groove2_85
    img 9284
    with fade
    m "???"
    img 9283
    with Dissolve(0.5)
    w
    img 9285
    with fade
    melanie "Да, модель себя плохо ведет..."
    melanie "Но я думаю можно дать ей последний шанс..."
    img 9286
    model1 "У тебя последний шанс, сучка!"
    model1 "Еще раз облажаешься и кастинг провален!"
    mt "!!!"
    model1 "А теперь подыми свою киску повыше!"
    model1 "Я хочу рассмотреть ее!"
    music RocknRoll_loop
    img 9287
    with fade
    model1 "Да, вот так!"
    img 9288
    with Dissolve(0.3)
    w
    img 9289
    with Dissolve(0.3)
    w
    img 9290
    with Dissolve(0.3)
    w
    img 9291
    with Dissolve(0.3)
    model1 "(так вот значит как выглядит киска на миллиард долларов...)"
    img 9292
    with fade
    model1 "Мелани, тебе нравится этот вид?"
    model1 "Тебе не кажется он ей очень идет?"

    music Groove2_85
    img 9293
    with fade
    melanie "Да, мне нравится этот вид."
    melanie "Он идет ей..."
    img 9294
    mt "!!!"
    # Мартышка раздвигает ноги и говорит Монике посмотреть что у нее там.
    # Монике отвратительно.
    # Мартышка говорит быстро! И показывает пальцем.
    # Моника садится и смотрит. Там между ног дилдо.
    img 9295
    with fadelong
    model1 "Посмотри-ка что у меня там есть!"
    img 9296
    m "!!!"
    img 9297
    with fade
    model1 "Быстро посмотри туда!"

    # Мартышка спрашивает Что там?
    # Моника отвечает там что-то есть, у Вас между ног...
    img 9298
    with fade
    model1 "Что там?"
    img 9299
    with fade
    m "Там что-то есть, у Вас между ног..."

    # Мартышка говорит чтобы Моника достала это...
    # Моника достает, это дилдо.
    model1 "Достань это!"
    music stop
    img 9300
    with fade
    w
    sound hlup10
    img 9301
    with fade
    m "..."

    # Мартышка говорит Монике встать. Моника встает.
    # Мартышка говорит Монике поднести дилдо ко рту и понюхать.
    # Моника нюхает.
    # Мартышка спрашивает чем пахнет эта вещь?
    # Моника отвечает что она пахнет Вами...
    # Мартышка говорит Монике открыть рот, очень широко.
    # Моника спрашивает зачем?
    # Мартышка ругается: Сучка, быстро открыла рот и хватит тратить мое время!
    # Моника открывает рот.
    music Power_Bots_Loop
    model1 "Теперь встань!"
    img 9302
    with fade
    w
    img 9303
    model1 "Поднеси это к своему рту."
    img 9304
    with fade
    "Теперь нюхай!"
    music stop
    m "!!!"
    sound snd_sniff1
    img 9305
    with Dissolve(0.5)
    w
    music Groove2_85
    model1 "Чем пахнет эта вещь?"
    img 9306
    with fade
    m "Она... Она пахнет Вами..."
    img 9307
    with Dissolve(0.5)
    mt "(меня сейчас стошнит)"
    img 9308
    with fade
    model1 "Теперь открой рот, очень широко!"
    m "Зачем?"
    music Power_Bots_Loop
    img 9309
    model1 "Сучка, быстро открыла рот и хватит тратить мое время!"

    music Groove2_85
    img 9310
    with fade
    w
    img 9311
    with Dissolve(0.5)
    w

    # Мартышка говорит: А теперь, вставь эту штуку себе в рот, максимально глубоко!
    # Мелани удивлена, подняла бровь...
    # Моника посмотрела на Мелани в возмущении.
    # Мелани смотрит на Монику и улыбается...
    # Говорит: Босс приказал...
    img 9312
    with fade
    model1 "А теперь вставь эту штуку себе в рот, максимально глубоко!"
    img 9313
    with Dissolve(0.5)
    melanie "???"
    music Power_Bots_Loop
    img 9314
    with fade
    m "!!!"
    img 9315
    melanie "..."
    img 9314
    m "???"
    music Groove2_85
    img 9316
    with fade
    melanie "Босс приказал..."


    # Моника смотрит на мартышку и думает: Я убью тебя...
    # Затем вставляет дилдо.
    img 9317
    with fade
    mt "Я УБЬЮ ТЕБЯ..."
    img 9318
    with fade
    w
    music stop
    img 9319
    with Dissolve(0.5)
    w
    sound hlup10
    img 9320
    with Dissolve(0.5)
    w
    music Groove2_85

    # Мартышка говорит: А теперь трахай свой рот! Хорошенько трахай!
    img 9321
    model1 "А теперь трахай свой рот!"
    "Хорошенько трахай!"
    # Моника начинает трахать свой рот.
    # видео
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_1.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_1_1 = Movie(play="video/v_Monica_Cabinet_Dildo_1_1.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_1_1
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_1.ogg"
    $ renpy.music.set_volume(0.7)
    scene black
    image videov_Monica_Cabinet_Dildo_1_2 = Movie(play="video/v_Monica_Cabinet_Dildo_1_2.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_1_2
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_1.ogg"
    $ renpy.music.set_volume(0.9)
    scene black
    image videov_Monica_Cabinet_Dildo_1_3 = Movie(play="video/v_Monica_Cabinet_Dildo_1_3.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_1_3
    with fade
    wclean
    music stop
    music Groove2_85
    $ renpy.music.set_volume(1.0)
    img 9322
    with fade
    w

    # Мартышка говорит что ты совершенно не владеет мастерством.
    # Говорит чтобы Моника села на колени. И не высовывала дилдо!!
    # v_Monica_Cabinet_Dildo_1_1 - 1_3
    music Groove2_85
    img 9323
    with fade
    model1 "Ты совершенно не умеешь это делать!"
    "Сядь на колени!"
    "И не высовывай дилдо из своего рта!"
    img 9324
    with fade
    w


    # Мартышка говорит убери руки! Моника убирает.
    # Мартышка наклоняется и начинает рукой трахать Монике рот дилдо.
    img 9325
    with Dissolve(0.5)
    model1 "Теперь убери руки!"
    img 9326
    with fade
    model1 "Я покажу тебе как это надо делать!"
    img 9327
    with Dissolve(0.3)
    model1 "Не двигайся!"
    img 9328
    with fade
    w


    # видео
    # v_Monica_Cabinet_Dildo_2_1 - 2_7
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(0.8)
    scene black
    image videov_Monica_Cabinet_Dildo_2_1 = Movie(play="video/v_Monica_Cabinet_Dildo_2_1.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_1
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_2_2 = Movie(play="video/v_Monica_Cabinet_Dildo_2_2.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_2
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(0.7)
    scene black
    image videov_Monica_Cabinet_Dildo_2_3 = Movie(play="video/v_Monica_Cabinet_Dildo_2_3.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_3
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(0.8)
    scene black
    image videov_Monica_Cabinet_Dildo_2_4 = Movie(play="video/v_Monica_Cabinet_Dildo_2_4.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_4
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_2_5 = Movie(play="video/v_Monica_Cabinet_Dildo_2_5.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_5
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(0.9)
    scene black
    image videov_Monica_Cabinet_Dildo_2_6 = Movie(play="video/v_Monica_Cabinet_Dildo_2_6.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_6
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_2_7 = Movie(play="video/v_Monica_Cabinet_Dildo_2_7.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_2_7
    wclean

    # Мартышка спрашивает: Ты поняла как надо себя трахать?
    # Моника отвечает: "Да, поняла" или послать к черту

    music stop
    music Groove2_85
    $ renpy.music.set_volume(1.0)
    img 9329
    with fade
    model1 "Ты поняла как надо себя трахать?"
    menu:
        "Да, я поняла.":
            pass
        "Послать ее к черту!":
            music Power_Bots_Loop
            img 9330
            with fade
            m "Иди ты к черту, сучка!!!"
            return

    # Да, я поняла.
    # Мартышка говорит: хорошо, покажи мне!
    # Ляг на спину и раздвинь ноги!
    # Моника с недовольным лицом делает это
    m "Да, я поняла."
    img 9331
    with fade
    model1 "Хорошо, покажи мне!"
    "Ляг на спину и раздвинь ноги!"
    music Power_Bots_Loop
    img 9332
    mt "!!!"
    img 9333
    with Dissolve(0.3)
    w
    music Groove2_85
    img 9334
    with fade
    w

    # Мартышка говорит: А теперь вставь эту штуку в себя!
    # Давай!
    img 9335
    with Dissolve(0.3)
    model1 "А теперь вставь эту штуку в себя!"
    "Давай!"
    music stop
    img 9336
    w
    sound hlup10
    img 9337
    with fade
    w
    music Groove2_85

    # Моника вставляет.
    # Мартышка говорит: А теперь трахай себя, сучка!
    # Трахай себя как следует!
    img 9338
    model1 "Теперь трахай себя, сучка!"
    "Трахай себя как следует!"

    # Выбор трахать себя или послать к черту
    img 9339
    menu:
        "Трахать себя.":
            pass
        "Послать к черту.":
            music Power_Bots_Loop
            img 9330
            m "Иди ты к черту, сучка!!!"
            return

    # Если трахать:
    # видео Моника трахает себя

#audio_Monica_Cabinet_Dildo_3
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_3_1 = Movie(play="video/v_Monica_Cabinet_Dildo_3_1.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_3_1
    with fade
    wclean

    music stop
    music Loved_Up2
    img 9340
    with Dissolve(0.3)
    w
    # Мартышка спрашивает в это время: Хочешь стать моделью?
    # Моника отвечает ДА или хочу поскорее закончить это
    # v_Monica_Cabinet_Dildo_3_1 - 3_4
    model1 "Хочешь стать моделью?"
    menu:
        "Да!":
            m "Да!"
        "Хочу поскорее закончить это...":
            m "Хочу поскорее закончить это..."


    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_3_2 = Movie(play="video/v_Monica_Cabinet_Dildo_3_2.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_3_2
    with fade
    wclean

    music stop
    music Loved_Up2
    img 9341
    with Dissolve(0.3)
    w
    model1 "Громче! Хочешь стать моделью этого журнала?!"
    # Мартышка говорит громче! Хочешь стать моделью этого журнала?!
    # Громко Да или когда закончится этот кошмар?
    #

    menu:
        "ДА!!!":
            m "ДА!!!"
        "Когда же закончится этот кошмар?!":
            m "Когда же закончится этот кошмар?!"
    # Мартышка спрашивает: Тебе нравится трахать себя?
    # Моника говорит: У меня странное чувство, незнакомое... Меня что-то заполняет...
    # Мартышка спрашивает громко: ТЕБЕ НРАВИТСЯ ТРАХАТЬ СЕБЯ???
    # Моника отвечает выбор: ДА!!!

    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_3_3 = Movie(play="video/v_Monica_Cabinet_Dildo_3_3.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_3_3
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_Dildo_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_Dildo_3_4 = Movie(play="video/v_Monica_Cabinet_Dildo_3_4.mkv", fps=30)
    show videov_Monica_Cabinet_Dildo_3_4
    with fade
    wclean

    music stop
    music Loved_Up2
    img 9342
    with Dissolve(0.3)
    w

    model1 "Тебе нравится трахать себя?"
    m "У меня... У меня странное чувство, незнакомое..."
    "Меня что-то заполняет..."
    model1 "ТЕБЕ НРАВИТСЯ ТРАХАТЬ СЕБЯ???"
    img 9343
    with fade
    menu:
        "ДААА!!!":
            pass

    # После этого Моника кончает: АААаааааа!! Ааааа!!!!
    # Моника лежит раскинув руки
    img 9344
    with Dissolve(0.3)
    sound snd_orgasm1
    m "Аааааааа!! АААААА!!!"
    img 9345
    with Dissolve(0.3)
    sound snd_orgasm2
    w
    img 9346
    with Dissolve(0.3)
    sound snd_orgasm3
    "АААаАААААаа!!!"
    # Следующий кадр, Моника привстает.
    # Что это было? Что со мной случилось??? У меня никогда такого не было...
    sound snd_bodyfall
    img black_screen
    with Dissolve(0.5)
    pause 2.0

    music Loved_Up
    img 9347
    with fadelong
    w
    img 9348
    with fade
    mt "Что это было? Что со мной случилось???"
    "У меня никогда такого не было..."

    # Мартышка говорит Мелани.
    # Мелани! Подойди к модели сверху и расставь ножки!
    # Пора завершить прошлую фотосессию!
    # Моника недоуменно смотрит на Мелани.
    # Мартышка говорит Мелани, чтобы та сняла трусики
    # Мелани снимает трусики и встает над Моникой
    img 9349
    with fade
    model1 "Мелани! Подойди к модели сверху и расставь ножки!"
    img 9350
    model1 "Пора завершить прошлую фотосессию!"
    # медленные шаги каблуков
    img 9351
    with fade
    w
    img 9352
    m "???"
    img 9353
    with fade
    model1 "Да, и не забудь снять свои трусики!"
    img 9354
    with Dissolve(0.5)
    w
    sound snd_fabric1
    img 9355
    with fade
    w


    # Моника говорит: Мелани, ты что? Что ты собираешь делать?
    # Мелани отвечет: Простите, Мэм. Это приказ Босса. Я здесь ни при чем...
    # Мартышка говорит чтобы Моника дотронулась языком до киски Мелани.
    img 9356
    m "Мелани, ты что?"
    img 9357
    with Dissolve(0.3)
    "Что ты собираешься делать?"
    img 9358
    with fade
    melanie "Вы это имели ввиду?"
    img 9359
    model1 "Да, стой вот так!"

    img 9360
    melanie "Простите, Мэм."
    img 9361
    with fade
    "Это приказ Босса."
    img 9362
    "Я здесь ни при чем..."
    img 9363
    model1 "Дотронься языком до ее киски!"
    img 9364
    with Dissolve(0.5)
    model1 "Давай!"
    img 9365
    with fade
    menu:
        "Мелани, ты сучка! Ты специально затеяла это!":
            pass
        "Мелани, пожалуйста, я не могу сделать это. (хорошие отношения с Мелани)" if melanieOffended2 == False and melanieOffended1 == False:
            # Выбор если Моника была добра к Мелани:
            # Мелани, пожалуйста, я не могу сделать это.
            # Мелани говорит что этого достаточно, чтобы пройти кастинг. Мартышка соглашается.
            music Groove2_85
            img 9366
            with fade
            m "Мелани, пожалуйста, я не могу сделать это."
            img 9367
            with fade
            melanie "Я думаю этого достаточно, чтобы пройти кастинг."
            "Босс, вы так не считаете?"
            model1 "..."
            model1 "Хорошо, пусть будет достаточно!"
            "Ты принята, сучка!"
            return
        "Мелани, пожалуйста, я не могу сделать это. (плохие отношения с Мелани) (disabled)" if melanieOffended2 != False or melanieOffended1 != False:
            pass

    # Иначе:
    # Моника шепчет: Мелани, ты сучка! Ты специально затеяла это!
    # Мелани отвечает что у Миссис Бакфетт есть приказ Босса.
    # Моника трогает язычком киску Мелани.
    # Мелани балдеет от удовольствия
    music Power_Bots_Loop
    img 9368
    m "Мелани, ты сучка! Ты специально затеяла это!"
    music Loved_Up
    img 9369
    with fade
    melanie "Миссис Бакфетт, у Вас есть приказ Вашего Босса."

    # sound todo !!!!!!!!!!!!!!!!!
    #лижет
    music audio_Monica_Cabinet_Licking1
    img 9370
    with fade
    w
    img 9371
    with Dissolve(0.3)
    w
    img 9372
    with Dissolve(0.3)
    w
    img 9373
    with Dissolve(0.3)
    w
    img 9374
    with Dissolve(0.3)
    w
    img 9375
    with Dissolve(0.3)
    w
    img 9376
    with Dissolve(0.3)
    w
    img 9377
    with Dissolve(0.3)
    w
    img 9378
    with fade
    w
    # Мартышка говорит: Стоп, стоп!
    # Что это за нежности Вы тут развели?!
    # Где страсть?!
    # Мелани! Что ты стоишь?! Быстро сядь ей на лицо и трахни его своей киской!
    # Мелани недоуменно смотрит на Мартышку.
    # Мартышка говорит: Ты что не поняла, Мелани?! Быстро сядь на эту сучку!
#label scene_test2:
    music Power_Bots_Loop
    img 9379
    model1 "Стоп, стоп!"
    "Что это за нежности Вы тут развели?!"
    "Где страсть?!"
    "Мелани! Что ты стоишь?!"
    "Быстро сядь ей на лицо и трахни его своей киской!"
    img 9380
    with fade
    melanie "???"
    img 9381
    model1 "Ты что, не поняла, Мелани?! Быстро сядь на эту сучку!"

    # Мелани продолжает смотреть удивленно на мартышку, затем смотрит вниз.
    # Моника (вид снизу) говорит: Эй, ты что собираешься делать?! Мелани?!...
    # Мелани говорит: Простите, Миссис Бакфетт, это приказ Босса.
    # Садится на Монику и начинает facesitting.
    img 9380
    with Dissolve(0.5)
    melanie "???"
    music Loved_Up
    img 9382
    with Dissolve(0.5)
    melanie "..."
    img 9383
    with fade
    m "Эй, ты что собираешься делать?!"
    "Мелани?!..."
    music stop
    img 9384
    with Dissolve(0.5)
    melanie "Простите, Миссис Бакфетт, это приказ Босса."
    sound hlup21
    img 9385
    with fadelong
    w
    music Loved_Up2
    # v_Monica_Cabinet_FaceSitting_1_1 - 1_4
    img 9386
    with Dissolve(0.3)
    w
    img 9387
    with Dissolve(0.3)
    w
    img 9388
    with Dissolve(0.3)
    w
    stop music
    play music "<from 0.23 loop 0.23>Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
#    play music "Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_1_1 = Movie(play="video/v_Monica_Cabinet_FaceSitting_1_1.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_1_1
    with fade
    wclean
    stop music
    play music "<from 0.23 loop 0.23>Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
#    play music "Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_1_2 = Movie(play="video/v_Monica_Cabinet_FaceSitting_1_2.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_1_2
    with fade
    wclean
    stop music
    play music "<from 0.23 loop 0.23>Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
#    play music "Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_1_3 = Movie(play="video/v_Monica_Cabinet_FaceSitting_1_3.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_1_3
    with fade
    wclean
    stop music
    play music "<from 0.23 loop 0.23>Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
#    play music "Sounds/audio_Monica_Cabinet_FaceSitting_1.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_1_4 = Movie(play="video/v_Monica_Cabinet_FaceSitting_1_4.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_1_4
    with fade
    wclean
    label gallery_9402:
    music stop
    music Loved_Up
    img 9389
    with Dissolve(0.3)
    w
    img 9390
    with Dissolve(0.3)
    w
    img 9391
    with Dissolve(0.3)
    w
    # Мартышка смотрит на это и говорит: Вот значит как выглядит pussy на миллиард долларов?
    # Черт, я не могу удержаться... Эта сучка...
    # Да пошло оно все!
    # Мартышка спрыгивает со стула и начинает лизать киску Моники.
    img 9392
    with fade
    model1 "Вот значит как выглядит киска на миллиард долларов?"
    img 9393
    model1 "Черт, я не могу удержаться... Эта сучка..."
    "Она правда красивая..."
    "Да пошло оно все!"

    # Видео threesome (всеобщие охи-вздохи)
    music Loved_Up2
    img 9394
    with fadelong
    w
    img 9395
    with Dissolve(0.3)
    w
    img 9396
    with Dissolve(0.3)
    w
    img 9397
    with Dissolve(0.3)
    w
    img 9398
    with Dissolve(0.3)
    w
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_2_1 = Movie(play="video/v_Monica_Cabinet_FaceSitting_2_1.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_2_1
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_2_2 = Movie(play="video/v_Monica_Cabinet_FaceSitting_2_2.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_2_2
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_2_3 = Movie(play="video/v_Monica_Cabinet_FaceSitting_2_3.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_2_3
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_2.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_2_4 = Movie(play="video/v_Monica_Cabinet_FaceSitting_2_4.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_2_4
    with fade
    wclean
    music stop
    music Loved_Up2
    img 9399
    with Dissolve(0.3)
    w
    img 9400
    with Dissolve(0.3)
    w
    img 9401
    with Dissolve(0.3)
    w
    img 9402
    with Dissolve(0.3)
    w
    img 9403
    with Dissolve(0.3)
    w

    # Мелани кончает.
    # sound todo !!!!!!
    sound snd_melanie_cum
    img 9404
    with fadelong
    melanie "ААААААааааааххххх!!!!"
    sound snd_melanie_cum2
    img 9405
    with Dissolve(0.5)
    melanie "ААААААааааааххххх!!!!"
    # Мелани встает.
    # Мартышка говорит: Мелани, ты все?
    # Теперь моя очередь!
    # И садится на лицо Моники.
    music Loved_Up
    img black_screen
    with Dissolve(1.0)
    img 9406
    with fadelong
    model1 "Мелани, ты все?"
    img 9407
    with Dissolve(0.5)
    "Теперь моя очередь!"

    # Мартышка говорит Мелани:
    # Мелани, ты пока можешь полизать ее киску, а потом мою!
    img 9408
    with Dissolve(0.5)
    model1 "Мелани, ты пока можешь полизать ее киску, а потом мою!"

    # Мелани надменно отвечает: Сегодня это твоя работа, девочка...
    # Мелани уходит
    music Groove2_85
    img 9409
    with fade
    melanie "Сегодня это твоя работа, девочка..."

    sound snd_fabric1
    img 9410
    with fade
    w
    img 9411
    with fade
    w
    music stop
    img 9412
    with Dissolve(0.5)
    w
    # Какое-то время Мартышка трется о лицо Моники.
    sound hlup21
    img 9413
    with fade
    w

    #видео
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_3_1 = Movie(play="video/v_Monica_Cabinet_FaceSitting_3_1.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_3_1
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_3_2 = Movie(play="video/v_Monica_Cabinet_FaceSitting_3_2.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_3_2
    with fade
    wclean
    stop music
    play music "Sounds/audio_Monica_Cabinet_FaceSitting_3.ogg"
    $ renpy.music.set_volume(1.0)
    scene black
    image videov_Monica_Cabinet_FaceSitting_3_3 = Movie(play="video/v_Monica_Cabinet_FaceSitting_3_3.mkv", fps=30)
    show videov_Monica_Cabinet_FaceSitting_3_3
    with fade
    wclean

    music stop
    music Loved_Up2
    img 9414
    with Dissolve(0.3)
    w
    img 9415
    with Dissolve(0.3)
    w
    img 9416
    with Dissolve(0.3)
    w
    img 9417
    with Dissolve(0.3)
    w
    img 9418
    with Dissolve(0.3)
    w
    img 9419
    with Dissolve(0.3)
    w

    #секретарша
    music Groove2_85
    img 9420
    with fade
    secretary "Ой! Кто это???"
    img 9421
    with fade
    melanie "Это новая модель..."
    melanie "Проходит кастинг..."
    img 9422
    with Dissolve(0.5)
    melanie "Хочет сниматься в нашем журнале..."
    music RnB4_100
    img 9423
    with fade
    secretary "(бедная девушка!)"

    img 9424
    with fade
    melanie "Пойдем, не будем их отвлекать от работы!"



    # Мартышка кончает.
    music Loved_Up2
    sound snd_monkey_cum
    img 9425
    with fade
    model1 "ААаааааааххххх!!!"
    # Встает. Говорит Монике чтобы она полизала ей зад!
    img 9426
    with fade
    model1 "А теперь лижи мой зад!"
    img 9428
    w
    # Моника смотрит на зад. Смотрит вокруг.
    img 9427
    mt "!!!"
    img 9429
    with fade
    mt "..."
    # Спрашивает, а где Мелани?
    m "А где Мелани?"


    # Мартышка отвечает: Зачем тебе Мелани, сучка? Здесь есть моя попка! Ее надо лизать!
    # Моника вскакивает и говорит: Ах ты сучка! Я убъю тебя! Ты ответишь за все что здесь было!!!
    # ТВАРЬ!!!
    # Моника напрыгивает на Мартышку.
    # Мартышка испугалась и, улыбаясь, убегает.
    img 9430
    with fade
    model1 "Зачем тебе Мелани, сучка?"
    "Здесь есть моя попка!"
    "Ее надо лизать!"

    music Power_Bots_Loop
    img 9431
    with Dissolve(0.5)
    mt "!!!"
    img 9432
    with fade
    m "Ах ты сучка! Я убъю тебя!"
    "Ты ответишь за все что здесь было!!!"
    "ТВАРЬ!!!"

    # Моника говорит: Мне надо одеться.
    # Одевается. Затем думает.
    # Где там эта Мелани?!?!
    # Пусть только попробует еще что-то захотеть!
    # Я уже достаточно здесь натерпелась!!!
    music Groove2_85
    img 9433
    with fadelong
    mt "Я достану эту тварь, клянусь!"
    "На что я только согласилась?!?!"
    "Меня, фактически, изнасиловала эта мартышка в своем-же собственном кабинете!"
    img 9434
    "А Мелани смотрела на это!"
    "О БОЖЕ!!!"
    img 9435
    with fade
    "Да, ставки очень высоки и мне приходится идти на подобные жертвы..."
    "Но, Моника, не забывай, тебе потом еще здесь жить и работать."
    "Не надо забывать о своей репутации!"
    "..."
    "Но я надеюсь что никто не узнает про то что здесь было."
    "Этой пигалице все-равно никто не поверит."
    "А Мелани... Не в ее интересах распространяться об этом."
    "Учитывая что она принимала участие..."
    "И что такое со мной произошло? Какая-то вспышка..."
    "Черт! Лучше я забуду обо всем этом побыстрее!"
    img 9436
    with fade
    "..."
    "Мне надо одеться."
    "..."
    sound snd_fabric1
    img black_screen
    with fade
    pause 2.0
    img 9437
    with fadelong
    "Где там эта Мелани?!?!"
    "Пусть только попробует еще что-то захотеть!"
    "Я уже достаточно здесь натерпелась!!!"

    return

### исправлено
label gallery_20503:

# Моника подходит к Мелани в гримерной (первый раз)
# Мелани сидит за гримерным столиком

    music Groove2_85
    img 20485
    with fadelong
    m "Мелани, ты вернулась?"
    img 20486
    with diss
    m "Где ты так долго была? Что с тобой случилось?"
    music Master_Disorder
    img 20487
    with fade
    melanie "Миссис Бакфетт, это Вы?"
    music Groove2_85
    img 20488
    with fade
    m "Да, Мелани, это Я!"
    m "И я ждала тебя все это время!"
    img 20489
    with diss
    m "Почему тебя так долго не было?!"
    m "Я уже думала что Маркус забрал тебя!"
    music Master_Disorder
    img 20490
    with fade
    melanie "Миссис Бакфетт, я не понимаю о чем Вы говорите..."
    music Groove2_85
    img 20491
    with fade
    m "Что значит ты не понимаешь, Мелани?"
    m "Я говорю про твой визит к Маркусу!"
    img 20492
    with diss
    m "Ты должна была решить с ним вопрос по поводу меня!"
    m "Но, вместо этого, ты куда-то пропала!"
    music Master_Disorder
    img 20493
    with fade
    melanie "Мэм, Я не знаю о чем и о ком Вы говорите..."
    music Pyro_Flow
    img 20494
    with fade
    m "Ты что, играешь со мной, Мелани?!"
    m "Ты прекрасно знаешь что я говорю о Маркусе!"
    # Мелани отворачивается
    music stop
    img black_screen
    with diss
    pause 2.0
    music Master_Disorder
    img 20495
    with fadelong
    melanie "Мэм, я не знаю кто это..."
    img 20496
    with diss
    melanie "Миссис Бакфетт, я очень занята. Пожалуйста, не отвлекайте меня..."

    img black_screen
    with diss
    pause 2.0
    music Groove2_85
    img 20497
    with fade
    mt "Она не хочет говорить про Маркуса..."
    mt "Она что, обманула меня и не ходила к нему?!"

    music stop
    img black_screen
    with fadelong
    music Malicious
    pause 1.0
    img 20498
    show screen vignette_screen
    with fadelong
    m "У меня странное чувство..."
    img 20499
    with Dissolve(1.0)
    m "Мелани?"
    img 20500
    with Dissolve(1.0)
    m "Мелани!"
    # убирает волосы
    img 20501
    with Dissolve(1.0)
    m "Что там? Что там такое?"
    img 20502
    with Dissolve(1.0)
    w
    music Villainous_Treachery
    img 20503
    with Dissolve(1.0)
    with hpunch
    w
    img 20504
    with hpunch
    m "О БОЖЕ!"
    sound snd_woman_scream1a
    img 20505
    with diss
    m "НЕТ!"
    hide screen vignette_screen
    img 20506
    with fade
    melanie "Миссис Бакфетт, я просила Вас не беспокоить меня."
    img 20507
    with diss
    m "!!!"
#            music stop
    img black_screen
    with diss
    pause 2.0
    return

    img black_screen
    with Dissolve(2.0)


    return

label gallery_20723:
    # Моника приходит к Мелани
    music stop
    img black_screen
    with Dissolve(2.0)
    call textonblack(t_("АПАРТАМЕНТЫ МЕЛАНИ")) from _rcall_textonblack_31
    img black_screen
    with Dissolve(2.0)
#    music Groove2_85
    music Villainous_Treachery
    img 20620
    with fadelong
    w
    img 20621
    with diss
    m "Мелани, я пришла..."
    img 20622
    with diss
    melanie "..."
    img 20623
    with fade
    m "И я жду ответы..."
    img 20624
    with fade
    melanie "Миссис Бакфетт."
    melanie "Я не уверена в правильности решения пригласить Вас..."
    melanie "Вы точно вошли незаметно? Вас никто не видел?"
    music Groove2_85
    img 20625
    with fadelong
    m "Мелани, меня никто не видел. Я уверена в этом."
    m "И, раз уж я пришла, позволь мне войти."
    img 20626
    with diss
    melanie "..."
    m "..."
    music stop
    img black_screen
    with diss
    pause 1.5
    music In_Your_Arms
    img 20627
    with fadelong
    melanie "Хорошо, Миссис Бакфетт..."
    melanie "Проходите."
    #
    sound highheels_short_walk
    img 20628
    with fadelong
    melanie "Присаживайтесь."
    img 20629
    with diss
    melanie "Давайте выпьем вина..."
    img 20630
    with fade
    m "..."
    music Groove2_85
    img 20631
    with fade
    m "Мелани, давай перейдем сразу к делу."
    m "Ты видела Маркуса?"
    img 20632
    with diss
    m "Что он сказал тебе?"
    m "Как мне избавиться от него?!"
    music Villainous_Treachery
    img 20633
    with fade
    melanie "Миссис Бакфетт..."
    melanie "Вы задаете слишком прямые вопросы."
    melanie "Для меня большой риск общаться с Вами..."
    img 20634
    with diss
    m "Мелани, я задаю те вопросы, которые меня больше всего волнуют!"
    music stop
    img black_screen
    with diss
    pause 1.0
    music In_Your_Arms
    sound pour_wine
    img 20635 #наливает
    with fadelong
    melanie "Выпейте вина, Миссис Бакфетт."
    img 20630
    with diss
    m "..."
#    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.5
#    music In_Your_Arms
    img 20636
    with fadelong
    m "Хорошо, Мелани."
    img 20637
    with diss
    mt "Вкусное вино..."
    mt "Как вкусно..."
    mt "Я уже отвыкла..."
    melanie "Зря Вы не согласились, Миссис Бакфетт..."
    sound plastinka2
    music Groove2_85
    img 20638
    with diss
    w
    img 20639
    with diss
    m "На что я зря не согласилась, Мелани?"
    img 20640
    with fade
    melanie "На то, чтобы поехать на ферму, когда Мистер Маркус предложил Вам..."
    music Power_Bots_Loop
    img 20641
    with hpunch
    m "ЧТО?!"
    img 20642
    with fade
    m "Мелани, ты представляешь о чем идет речь?!"
    m "Ты, вообще, знаешь что это за место?!"
    img 20643
    with diss
    m "Как ты можешь говорить мне такое?!"
    music Villainous_Treachery
    img 20644
    with fadelong
    melanie "Я знаю что это за место, Миссис Бакфетт..."
    melanie "Я видела его..."
    img 20645
    with vpunch
    m "Ты была там?!"
    m "Ты видела это... это место...?"
    m "Оно действительно такое, как говорит Маркус?!"
    sound highheels_short_walk
    img 20646
    with fade
    melanie "Да, Миссис Бакфетт..."
    melanie "Оно... Даже хуже..."
    melanie "И вскоре Вы отправитесь туда..."
    music Power_Bots_Loop
    img 20647
    with hpunch
    m "Нет! Я не отправлюсь туда, никогда!"
    music Villainous_Treachery
    img 20648
    with fade
    melanie "Вы отправитесь... И будете делать что Вам скажут..."
    melanie "Вы будете умолять о том, чтобы оказаться на обложке их журнала..."
    music Power_Bots_Loop
    img 20649
    with diss
    m "Я знаю что там за журнал!"
    m "Я не буду умолять об этом!"
    music Villainous_Treachery
    img 20650
    with fade
    melanie "Будете, как и остальные девушки, которые находятся там."
    melanie "Вы будете удивлены, когда увидите КОГО там можно встретить среди них..."
    melanie "У наших хозяев действительно хороший вкус..."
    img 20651
    with diss
    m "Наших хозяев?!"
    img 20652
    with fade
    melanie "Но Вам не удастся добиться ничего..."
    melanie "Вы упустили свой шанс."
    img 20653
    with diss
    melanie "Теперь Вы попадете туда в качестве..."
    img 20654
    with diss
    melanie "Я не буду об этом..." # Отворачивается
    img 20655
    with fade
    m "Нет, Мелани! Я лучше умру!"
    img 20656
    with diss
    melanie "Миссис Бакфетт..."
    melanie "Я видела там вещи..."
    img 20657
    with diss
    melanie "Вещи... которые похуже смерти..."
    img 20658
    with vpunch
    m "!!!"
    music stop
    img black_screen
    with diss
    pause 1.5
    music In_Your_Arms
    img 20659
    with fadelong
    melanie "Выпейте вина, Миссис Бакфетт..."
#    music stop
    img black_screen
    with Dissolve(1.0)
    pause 1.5
    show screen camera_viewfinder_screen()
    sound camera_lens1
    img 20660 # photo
    with Dissolve(0.2)
    w
    sound camera_lens1
    img 20661
    with Dissolve(0.2)
    w
    sound camera_lens1
    img 20662 #photo
    with Dissolve(0.2)
    w
    call photoshop_flash() from _rcall_photoshop_flash_190
    w

    #
    music stop
    img black_screen
    hide screen camera_viewfinder_screen
    with diss
    pause 1.5
    music Groove2_85
    img 20663
    with fadelong
    m "Итак, Мелани."
    m "Почему ты утверждаешь что я обязательно попаду туда?"
    music Power_Bots_Loop
    img 20664
    with vpunch
    m "Ты что, заодно с этими людьми?"
    music Groove2_85
    img 20665
    with fade
    melanie "Нет, Миссис Бакфетт."
    melanie "Я на Вашей стороне..."
    img 20666
    with diss
    m "Но как? Как ты выбралась оттуда?!"
    music Master_Disorder
    img 20667
    with fade
    melanie "Я... не выбралась оттуда, Миссис Бакфетт..."
    img 20668
    with diss
    melanie "Оттуда невозможно выбраться..."
    music Power_Bots_Loop
    img 20669
    with fade
    m "Но ты сидишь здесь, передо мной!"
    music Master_Disorder
    img 20670
    with diss
    melanie "Миссис Бакфетт..."
    melanie "Я была глупа и думала что весь мир принадлежит мне."
    melanie "Что я могу добиться любой цели и поставить на колени любого мужчину..."
    m "..."
    img 20672
    with diss
    melanie "Я ошибалась..."
    melanie "Есть мужчины, которые гораздо сильнее меня..."
    img 20671
    with diss
    melanie "И, все на что хватило моих сил - это убедить их в том, что пока я полезнее здесь."
    img 20673
    with diss
    melanie "Нежели там..."
    melanie "Потому я не проходила тех тренировок, которые проходят все, кто попадает туда."
    img 20674
    with diss
    m "..."
    img 20675
    with fade
    melanie "Это бы..."
    melanie "Это бы изменило меня..."
    melanie "И я бы не смогла быть в той форме, чтобы сохранять эффективность здесь..."
    melanie "По эту сторону Фермы 218..."
    img 20676
    with hpunch
    m "!!!"
    music Villainous_Treachery
    img 20677
    with fade
    melanie "Но меня могут вернуть туда в любой момент..."
    melanie "Например, если я вдруг стану помогать Вам..."
    melanie "Для меня большой риск даже просто говорить с Вами, Миссис Бакфетт..."
    music Groove2_85
    img 20678
    with fadelong
    m "Мелани! Все что ты говоришь..."
    m "Этот Маркус..."
    m "Ведь он всего-лишь полицейский!"
    img 20679
    with diss
    m "Ведь есть законы, есть пресса."
    m "Есть здравый смысл, в конце концов!"
    img 20680
    with fade
    m "Я была шокирована после того что случилось и действительно испугалась этих людей."
    m "Но сейчас понимаю, что это все выглядит настолько нереально, что просто не может быть правдой!"
    img 20681
    with diss
    m "Может быть обратиться в другой полицейский участок или в организацию, которая выше?"
    m "Пойти к другому адвокату, обратиться за получением новых документов..."
    music stop
    img black_screen
    with diss
    pause 1.0
    music Master_Disorder
    img 20682
    with fadelong
    melanie "Миссис Бакфетт..."
    melanie "Вы имели деньги и власть."
    img 20683
    with diss
    melanie "Неужели Вы не поняли как устроен этот мир?"
    melanie "Вы говорите про законы?"
    music Power_Bots_Loop
    img 20684
    with fade
    m "Да, Мелани! Я говорю про законы!"
    sound snd_bodyfall
    img 20685
    with diss
    m "Эта ферма! Это какое-то безумие! Произвол!"
    m "Это нарушение всех мыслимых норм!"
    music Master_Disorder
    img 20686
    with fadelong
    melanie "Миссис Бакфетт."
    melanie "Закон - это лишь инструмент для управления теми, у кого нет власти."
    melanie "Для тех, у кого есть деньги и власть, закон не существует..."
    music Groove2_85
    img 20687
    with diss
    m "Это неправда, Мелани!"
    m "Даже богача можно засадить за решетку!"
    melanie "Да, Миссис Бакфетт, можно..."
    melanie "Но..."
    #
    music stop
    img black_screen
    with diss
    pause 1.5
#    music Groove2_85
    music Loved_Up
    img 20688
    with fadelong
    melanie "Представьте, что Ваш водитель задавил собачку."
    melanie "Хозяин собачки оказался обычным человеком."
    melanie "Закон бы действовал на Вас?"
    img 20689
    with diss
    melanie "Нет. Вы бы позвонили Дику и во всем виноват оказался бы обычный человек."
    melanie "А если бы это оказалась собачка Виктории, его секретаря?"
    sound highheels_short_walk
    img 20690
    with fade
    m "!!!"
    img 20691
    with diss
    melanie "Тогда бы закон работал как обычно."
    melanie "Вы бы заплатили компенсацию..."

#    m "!!!"
    sound Jump1
    img 20692
    with diss
    melanie "Все потому, что появился бы другой человек, также имеющий власть."
    melanie "И закон в его руках был бы просто интрументом."

    img 20693
    with diss
    melanie "Миссис Бакфетт, закон работает только для равных..."
    melanie "Вы сейчас можете забыть про это..."
    m "И ты хочешь сказать что Маркус..."

    sound Jump1
    img 20694 # Мелани нагибается
    with diss
    w
    sound Jump2
    img 20695
    with diss
    melanie "Да, Миссис Бакфетт."
    melanie "Мистер Маркус - это очень... очень большой человек..."
#    sound snd_back1
    sound Jump1
    img 20696
    with diss
    m "Большой человек, который работает простым полицейским?"

    music Groove2_85
    sound highheels_short_walk
    img 20697
    with fadelong
    melanie "Мистер Маркус не является частью системы, Миссис Бакфетт..."
    melanie "Он использует ее, потому что этого хочет."
    melanie "Так ему удобнее... Быть полицейским..."

    music Power_Bots_Loop
    img 20698
    with vpunch
    m "Он просто мерзавец! И все!"
    music Master_Disorder
    img 20699
    with fadelong
    melanie "Нет, Миссис Бакфетт."
    melanie "Я не считаю его мерзавцем."
    m "Почему, Мелани?!"
    m "Как ты можешь оправдывать его?!"

    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.0
    img 20700
    with fadelong
    melanie "Миссис Бакфетт."
    melanie "Мистер Маркус - это мужчина."
    melanie "Мужчина, который имеет силу и власть поступать так как он хочет."
    melanie "Вы не встречали таких сильных мужчин ранее..."
    melanie "И вот... встретили..."
    melanie "Впрочем и я тоже..."

    music Power_Bots_Loop
    img 20701
    with fade
    m "Силу? Власть?!"
    m "Он просто работает на каких-то безумных хозяев, которые делают немыслимые вещи!"

    music stop
    img black_screen
    with diss
    pause 1.0
    music Master_Disorder
    img 20702
    with fadelong
    melanie "Нет, Миссис Бакфетт."
    melanie "Мистер Маркус имеет свое мнение на все вопросы."
    melanie "Например, он помогает Вам вместо того, чтобы делать так, как его просят люди, стоящие за ним..."

    music Power_Bots_Loop
    img 20703
    with fade
    m "МАРКУС?! ПОМОГАЕТ?! МНЕ???"
    m "Маркус только и ждет, чтобы забрать меня!"

    music Master_Disorder
    img 20704
    with fadelong
    melanie "Все несколько иначе, Миссис Бакфетт..."
    melanie "Есть люди, которые стоят за Мистером Маркусом."
    melanie "Они тоже обладают огромном властью и влиянием."
    melanie "И они ждут Вас."
    img 20705
    with diss
    melanie "Дик нарушил их планы."
    melanie "Он хороший адвокат. Он имеет влияние и опыт, но..."
    m "Что НО...?"
    melanie "Проблемы, которые создают действия Дика, они..."
    img 20706
    with diss
    m "..."
    music stop
    img black_screen
    with diss
    pause 1.0
    music Villainous_Treachery
    img 20707
    with fadelong
    melanie "Они несколько преувеличены Мистером Маркусом в глазах людей, которые ждут Вас..."
    melanie "Мистер Маркус может забрать Вас в любой момент, Миссис Бакфетт..."
    img 20708
    with hpunch
    m "!!!"
    music Master_Disorder
    img 20709
    with diss
    melanie "Но, почему-то, он этого не делает..."
    music Power_Bots_Loop
    img 20710
    with diss
    m "Почему?!"
    m "Если он может забрать меня в любой момент, то почему он ждет от меня каких-то нарушений закона?!"
    music Master_Disorder
    img 20711
    with fade
    melanie "Вы нравитесь ему, Миссис Бакфетт."
    melanie "Он играет с Вами."
    melanie "Однако, если Вы действительно нарушите хоть что-то, ему придется забрать Вас."
    melanie "На него давят люди, которые стоят за ним."
    img 20712
    with diss
    melanie "Они очень ждут, чтобы попробовать Вас... в деле..."
    m "!!!"
    img 20713
    with fadelong
    melanie "Это как кот, который играет с пойманной мышкой."
    melanie "Мышка пытается убежать, но у нее нет шансов, она уже поймана..."
    melanie "Радуйтесь тому, что у Вас есть какое-то время до того, пока с Вами наиграются..."
    melanie "Итог один. В конце концов, Вы окажетесь в том месте..."
    music Power_Bots_Loop
    img 20714
    with hpunch
    m "!!!"

    img 20715
    with fade
    m "Я не верю..."
    m "Этого не может быть..."
    m "Должен быть какой-то выход..."

    img 20716
    with diss
    m "..."
    music stop
    img black_screen
    with diss
    pause 2.0
    music Hidden_Agenda
    img 20717
    with fadelong
    m "Мелани, я признаю что ты в чем-то разбираешься больше меня..."
    m "Подскажи, что мне делать. Как выбраться из всего этого?"

    sound snd_bodyfall
    music Loved_Up
    img 20718 # толкает
    with diss
    w
    sound Jump1
    img 20719
    with fade
    melanie "Вам не выбраться из этого, Миссис Бакфетт."
    melanie "Я советую Вам затянуть эту игру."
    img 20720
    with diss
    melanie "Создайте для Мистера Маркуса дополнительный интерес к Вам."
    melanie "Проявите инициативу."
    img 20721
    with fade
    m "Что ты имеешь ввиду, Мелани?"
    m "Какую инициативу я должна проявить?"

    img 20722
    with diss
    melanie "Придите к нему, придите к Мистеру Маркусу."
    img 20723
    with diss
    melanie "Постарайтесь понравиться ему."
    img 20724
    with fade
    melanie "Не бегайте от него, ведь он помогает Вам."
    music Power_Bots_Loop
    img 20725
    with fade
    m "Придти к человеку, который лишил меня всего?!"
    m "И, при этом, пытаться понравиться ему?!"
    music Master_Disorder
    img 20726
    with fade
    melanie "Да, это не поможет Вам избежать участи."
    melanie "Но может помочь попасть на ферму в качестве той, кто согласилась на это добровольно."
    melanie "Вы, возможно, сможете исправить совершенную ошибку..."
    sound Jump1
    music Loved_Up2
    img 20727 #Мелани залезает
    with diss
    w
    music Power_Bots_Loop
    sound plastinka2
    img 20728
    with vpunch
    m "Мелани, за кого ты принимаешь меня?!"
    m "Я что, по твоему, сошла с ума?!"

    music stop
    img black_screen
    with diss
    pause 1.5
    music Groove2_85
    img 20729
    with fadelong
    melanie "Миссис Бакфетт."
    melanie "Я могу сказать Вам честно."
    melanie "Я считала Вас надменной дурой, которой богатство и власть достались благодаря случайности."

    img 20730
    with diss
    m "..."

    img 20731
    with fade
    melanie "Когда с Вами произошли изменения, Я даже не представляла с чем Вы столкнулись."
    melanie "Сейчас, зная про Вас все, я могу сказать что восхищаюсь Вами."
    melanie "В борьбе за свою свободу Вы проявляете такую волю и характер, что..."
    img 20732
    with diss
    melanie "Что я начинаю считать Вы заслуживали то положение, которое имели..."

    img 20733
    with diss
    m "..."

    img 20734
    with fade
    melanie "Потому я искренне желаю удачи Вам."
    img 20735
    with diss
    m "И ты не винишь меня в том что случилось с тобой?"
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.5
    music Power_Bots_Loop
    img 20736
    with fadelong
    melanie "..."
    img 20737
    with hpunch
    melanie "Я ненавижу Вас за это, Миссис Бакфетт."


    img 20738
    with diss
    m "Ты ненавидишь меня, но помогаешь мне?"

    music stop
    img black_screen
    with diss
    pause 1.5
    music Groove2_85
    img 20739
    with fadelong
    melanie "Я пытаюсь извлечь выгоду даже из этой безнадежной ситуации."
    melanie "Я умею справляться со своими эмоциями..."
    img 20740
    with diss
    m "Спасибо, Мелани."

    music Master_Disorder
    img 20741
    with fade
    melanie "Вы сниметесь в костюме черного лебедя..."

    music Groove2_85
    img 20742
    with diss
    m "Что? Мелани, про что ты говоришь?"

    img 20743
    with fade
    melanie "Биф. Он заставляет меня сниматься в костюме черного лебедя."
    melanie "Мне не уйти из этой компании сейчас, Миссис Бакфетт."
    melanie "Но я не хочу проходить эту фотосессию."

    music Hidden_Agenda
    img 20744
    with diss
    m "У этого костюма нет трусиков..."
    music Groove2_85
    img 20745
    with fade
    melanie "Да, именно."
    melanie "И Вы пройдете эту фотосессию вместо меня, Миссис Бакфетт."

    music Power_Bots_Loop
    img 20746
    with diss
    m "Мелани, ты сошла с ума?!"
    m "Я не буду сниматься в таком виде!"

    music Villainous_Treachery
    img 20747
    with fade
    melanie "Вы будете, Миссис Бакфетт."
    melanie "Иначе, клянусь, Вы отправитесь к Маркусу очень скоро!"
    melanie "Помочь Вам очень сложно, а сделать наоборот очень легко..."

    img 20748
    with diss
    m "!!!"

#    melanie "Но я умею справляться со своими эмоциями..."
#    m "Мелани, спасибо. Я подумаю над твоими словами."

    img 20749
    with fade
    melanie "А сейчас Вы можете идти, Миссис Бакфетт."
    melanie "Я не хочу рисковать и далее, общаясь с Вами..."


    menu:
        "Попросить деньги у Мелани.":
            music Hidden_Agenda
            m "Мелани."
            m "Раз уж ты желаешь мне удачи..."
            m "Скажи, у тебя ведь есть деньги?"
            melanie "У меня достаточно денег, Миссис Бакфетт."
            img 20750
            with fade
            m "Могла бы ты мне немного одолжить..."
            melanie "Нет, Миссис Бакфетт. Я не собираюсь рисковать, помогая Вам..."
            m "Я поняла, Мелани. Всего хорошего."
            melanie "Всего хорошего, Миссис Бакфетт..."
        "Уйти.":
            pass


    return

label gallery_15390:
    # Мелани сидит перед зеркалом в гримерке, поправляет макияж кистью для мейкапа
    music ZigZag
    img 15392
    with fadelong
    w
    img 15393
    with fade
    melanie_t "Я выгляжу какой-то уставшей..."
    melanie_t "Мне нужно взять несколько выходных и отдохнуть."
    img 15394
    with diss
    melanie_t "Возможно, стоит полететь на острова... Океан, пальмы, никаких папарацци..."
    melanie_t "Нужно будет подойти к Бифу, попросить у него небольшой отпуск."
    img 15395
    with diss
    melanie_t "Он не сможет мне отказать."
    melanie_t "Еще ни один мужчина не отказывал мне. И Биф не станет первым..."
    # в гримерку заходит серкретарша Бифа
    music stop
    img black_screen
    with diss
    sound highheels_run1
    pause 2.0
    music Groove2_85
    img 15386
    with fadelong
    secretary "Мисс Мелани..."
    # Мелани поворачивается к ней
    img 15387
    with diss
    melanie "Да?"
    img 15388
    with fade
    secretary "Сейчас звонила Мисс Виктория."
    # Мелани вопросительно смотрит на нее
    img 13932
    with diss
    melanie "И что Мисс Виктория сказала?"
    img 13930
    with fade
    secretary "Она просила передать Вам, что она сегодня ждет Вас у себя."
    secretary "Она сказала, что это очень срочно."
    # Мелани смотрит на секретаря вопросительно
    img 15389
    with diss
    melanie "Говорила ли Мисс Виктория еще что-нибудь?"
    img 15390
    with fade
    secretary "Нет, Мисс Мелани. Она только сказала, что это очень срочно."
    img 15391
    music Master_Disorder
    with diss
    melanie "..."

### меню выбора взято из другого диалога

    menu:
        "Идти на встречу с Викторией":
            pass
        "Отказаться от встречи (пропуск всех событий с Викторией)":
            music Groove2_85
            img 13932
            with fade
            melanie "Если эта девочка еще раз позвонит, то передайте ей, что у меня нет времени на это." #+
            img 13933
            with diss
            secretary "Хорошо, Мисс Мелани, я передам."
            return
###
    music ZigZag
    img 13929
    with fade
    melanie "Спасибо. Я проведаю Мисс Викторию сегодня."
    melanie "Вы можете идти."
    # секретарша уходит, Мелани поворачивается снова к зеркалу и задумчиво смотрит на свое отражение
    music stop
    img black_screen
    with diss
    sound highheels_run1
    pause 2.0
    music Master_Disorder
    img 13935
    with fade
    melanie_t "Что этой мерзкой Мисс Виктории снова нужно от меня?"
    melanie_t "Почему Я должна ехать к ней по первому же ее звонку?"
    melanie_t "..."
    # Мелани снова берет в руки кисть для мейка и проводит ею по скуле
    img 15396
    with diss
    melanie_t "Эта мелкая стерва возомнила себя самой умной и хитрой..."
    melanie_t "Нужно будет придумать, как поставить ее на место."
    img 15397
    with fade
    melanie_t "Кто она вообще такая, чтобы вести себя со МНОЙ подобным образом?"
    melanie_t "Нужно во что бы то ни стало лишить эту сучку возможности шантажировать меня."
    img 15398
    with diss
    melanie_t "Если я узнаю, кто снабжает ее моими фотографиями, шпионя за мной..."
    melanie_t "То у меня будет хоть какая-то зацепка. Я смогу договориться с этим папарацци."
    img 13936
    with diss
    melanie_t "Уверена, что все дело в деньгах."
    melanie_t "..."
    # положила кисть на столик, поправляет прическу
    music ZigZag
    img 15399
    with fade
    melanie_t "Конечно, проще всего было бы соблазнить Дика."
    melanie_t "В моих силах сделать так, чтобы он вышвырнул эту сучку на улицу..."
    img 15400
    with diss
    melanie_t "Где он ее и подобрал, я так полагаю."
    melanie_t "Но ведь она сидит и охраняет Дика, как цепной пес."
    img 13935
    with diss
    melanie_t "Хм... Интересно, Дик вообще ходит куда-нибудь без нее?"
    melanie_t "Нужно будет узнать об этом."
    # Мелани смотрит на себя в зеркало
    music Power_Bots_Loop
    img 15401
    with fade
    melanie_t "А пока мне придется поехать к этой мелкой сучке..."
    melanie_t "И узнать, что взбрело ей в голову на этот раз."
    music ZigZag
    img 15402
    with diss
    melanie_t "Сейчас мне нужно ехать в офис Дика."
    # встает со стула
#    $ log1 = t_("Пойти в офис Дика и узнать, что нужно Виктории")
    return

label gallery_15410:
    # Моника смотрит на Мелани удивленно
    music ZigZag
    sound snd_door_open1
    img 15409
    with fadelong
    w
    sound highheels_short_walk
    img 15410
    with fade
    m "Мелани? Ты ко мне?"
    music Master_Disorder
    img 15411
    with diss
    mt "Мелани не просто так зашла ко мне в гости. Что-то случилось."
    mt "Надеюсь, это не касается Маркуса!"
    mt "!!!"
    # Мелани равнодушно
    music ZigZag
    img 15412
    with fade
    melanie "Миссис Бакфетт. Я сейчас была на встрече с нашим общим хорошим другом..."
    # Моника явно напугана
    music Master_Disorder
    img 15413
    with diss
    mt "!!!"
    sound Jump1
    img 15414
    with diss
    m "Нашим общим д-другом?"
    music ZigZag
    img 15415
    with fade
    melanie "Да, Миссис Бакфетт. Этот человек хочет сегодня встретиться с нами."
    img 15416
    with diss
    mt "!!!"
    img 15417
    with fade
    w
    img 15418
    with diss
    melanie "Встреча состоится вечером у меня."
    melanie "В Ваших же интересах, Миссис Бакфетт, присутствовать на встрече..."
    # Моника смотрит на Мелани ошарашенно
    img 15419
    with fade
    julia "???"
    img 15420
    with diss
    melanie "..."
    music Master_Disorder
    img 15421
    with fade
    mt "Встреча с Маркусом?!"
    mt "У Мелани дома?!"
    img 15422
    with diss
    mt "Сегодня?!"
    mt "!!!"
    # Юлия заинтересованно наблюдает за их диалогом
    # Моника смотрит на Юлию, потом снова на Мелани, берет себя в руки
    img 15423
    with fade
    w
    music ZigZag
    img 15424
    with diss
    m "Я поняла, Мисс Мелани. Я приду вечером."
    img 15425
    with fade
    melanie "Договорились, Миссис Бакфетт."
    # Мелани уходит
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    sound2 snd_door_close1
    pause 2.0
    # у Моники в заданиях появляется "Пойти вечером к Мелани домой на встречу с 'другом'"
    #$ log1 = t_("Пойти вечером к Мелани домой на встречу с 'другом'")
    return

label gallery_15443:
    # Биф, как обычно, сидит за столом с бутылкой алкоголя
    music Groove2_85
    img 15428
    with fadelong
    w
    img 15429
    with fade
    biff "А! Моя лучшая цыпочка пришла!"
    biff "Чем порадуешь папочку сегодня?"
    music ZigZag
    img 15430
    with diss
    melanie_t "У него вокруг одни цыпочки... Как это пошло..."
    sound highheels_short_walk
    img 15431
    with fade
    melanie "Биф, я хотела поговорить с тобой."
    melanie "Надеюсь, ты мне не откажешь..."
    # смотрит на него заигрывающе, Биф сидит расплывается в улыбке
    music Groove2_85
    img 15432
    with diss
    biff "Цыпочка что-то хотела попросить у меня?"
    biff "Говори. Папочка сегодня добрый."
    music Hidden_Agenda
    img 15433
    with fade
    melanie "..."
    sound Jump1
    img 15434
    with diss
    melanie "Возможно, ты позволишь мне..."
    melanie "Взять несколько выходных дней и немного отдохнуть?"
    music Groove2_85
    img 15435
    with fade
    biff "Цыпочка устала? Конечно, папочка позволит ей отдохнуть!"
    biff "..."
    biff "Только цыпочка сначала сделает фотосессию!"
    img 15436
    with diss
    melanie "Какую фотосессию?"
    img 15437
    with fade
    biff "Мне нужны фотографии для следующего номера журнала."
    biff "И я хочу видеть на этих фотографиях твое лицо, цыпочка..."
    img 15438
    with diss
    biff "И не только лицо..."
    biff "У цыпочки есть, что показать в объектив камеры."
    # Мелани приподнимает бровь удивленно
    music ZigZag
    img 15439
    with fade
    melanie "..."
    music Groove2_85
    img 15440
    with diss
    biff "В прошлый раз я просил тебя сделать фотосессию."
    biff "А ты сама не стала в ней сниматься."
    img 15441
    with fade
    biff "Поэтому мне сейчас нужны именно твои фотографии."
    biff "А не той цыпочки, которая притворяется Моникой Бакфетт."
    music ZigZag
    img 15442
    with diss
    melanie_t "Хм... Я надеялась, что его устроят фотографии Миссис Бакфетт..."
    img 15443
    with fade
    melanie "В каком костюме нужно провести съемку?"
    music Groove2_85
    img 15444
    with diss
    biff "Мне нравится твой костюм с красными трусиками..."
    img 15445
    with diss
    biff "Хочу увидеть тебя в нем на фотографиях!"
    melanie "..."
    img 15446
    with fade
    biff "Сделай эту фотосессию и можешь взять несколько выходных."
    biff "Папочка добрый, папочка разрешает."
    # сидит с видом "хозяин мира", улыбается
    music ZigZag
    img 15447
    with diss
    menu:
        "Согласиться на фотосессию":
            pass
        "Отказаться (пропуск фотосессии)":
            music ZigZag
            img 15448
            with fade
            melanie_t "Он намекнул, что ему нужны откровенные фотографии..."
            melanie_t "В этом костюме с трусиками другие фотографии и не получатся..."
            melanie_t "..."
            melanie_t "Думаю, Биф обойдется без этих фотографий."
            img 15449
            with diss
            melanie "Биф, я пока не совсем готова к фотосессии..."
            melanie "Я ее сделаю, но позже..."
            img 15450
            with diss
            melanie_t "... возможно."
            img 12847
            with fade
            biff "Папочка добрый, поэтому разрешает тебе подумать."
            return # пропуск фотосессии, сразу в гримерку, оттуда домой на девичник
    img 15448
    with fade
    melanie_t "Что ж... У меня как раз есть время до встречи с мелкой дрянью Викторией."
    img 15451
    with diss
    melanie "Хорошо, Биф. Я сделаю, как ты хочешь." # без эмоций
    music Groove2_85
    img 15452
    with fade
    biff "Хорошая цыпочка. Папочка цыпочкой очень доволен."
    img 15453
    with diss
    melanie_t "Нужно пойти в фотостудию. Надеюсь, Алекс на месте."
    # в заданиях появляется "Провести фотосессию"
#    $ log1 = t_("Провести фотосессию")
    return

############ BiffCastings 1############


#    label gallery_8442_1:

label gallery_8442:
    $ store_music()
    music Loved_Up

    if chickMode == True:

        img 8441
        with Dissolve(0.5)
        m "Моника Бакфетт хочет показать папочке грудь..."
        img 8442
        with fade
        w
        img 8444
        with Dissolve(0.5)
        w
    else:

        img 8441
        with Dissolve(0.5)
        m "Я покажу тебе грудь, потому что ты заставил меня..."
        img 8442
        with fade
        w
        img 8443
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_8453:
    $ store_music()
    music Loved_Up
    if chickMode == True:
        sound snd_fabric1
        img 8460
        with fade
        m "Леди Нуар хочет показать папочке грудь..."
        img 8461
        biff "Давай, Леди Нуар! Показывай свои сиськи!"
        "Не прячь их от папочки!"
        img 8456
        with Dissolve(0.5)
        w
        img 8457
        with Dissolve(0.5)
        w
        img 8458
        with Dissolve(0.5)
        w
        img 8459
        with Dissolve(0.5)
        w

    else:

        sound snd_fabric1
        img 8453
        with fade
        m "Биф, мне обязательно это делать?"
        img 8454
        biff "Давай, Леди Нуар! Показывай свои сиськи!"
        "Не прячь их от папочки!"
        "А то я заставлю Леди Нуар показать еще кое-что!"
        img 8455
        with fade
        w
        img 8445
        biff "Я жду!"
        img 8455
        with fade
        w
        img 8456
        with Dissolve(0.5)
        w
        img 8457
        with Dissolve(0.5)
        w
        img 8458
        with Dissolve(0.5)
        w
        img 8459
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_8474:
    $ store_music()
    music Loved_Up
    if chickMode == True:
        img 8473
        with fade
        m "Девушка с календаря хочет показать папочке грудь..."
        sound snd_fabric1
        img 8477
        with Dissolve(0.5)
        w
        img 8478
        with Dissolve(0.5)
        w
        img 8479
        with Dissolve(0.5)
        w
    else:

        img 8469
        with fade
        m "Я знаю, я должна показать тебе грудь..."
        "Но можно я не буду делать этого?"
        img 8470
        biff "Давай! Девушка с календаря!"
        "Показывай свои сиськи!"
        "Иначе я скажу Алексу чтобы эти голые сиськи смотрели прямо с календаря!"
        img 8471
        with fade
        mt "Черт! У меня молоток... Может убить этого мерзавца?!"
        "Сколько мне терпеть это???"
        "..."
        "Нет... Слишком опасно..."
        img 8472
        biff "Ну же! Сиськи!"
        img 8471
        with fade
        w
        img 8474
        with Dissolve(0.5)
        w
        img 8475
        with Dissolve(0.5)
        m "На, смотри..."
        img 8476
        with Dissolve(0.5)
        w
        "Мне не нужны проблемы..."
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_9479:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 9477
        with fade
        sound snd_fabric1
        m "Роза надежды хочет показать папочке грудь..."
        img 9478
        with Dissolve(0.5)
        w
        img 9479
        with Dissolve(0.5)
        w
        img 9480
        with Dissolve(0.5)
        w
    else:
        img 9481
        with fade
        m "Я покажу тебе грудь, потому что ты заставил меня..."

        img 9482
        with Dissolve(0.5)
        w
        img 9483
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_20187:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 20184
        with fade
        sound snd_fabric1
        m "Алая Жемчужина хочет показать папочке грудь..."
        img 20185
        with Dissolve(0.5)
        w
        img 20186
        with Dissolve(0.5)
        w
        img 20187
        with Dissolve(0.5)
        w
    else:
        img 20184
        with fade
        m "Я покажу тебе грудь, потому что ты заставляешь меня это делать!.."
        img 20185
        with Dissolve(0.5)
        w
        img 20186
        with Dissolve(0.5)
        w
        img 20187
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_20205:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        $ store_music()
        music Loved_Up
        img 20202
        with fade
        m "Запретное Желание хочет показать папочке грудь..."
        img 20203
        with Dissolve(0.5)
        w
        img 20204
        with Dissolve(0.5)
        w
        img 20205
        with Dissolve(0.5)
        w
        img 20206
        with diss
        w
    else:
        img 20202
        with fade
        m "Я покажу тебе грудь, потому что ты заставляешь меня это делать!.."
        img 20203
        with Dissolve(0.5)
        w
        img 20204
        with Dissolve(0.5)
        w
        img 20205
        with Dissolve(0.5)
        w
        img 20206
        with diss
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_9444:
    $ store_music()
    music Loved_Up

    if chickMode == True:
        img 9443
        with Dissolve(0.5)
        m "Моника Бакфетт хочет показать папочке свой зад..."
        img 9444
        with fade
        w
        img 9445
        with fade
        w
        img 9446
        with Dissolve(0.5)
        w
    else:
        img 9443
        with Dissolve(0.5)
        m "Я покажу тебе зад, потому что ты заставил меня..."
        img 9444
        with fade
        w
        img 9445
        with fade
        w
        img 9446
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_9453:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        sound snd_fabric1
        img 9447
        with fade
        m "Леди Нуар хочет показать папочке свой зад..."
        img 9448
        biff "Давай, Леди Нуар! Показывай свои зад!"
        "Не прячь его от папочки!"
        img 9452
        with fade
        w
        img 9453
        with Dissolve(0.5)
        w
        img 9454
        with Dissolve(0.5)
        w
        img 9455
        with Dissolve(0.5)
        w
        img 9456
        with Dissolve(0.5)
        w
        img 9456
        with Dissolve(0.5)
        w
        img 9457
        with Dissolve(0.5)
        w
        img 9458
        with Dissolve(0.5)
        w
    else:
        sound snd_fabric1
        img 9449
        with fade
        m "Биф, мне обязательно это делать?"
        img 9450
        biff "Давай, Леди Нуар! Показывай свои зад!"
        "Не прячь его от папочки!"
        "А то я заставлю Леди Нуар показать свой зад на камеру!"
        img 9451
        with fade
        w
        biff "Я жду!"
        img 9452
        with fade

        img 9453
        with Dissolve(0.5)
        w
        img 9454
        with Dissolve(0.5)
        w
        img 9455
        with Dissolve(0.5)
        w
        img 9456
        with Dissolve(0.5)
        w
        img 9456
        with Dissolve(0.5)
        w
        img 9457
        with Dissolve(0.5)
        w
        img 9458
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return



label gallery_9465:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 9459
        with fade
        m "Девушка с календаря хочет показать папочке свою попу..."
        img 9460
        biff "Давай! Девушка с календаря!"
        "Показывай свой зад!"
        img 9464
        with fade
        w
        sound snd_fabric1
        img 9465
        with Dissolve(0.5)
        w
        m "На, смотри..."
        img 9466
        with Dissolve(0.5)
        w
        img 9467
        with Dissolve(0.5)
        w
        img 9468
        with Dissolve(0.5)
        w
        img 9469
        with Dissolve(0.5)
        w
    else:
        img 9461
        with fade
        m "Я знаю, я должна показать тебе свой зад..."
        "Но можно я не буду делать этого?"
        img 9462
        biff "Давай! Девушка с календаря!"
        "Показывай свой зад!"
        "Иначе я скажу Алексу чтобы этот голый зад смотрел на всех прямо с календаря!"
        img 9463
        biff "Ну же! Зад!"
        img 9464
        with fade
        w
        sound snd_fabric1
        img 9465
        with Dissolve(0.5)
        w
        m "На, смотри..."
        img 9466
        with Dissolve(0.5)
        w
        img 9467
        with Dissolve(0.5)
        w
        img 9468
        with Dissolve(0.5)
        w
        img 9469
        with Dissolve(0.5)
        "Мне не нужны проблемы..."
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_9492:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 9485
        with fade
        sound snd_fabric1
        m "Роза надежды хочет показать папочке свой зад..."
        img 9486
        biff "Давай, Роза!"
        "Показывай свой зад!"

        img 9487
        with Dissolve(0.5)
        w
        img 9488
        with Dissolve(0.5)
        w
        img 9489
        with Dissolve(0.5)
        w
        img 9490
        with Dissolve(0.5)
        w
        img 9491
        with Dissolve(0.5)
        w
        img 9492
        with Dissolve(0.5)
        w
    else:
        img 9484
        with fade
        m "Я покажу тебе свой зад, потому что ты заставляешь меня это делать!"
        img 9486
        biff "Давай, Роза!"
        "Показывай свой зад!"

        img 9487
        with Dissolve(0.5)
        w
        img 9488
        with Dissolve(0.5)
        w
        img 9489
        with Dissolve(0.5)
        w
        img 9490
        with Dissolve(0.5)
        w
        img 9491
        with Dissolve(0.5)
        w
        img 9492
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_9513:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 9506
        with fade
        sound snd_fabric1
        m "Стюардесса Fashion Airlines хочет показать папочке свой зад..."
        img 9507
        biff "Давай, Стюардесса!"
        "Показывай свой зад!"
        img 9508
        with fade

        img 9509
        with Dissolve(0.5)
        w
        img 9510
        with Dissolve(0.5)
        w
        img 9511
        with Dissolve(0.5)
        w
        img 9512
        with Dissolve(0.5)
        w
        img 9513
        with Dissolve(0.5)
        w
        img 9514
        with Dissolve(0.5)
        w
    else:
        img 9505
        with fade
        m "Я покажу тебе свой зад, потому что ты заставляешь меня это делать!"
        img 9507
        biff "Давай, Стюардесса!"
        "Показывай свой зад!"
        img 9508
        with fade

        img 9509
        with Dissolve(0.5)
        w
        img 9510
        with Dissolve(0.5)
        w
        img 9511
        with Dissolve(0.5)
        w
        img 9512
        with Dissolve(0.5)
        w
        img 9513
        with Dissolve(0.5)
        w
        img 9514
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return

label gallery_20191:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 20188 #9506
        with fade
        sound snd_fabric1
        m "Алая Жемчужина хочет показать папочке свой зад..."
#                        img 9507
        biff "Давай, Жемчужина!"
        "Показывай свой зад!"
        img 20189 #9508
        with fade
        m "Биф, можно Я не буду снимать костюм?"
        m "Это долго..."

        img 20190
        with fade
        biff "Хорошо, цыпочка."
        biff "У папочки нет времени на переодевания."

        img 20191
        biff "Пусть цыпочка сядет на стол."
        biff "Папочка хочет посмотреть на сидящую цыпочку."

        img 20192
        with diss
        m "Так, Биф?"
        img 20193
        biff "Да, цыпочка. Привыкай сидеть на жердочке."
        biff "Скоро ты займешь место рядом с малышкой Мелани!"

        img 20194
        mt "!!!"

    else:
        img 20188 #9506
        with fade
        sound snd_fabric1
        m "Я покажу тебе свой зад, потому что ты заставляешь меня это делать!"
#                        img 9507
        biff "Давай, Жемчужина!"
        "Показывай свой зад!"
        img 20189 #9508
        with fade
        m "Биф, можно Я не буду снимать костюм?"
        m "Это долго..."

        img 20190
        with fade
        biff "Хорошо, цыпочка."
        biff "У папочки нет времени на переодевания."

        img 20191
        biff "Пусть цыпочка сядет на стол."
        biff "Папочка хочет посмотреть на сидящую цыпочку."

        img 20192
        with diss
        m "Так, Биф?"
        img 20193
        biff "Да, цыпочка. Привыкай сидеть на жердочке."
        biff "Скоро ты займешь место рядом с малышкой Мелани!"

        img 20194
        mt "!!!"
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_20210:
    $ store_music()
    music Loved_Up
    if chickMode == True:

        img 20207
        with fade
        sound snd_fabric1
        m "Запретное Желание хочет показать папочке свой зад..."
        img 20208
        with diss
        biff "Давай, Запретное Желание!"
        "Показывай свой зад!"
        img 20209
        with fade
        w

        img 20210
        with Dissolve(0.5)
        w
        img 20211
        with Dissolve(0.5)
        w
        img 20212
        with Dissolve(0.5)
        w
    else:
        img 20207
        with fade
        m "Я покажу тебе свой зад, потому что ты заставляешь меня это делать!"
        img 20208
        biff "Давай, Запретное Желание!"
        "Показывай свой зад!"
        img 20209
        with fade
        w

        img 20210
        with Dissolve(0.5)
        w
        img 20211
        with Dissolve(0.5)
        w
        img 20212
        with Dissolve(0.5)
        w
    $ restore_music()
    img 8445
    biff "Хорошо, папочка доволен!"
    #если уже несколько раз
    biff "Но папочке начинает надоедать одно и то же..."
    return


label gallery_13920:
# Если Моника заходит сразу же, то происходит диалог с Бифом после сдачи отчетов. Если не приходит в этот вечер, то диалог пропадает.
# Диалог с Бифом после сдачи отчета:
# Биф спрашивает что цыпочка хорошая? Цыпочка принесла отчеты?
# Моника выбирает притвориться цыпочкой или нет
    music Groove2_85
    img 13902
    with fade
    biff "Цыпочка принесла отчеты?" #-
    biff "Цыпочка сегодня хорошая?"
# Если притворяется цыпочкой, то комментирует что ей надо притвориться цыпочкой - это поможет поднять доверие Бифа, она сможет иметь больший доступ в офисе и придумает
# как вернуть все назад
# Если не притворяться, то тоже думает, но говорит что это черезчур такому Боссу как она притворяться цыпочкой
# Говорит что цыпочка хорошая и что она сдала отчеты, как просил папочка
    img 13903
    with diss
    menu:
        "Притвориться хорошей цыпочкой.":
            img 12813
            with fade
            mt "Мне надо притвориться цыпочкой." #+
            mt "Это поможет поднять доверие Бифа и я смогу иметь больший доступ в офисе."
            mt "Это поможет мне вернуть все назад..."
            music Hidden_Agenda
            img 13904
            with diss
            m "Да, цыпочка хорошая..." #-
            m "Цыпочка собрала все отчеты..."
# Бифф говорит что цыпочка должна развлечь папочку. Кто сегодня цыпочка?
# Моника отвечает что сегодня цыпочка - это важный Босс и она пришла показать грудь или попу
# Биф отвечает что папочка доволен и что цыпочка может и дальше работать в их прекрасной компании
# Моника уходит и думает что в ее компании, сволочь!
# У Бифа идет прогресс
            img 13906
            biff "Хорошая цыпочка должна развлечь папочку." #-
            biff "Кто сегодня цыпочка?"
            img 12789
            with diss
            m "Сегодня цыпочка - это важный Босс." #-
            m "У цыпочки свой отдел. Цыпочка очень довольна."
            img 13905
            with diss
            biff "Что цыпочка-Босс решила показать сегодня папочке?" #+
            menu:
                "Показать грудь.": # corruption
                    img 12783
                    with fade
                    m "Сегодня цыпочка-Босс пришла показать папочке свою грудь..." #-
                    # Показывает грудь (нексолько кадров)
                    music Loved_Up
                    sound snd_fabric1
                    img 13917
                    with fadelong
                    w
                    img 13918
                    with diss
                    w
                    img 13919
                    with diss
                    w
                    img 13920
                    with diss
                    w
                    img 12844
                    with fade
                    biff "Папочка доволен." #+

                "Показать попу.": #corruption
                    label gallery_20599:
                    img 12783
                    with fade
                    m "Сегодня цыпочка-Босс пришла показать папочке свою попу..." #-
                    # Показывает Бифу попу (несколько кадров)
                    music Loved_Up
                    sound snd_fabric1
                    img 20595
                    with fadelong
                    w
                    img 20596
                    with diss
                    w
                    img 20597
                    with diss
                    w
                    img 20598
                    with diss
                    w
                    img 20599
                    with diss
                    w
                    img 20600
                    with diss
                    w
                    img 12844
                    with diss
                    biff "Папочка доволен." #+
                "Ничего.":
                    img 12789
                    with fade
                    m "Сегодня цыпочка пришла только показать папочке отчеты." #-
                    img 12875
                    with diss
                    biff "Ладно, цыпочка, у папочки все-равно сейчас нет времени." #+


        "Не притворяться." if monicaSaidBiffSheIsWillBeAGoodChick == False:
            img 13907
            with fade
            m "Биф, я собрала отчеты, потому что ты требуешь этого!" #-
            img 12907
            biff "Хорошо, цыпочка." #+
            biff "Продолжай вести себя хорошо."
        "Не притворяться. (Моника обещала быть хорошей цыпочкой) (disabled)" if monicaSaidBiffSheIsWillBeAGoodChick == True:
            pass
    img 12815
    with fade
    biff "Цыпочка может и дальше работать в моей прекрасной компании!" #-

    # Моника уходит
    music Power_Bots_Loop
    img 12817
    with diss
    mt "В моей компании, сволочь! В МОЕЙ!" #+
    return

############ PublicEvents 1############

label gallery_6700:
    #нажатие на Монику
    music Groove2_85
    img 6696
    with fade
    m "..."
    img 6700
    mt "Черт! Что же мне делать?!"
    "Здесь столько прессы..."
    "Может быть объявить что мой журнал захватили?!"
    "Попросить помощи?"
    "Это опасно! Не представляю чем это может грозить!"
    "Возможно самым худшим... Но это единственный шанс..."
    "Очень рискованный!"
    "Что же мне делать???"
    menu:
        "Сказать всем правду!":
            music Power_Bots_Loop
            img 6701
            with fade
            m "Я - Моника Бакфетт!"
            "И я хочу объявить о преступлении, которое совершено в отношении меня!"
            img 6702
            music stop
            pause(1.0)
            sound microphone_off
            empty_name "Выключается микрофон."
            $ renpy.pause(1.0, hard=True)
            music Power_Bots_Loop
            img 6703
            m "Меня незаконно обвинили в том, чего я не совершала!"
            "У меня отняли счета и документы!"
            "И теперь шантажируют, заставляя говорить немыслимые вещи!"
            "Помогите мне!!!"
            #затемнение. спустя несколько часов
            music stop
            img black_screen
            with Dissolve(2.0)
            call textonblack(t_("Несколько часов спустя...")) from _rcall_textonblack_32
            img black_screen
            with Dissolve(2.0)
            music Gearhead
            img 2530
            with fadelong
            marcus "Что-ж, Миссис Бакфетт!"
            "Хорошая попытка!"
            img 2533
            "Должен признать Вам что я проиграл."
            img 2542
            m "..."
            img 2533
            with fade
            marcus "Да, я проиграл лучший виски на моем ранчо!"
            img 2571
            "Вы продержались больше одного дня!"
            "И Вы вернулись сюда... Феерично!"
            img 2563
            with fade
            "Вы отправитесь на Ранчо прямо из этого кабинета..."
            img 2572
            sound snd_woman_scream2
            m "НЕЕЕЕЕТ!!!"
            music stop
            call textonblack(t_("Продолжение следует...")) from _rcall_textonblack_33
            img black_screen
            with Dissolve(1)
            return

        "Подыграть Бифу. Если я хочу все вернуть назад, то надо быть хитрее...":
            mt "Нет, это слишком рискованно!"
            "Дик говорил что все что со мной сделали - законно."
            "А это значит что я лишь наврежу себе!"
            "Мне надо сказать эти гребаные слова и заработать деньги на чертов галстук!"

            img 6704
            with fade
            m "..."
            m "Я - Моника Бакфетт!"
            "И я подтверждаю слова Мистера Бифа!"
            "Наш журнал изменит свой курс!"

            #ропот в зале
            sound audience_wow
            img 6705
            with fade
            m "..."
            biff "Ну, курица! Скажи что-нибудь еще!!!"

            img 6706
            with fade
            mt "!!!"

            img 6707
            with fade
            m "Старый курс морально устарел..."
            "Новые времена диктуют новые тренды..."
            img 6708
            "Я благодарна Мистеру Бифу за новые идеи..."
            "Наш журнал должен преобразиться..."
            sound applause1
            "Спасибо Вам за то что Вы пришли..."

            img 6709
            with fade
            biff "Молодец, цыпочка!"
            "Продолжай играть!"

            #появляется рецепшин и смотрит на Монику
            music Hidden_Agenda
            img 6710
            with fadelong
            reception_t "Не понимаю..."
            "Она выступает на сцене..."
            img 6711
            with fade
            sound applause2
            "Неужели она правда Леди?"
            "Но этого не может быть!"
            img 6712
            "Мое чутье никогда не обманывало меня!"

            hide screen Reporters_Shoots_Screen2
            hide screen Reporters_Shoots_Screen
            hide screen Reporters_Shoots_Screen3
            show screen Reporters_Shoots_Screen
#            show screen Reporters_Shoots_Screen3
            music audience
            #меняется фон, Моника внизу отвечает на вопросы журналистов
            img 6713
            with fadelong
            reporter1 "Миссис Бакфетт!"
            "Скажите! Почему Вы решили сменить курс?"
            reporter2 "Скажите! Вы готовы поддержать новый курс собственным примером?"
            reporter3 "Мы слышали что Вы только что провели фотосессию!"
            "Вы решили сняться обнаженной?"
            img 6714
            with fade
            m "Нет, что вы?"
            "Это всего-лишь курс журнала!"
            "Я не собираюсь сниматься обнаженной!"
            "Я - Леди!"
            "И у меня есть достоинство!"
            hide screen Reporters_Shoots_Screen
            show screen Reporters_Shoots_Screen2
            img 6715
            with fadelong
            reporter1 "Но мы слышали что это необычная фотосессия!"
            "Мы слышали что эта фотосессия достаточно смелая!"
            reporter3 "Расскажите про фотосессию, Миссис Бакфетт!"
            img 6716
            m "Ой! Что Вы? Это обычная фотосессия!"
            reporter2 "Мы слышали что вы принимали необычные позы!"
            img 6717
            m "Ничего особенного..."
            "Просто небольшой смелый эксперимент..."
            img 6718
            reporter1 "Собираетесь-ли Вы продолжать эксперименты?"
            reporter3 "Многие хотели-бы увидеть больше!"
            hide screen Reporters_Shoots_Screen
            hide screen Reporters_Shoots_Screen2
            hide screen Reporters_Shoots_Screen3
            music Power_Bots_Loop
            img 6719
            m "Нет..."
            "Это разовый случай..."
            "Скажите этим МНОГИМ что они могут не рассчитывать на большее!"
            "Интервью закончено!"
            reporter1 "Спасибо, Миссис Бакфетт!"
            return
        "Еще подумать...":
            return
    return

label gallery_6757:
    #render
    #Секретарша сидит за столом, общение с Моникой
    music Groove2_85
    img 8205
    with fade
    dick_secretary "Миссис Бакфетт!"
    "Как Вам эта сумочка?"
    img 8206
    with fade
    "Вам она нравится? Или нет?"


    img 8207
    with fade
    w
    # Воспоминания
    # Если Моника была с Филипом, то события Филипа
    music stop
    img white_screen
    with Dissolve(1.0)
    pause 1.0
    if monicaMadeBlowjobToPhilip == True:
        music Gearhead
        if monicaMadeBlowjobToHotelStaff == True:
            img 6996
            with Dissolve(0.7)
            philip "Давай! Засунь свой член туда!"
            img 7004
            philip "Миссис Бакфетт не может ждать!"
            "Она хочет скорее твой член!"
            img 7006
            philip "Решайся, Малыш!"
            "Иначе это сделает следующий кто войдет сюда!"

            img 7022
            with fade
            philip "Я кое-что забыл..."

            img 7030
            with fade
            philip "Теперь глотай!"

            img 7034
            philip "Покажи рот! Покажи что ты все проглотила!"
            img 7035
            w
            img 7043
            with fadelong
            w
        else:
            img 6936
            with Dissolve(0.7)
            philip "Спасибо, Моника Бакфетт!"
            img 6938
            philip "Вы заработали свои $ 500!"
            img 6943
            with fade
            m "Мне нужно еще $ 500!"
            "Пожалуйста! Прошу Вас!!!"
            img 6954
            with fade
            philip "Это не аргумент, Миссис Бакфетт!"
            "Что Вы можете предложить взамен?"
    else:
        # Если была с Бифом, то события про цыпочку
        music Hidden_Agenda
        img 6754
        with Dissolve(0.7)
        m "Биф, пожалуйста, дай деньги. Я буду хорошей цыпочкой..."
        img 6755
        m "Я буду исправно сниматься в фотосессиях и..."
        img 6757
        "Буду послушной..."

    #
    img white_screen
    with Dissolve(0.5)
    pause 1.0
    music Groove2_85
    img 8206
    with Dissolve(0.8)
    dick_secretary "Я Вас слушаю!"
    img 8208
    with fade
    m "Ддда... Мне нравится эта сумочка, Мисс Виктория..."
    "У Вас хороший вкус..."

    img 8209
    dick_secretary "Я подумываю в следующую пятницу купить еще что-нибудь, когда Вы принесете деньги."
    "У Вас тоже есть вкус, возможно я даже посоветуюсь с Вами."
    "Миссис Бакфетт, вы же дадите совет мне?"
    img 8208
    m "Да... Дам..."
    img 8210
    with fade
    m "..."
    m "Виктория..."
    dick_secretary "Мисс Виктория!!!"
    m "Мисс Виктория, скажите. Если у меня не будет наличных, то как мне доставить Вам эти деньги?"
    img 8211
    dick_secretary "Нет проблем, Миссис Бакфетт!"
    "Просто купите в интернете сертификат на это имя и адрес email..." #Дает бумажку
    img 8212
    with fade
    m "Я поняла, спасибо..."
    return
