
label gallery_12476:
    music Groove2_85
    img 12469
    with fade
    citizen15 "Время голых сисек! Давай, расчехляй!"
    music Power_Bots_Loop
    img 12470
    mt "Я вырву твой вонючий язык..."
    img 12471
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит и того, что ты уже видел!":
            img 12472
            with fade
            m "Хватит и того, что ты уже видел!"
            return
    music Groove2_85
    img 12473
    with fade
    m "Хорошо."
    m "Отвернись!"
    img 12474
    citizen15 "Конечно, детка!"
    # отворачивается, моника переодевается ситизен резко поворачивается и ее пугает
    sound snd_fabric1
    img 12475
    with fadelong
    w
    sound Jump1
    img 12476
    with hpunch
    w
    img 12477
    with diss
    w
    sound Jump2
    img 12478
    with diss
    citizen15 "Бу!!!"
    img 12479
    with diss
    m "Ой! Какого?"
    img 12480
    with diss
    citizen15 "Ха-ха-ха. Девочки всегда так смешно пугаются."
    citizen15 "И после такого они уже в моей власти!"
    img 12481
    with fade
    m "Что? О чем вообще ты?"
    img 12482
    citizen15 "Ну как же, разве ты не чувствуешь мое превосходство?"
    img 12483
    m "..."
    img 12484
    citizen15 "Разве не готова мне отдаться прямо здесь?"
    img 12485
    with fade
    m "Знаешь что... Я не покажу тебе свою грудь..."
    img 12486
    with diss
    citizen15 "Корчишь недотрогу? Такие девочки мне нравятся..."
    return

label gallery_13203:
    music Groove2_85
    img 13188
    with fade
    citizen1 "Тетя, нам скучно!"
    citizen1 "Как насчет еще одного танца на пилоне?"
    img 13189
    m "Вы уже видели меня танцующей там.."
    img 13190
    citizen1 "Эм...Ну да..."
    citizen1 "Короче потанцуй для нас без кофты."
    img 13191
    with fade
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с вас и того, что вы уже видели!":
            img 13192
            m "Хватит с вас и того, что вы уже видели!"
            return
    img 13193
    with fade
    mt "Я уже танцевала, мою прекрасную грудь они видели... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет... А мне нужны деньги..."
    img 13194
    m "Сколько вы заплатите?"
    img 13195
    citizen1 "Тетя, тариф стандартный!"
    citizen1 "Но если ты готова станцевать с бутылкой в заднице, это можно обсудить!"
    music Power_Bots_Loop
    img 13196
    m "Что?! Да как ты смеешь такое говорить?!"
    img 13197
    citizen1 "Ой, тетя! Не кипятись, я пошутил..."
    music Groove2_85
    img 13198
    with fade
    m "Только вздумайте еще раз так пошутить! Отвернитесь!"

    # отворачиваются
    img 13199
    with diss
    w
    sound snd_fabric1
    img 13200
    with diss
    citizen1 "Конечно, тетя, не вопрос."
    music Loved_Up
    img 13201
    with fade
    m "Можете поворачиваться..."
    # поворачиваются, моника стоит с голыми сиськами
    img 13202
    citizen1 "Да, они шикарны. Можешь начинать."
    # движение на пилоне
    music Molten_Alloy
    img 13203
    with diss
    w
    img 13204
    with diss
    w
    img 13205
    citizen1 "Отлично, тетя!"
    # движение на пилоне еще
    img 13206
    with diss
    w
    img 13207
    with diss
    citizen1 "Черт, как глупо было просить тебя крутиться в одежде!"
    # движение на пилоне еще
    img 13208
    with diss
    w
    img 13209
    with diss
    w
    img 13210
    with diss
    citizen1 "Вау, тетя! Тебе нужно этим зарабатывать! Хотя стоп, этим ты и занимаешься!"
    citizen1 "Ха-ха-ха!"
    music Groove2_85
    img 13211
    with fade
    mt "Грязные панки..."
    mt "Мерзавцы..."
    return

label gallery_13231:
    music Groove2_85
    img 13212
    with fade
    citizen1 "Тетя, мы снова хотим ощутить себя в стрип клубе!"
    citizen1 "Как насчет еще одного танца на пилоне?"
    img 13213
    m "В стрип клубе платят больше, да и вход туда бывает платный."
    img 13214
    citizen1 "Но мы ведь не в стрип клубе!"
    citizen1 "Станцуй для нас, и сиськи не забудь оголить."
    img 13215
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с вас и того, что вы уже видели!":
            img 13216
            m "Хватит с вас и того, что вы уже видели!"
            return
    img 13217
    with fade
    m "Сколько вы заплатите?"
    img 13218
    citizen1 "Снова ты за свое!"
    citizen1 "Можно подумать о том, как ты можешь заработать больше, но в другой раз."
    citizen1 "И вообще, ты нас утомляешь своей болтовней, раздевайся уже!"
    img 13219
    with diss
    menu:
        "Хорошо.":
            pass
        "Я передумала.":
            img 13220
            m "Нет, не будет вам танцев!"
            m "Вы и так уже видели достаточно!"
            return
    img 13221
    with fade
    m "Хорошо. Отвернитесь!"
    # отворачиваются
    img 13222
    citizen1 "Конечно, тетя, не вопрос."
    sound snd_fabric1
    music Loved_Up
    img 13223
    with fade
    w
    img 13224
    with fadelong
    m "Можете поворачиваться.."
    # поворачиваются, моника стоит с голыми сиськами
    img 13225
    citizen1 "Тетя, тебе особое приглашение нужно? Начинай уже!"
    # движение на пилоне
    music Molten_Alloy
    img 13226
    with diss
    w
    img 13227
    with diss
    citizen1 "Отлично, тетя!"
    # движение на пилоне еще
    img 13228
    with diss
    w
    img 13229
    with diss
    citizen1 "Черт, как глупо было просить тебя крутиться в одежде!"
    # движение на пилоне еще
    img 13230
    with diss
    w
    img 13231
    with diss
    citizen1 "И зачем мы ходим в стрип клуб?"
    # моника слезает  спилона, панк достает бутылку
    img 13234
    w
    img 13232
    with fade
    citizen1 "Тетя, ты помнишь про наше предложение насчет бутылки?"
    # моника злая
    music Power_Bots_Loop
    img 13233
    with fade
    m "Еще слово, и я засуну бутылку тебе в зад!"
    img 13235
    citizen1 "Ха-ха-ха! Два раза одна и та же шутка прошла!"
    music Groove2_85
    img 13236
    with fade
    mt "Грязные панки..."
    img 13237
    citizen1 "Ладно, молодец, тетя, нам понравилось!"
    return

label gallery_13247:
    music Groove2_85
    img 13238
    with fade
    citizen1 "Тетя, станцуй! И не забуть снять кофту!"
    img 13239
    with fade
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с вас и того, что вы уже видели!":
            img 13240
            m "Хватит с вас и того, что вы уже видели!"
            return
    img 13241
    with fade
    m "Хорошо. Отвернитесь!"
    # отворачиваются
    music Loved_Up
    img 13242
    with diss
    citizen1 "..."
    sound snd_fabric1
    img 13223
    with fade
    w
    img 13224
    with fadelong
    m "Можете поворачиваться.."
    # поворачиваются, моника стоит с голыми сиськами
    img 13225
    citizen1 "Начинай!"
    img 13243
    mt "Что-то они какие-то молчаливые... Это подозрительно..."
    # движение на пилоне
    music Molten_Alloy
    img 13244
    with diss
    w
    img 13245
    with diss
    citizen1 "Отлично!"
    # движение на пилоне еще
    img 13246
    with diss
    w
    img 13247
    with diss
    citizen1 "Не плохо!"
    img 13248
    with diss
    mt "Что это с ними сегодня? Они ведут себя не как обычно..."
    # движение на пилоне еще
    # когда моника крутится на пилоне спиной к панкам, один из них достает
    # телефон, и фоткает другого на фоне моники когда она не видит
    # звук фотографировния
    # моника слезает с шеста
    img 13249
    with diss
    w
    img 13250
    with diss
    call photoshop_flash() from _rcall_photoshop_flash_12
    w
    music Groove2_85
    img 13251
    with diss
    m "Что это был за звук?"
    img 13252
    mt "Как будто меня сфотографировали..."
    img 13253
    citizen1 "Какой звук, тетя? Мы ничего не слышали."
    img 13254
    m "Вы меня сфотографировали?"
    img 13255
    citizen1 "Нет, тетя! Да и откуда у нас фотоаппарат?"
    img 13256
    with fade
    mt "И правда, откуда... Хотя... Нет, у них нет фотоаппарата..."
    with diss
    img 13257
    citizen1 "Кстати, отличный танец!"
    return

label gallery_13271:
    music Groove2_85
    img 13258
    with fade
    citizen3 "Детка, разденься и покрутись ка на шесте!"
    citizen3 "Надо же его использовать по назначению."
    img 13259
    m "Не слишком ли многого ты хочешь!?"
    img 13260
    with diss
    citizen3 "Нет, детка, совсем не многого!"
    citizen3 "Знала бы ты мои фантазии... Я там..."
    # моника перебивает. не знаю, как это может выглядеть в диалогах, возможно никак
    music Power_Bots_Loop
    img 13261
    with vpunch
    m "Мне не интересно!"
    music Groove2_85
    img 13262
    with fade
    citizen3 "Ладно, тогда раздевайся и крутись!"
    img 13263
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13264
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13265
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13266
    m "Ладно. Только отвернись!"
    # отворачиваются
    img 13267
    citizen3 "Да, детка, как скажещь!"
    music Loved_Up
    img 13268
    with fade
    w
    # поворачиваются, моника стоит с голыми сиськами
    sound snd_fabric1
    img 13269
    with fadelong
    citizen3 "Танцуй уже!"
    # движение на пилоне
    music RocknRoll_loop
    img 13270
    with fadelong
    w
    img 13271
    with diss
    w
    img 13272
    with diss
    citizen3 "Да, детка, молодец!"
    # движение на пилоне еще
    img 13273
    with diss
    w
    img 13274
    with diss
    citizen3 "А какие у тебя ножки! Ух!"
    # движение на пилоне еще
    img 13275
    with diss
    citizen3 "Я бы заплатил 7, или нет, 9 долларов если ты дотронешься своей ножкой до моего дружка!"
    citizen3 "Ты же понимаешь о ком я?"
    img 13276
    with diss
    mt "Да заткнись ты уже... Я бы на такое не согласилась и за 7000 долларов..."
    mt "Хотя..."
    img 13277
    with diss
    citizen3 "Детка, почему ты молчишь? Сара за 7 баксов мне бы уже отсасывала!"
    # моника слезает с шеста
    music Groove2_85
    img 13278
    with fade
    m "Все! Плати!"
    img 13279
    citizen3 "Хорошо, детка, но ты так и не ответила на мой вопрос!"
    img 13280
    mt "Извращенец..."
    return

label gallery_13289:
    music Groove2_85
    img 13281
    with fade
    citizen3 "Детка, разденься и покрутись ка на шесте!"
    citizen3 "Мне нужно кое-что уточнить."
    img 13282
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13283
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13284
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13285
    citizen3 "Да, детка, как скажещь!"
    music Loved_Up
    sound snd_fabric1
    img 13268
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13286
    with fadelong
    citizen3 "Знаешь, я тут видел Сару и мне интересно, кто из Вас лучше танцует..."
    citizen3 "Так что не задерживай меня и начинай!"
    img 13287
    mt "Сравнивать меня с какой-то уличной шлюхой? Конечно я танцую лучше!"
    # движение на пилоне
    music RocknRoll_loop
    img 13288
    with diss
    w
    img 13289
    with diss
    citizen3 "Вау! Не плохо!"
    # движение на пилоне еще
    img 13290
    with diss
    w
    img 13291
    with diss
    citizen3 "Отлично! Но пока еще не уровень Сары!"
    img 13292
    with diss
    mt "Ах ты паразит! Я докажу тебе..."
    # движение на пилоне extra (моника доказывает, что она танцует лучше)
    music stop
    img black_screen
    with diss
    music Molten_Alloy
    pause 1.0
    img 13293
    with fadelong
    w
    img 13294
    with diss
    citizen3 "Ничего себе! А вот это что-то новое!"
    citizen3 "Да, думаю ты лучше!"
    img 13295
    with diss
    mt "В этом никто и не сомневался!"
    # моника слезает с шеста
    music Groove2_85
    img 13278
    with fade
    m "Все! Плати!"
    img 13279
    with diss
    citizen3 "Вот, заработала. Думаю, ты чуть лучше Сары"
    return

label gallery_13296:
    music Groove2_85
    img 13281
    with fade
    citizen3 "Детка, разденься и покрутись ка на шесте!"
    img 13282
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13283
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13284
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    music Loved_Up
    img 13285
    citizen3 "Да, детка, как скажещь!"
    sound snd_fabric1
    img 13268
    with fadelong
    # поворачиваются, моника стоит с голыми сиськами
    w
    img 13286
    citizen3 "Ну не стой, давай уже полезай на шест!"
    img 13287
    mt "Козел..."
    # движение на пилоне
    music RocknRoll_loop
    img 13296
    with diss
    w
    img 13297
    with diss
    citizen3 "Хорошо."
    # движение на пилоне еще
    img 13298
    with diss
    w
    img 13299
    with diss
    citizen3 "Давай детка, еще!"
    # движение на пилоне еще
    img 13301
    with diss
    w
    img 13300
    with diss
    citizen3 "Ах...Вот это ножки."
    citizen3 "Ты шикарна!"
    # моника слезает с шеста
    music Groove2_85
    img 13302
    with fade
    m "Все! Плати!"
    # ситизен показывает косяк
    img 13303
    citizen3 "Знаешь, детка, сейчас не самое удачное время... У меня не так много налички. Но у меня есть прекрасный товар. Хочешь?"
    img 13304
    with fade
    menu:
        "Мне нужны деньги!":
            pass
    music Power_Bots_Loop
    img 13306
    with vpunch
    m "Мне нужны деньги!"
    img 13305
    with fade
    citizen3 "Ты не знаешь от чего отказываешься, ну ладно, держи..."
    return

label gallery_13327:
    music Groove2_85
    img 13307
    with fade
    citizen5 "Мистер желает увидеть совмещение."
    img 13308
    m "Что? Я не понимаю."
    img 13309
    citizen5 "Необходимо совместить манящие груди и танцы на железной палке."
    img 13310
    m "Ты хочешь, чтобы я снанцевала?"
    img 13311
    citizen5 "Да! Но перед этим оголи свои манящие груди!"
    img 13312
    mt "Теперь понятно о чем ты..."
    img 13313
    with fade
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13314
            m "Хватит с тебя того, что ты уже видел!"
            img 13315
            citizen5 "Мистер разочарован!"
            return
    img 13316
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13317
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13318
    with diss
    m "???"
    sound snd_fabric1
    music Loved_Up
    img 13319
    with diss
    citizen5 "О, конечно!"
    # поворачиваются, моника стоит с голыми сиськами
    img 13320
    with fadelong
    citizen5 "Мистер рад, можно начинать!"
    # движение на пилоне
    music Molten_Alloy
    img 13321
    with fadelong
    w
    img 13322
    with diss
    w
    img 13323
    with diss
    citizen5 "Это очень хорошо! Ты очень молодец!"
    # движение на пилоне еще
    img 13324
    with diss
    w
    img 13325
    with diss
    w
    img 13326
    with diss
    citizen5 "Как ты замечательно двигаешься! Ты профессионал!"
    # движение на пилоне еще
    img 13328
    with diss
    w
    img 13327
    with diss
    citizen5 "Ооо...Ты получишь от мистера много денег!"
    # моника слезает с шеста
    music Groove2_85
    img 13329
    with fadelong
    m "Все! Плати! Мне нужны настоящие деньги!"
    img 13330
    mt "И не нужны твои тугрики..."
    img 13331
    with fade
    citizen5 "Настоящие? Это можно, вот возьми."
    return

label gallery_13334:
    music Groove2_85
    img 13307
    with fade
    citizen5 "Мистер желает увидеть совмещение."
    img 13312
    mt "Неужели снова придется раздется и станцевать?"
    img 13313
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13314
            m "Хватит с тебя того, что ты уже видел!"
            img 13315
            citizen5 "Мистер разочарован!"
            return
    img 13317
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13318
    w
    sound snd_fabric1
    img 13319
    with diss
    citizen5 "О, конечно!"
    # поворачиваются, моника стоит с голыми сиськами
    img 13320
    with fadelong
    citizen5 "У мистера сегодня хорошее настроение!"
    # движение на пилоне
    music Molten_Alloy
    img 13332
    with fadelong
    citizen5 "Крутись! Превосходно!"
    # движение на пилоне еще
    img 13333
    with diss
    w
    img 13334
    with diss
    w
    img 13335
    with diss
    w
    img 13336
    with diss
    citizen5 "Мистеру кажется, что он готов будет написать хайку!"
    # моника слезает с шеста
    music Groove2_85
    img 13337
    with fadelong
    citizen5 "Мистер придумал! Вот послушай!"
    img 13338
    with diss
    citizen5 "Стрекоза летала,"
    citizen5 "На сакуру села."
    citizen5 "Радость мистеру."
    img 13339
    with fade
    citizen5 "Или это не хайку... Мистер запутался от твоих безупречных форм!"
    img 13340
    mt "А у мистера похоже, что не все дома..."
    img 13341
    with diss
    citizen5 "Вот твои настоящие деньги."
    return

label gallery_13362:
    music Groove2_85
    img 13342
    with fade
    citizen5 "Как насчет танца на пилоне?"
    img 13343
    mt "Что? А где же обычный бред, который он все время несет?"
    mt "Он что, где то это услышал?"
    img 13344
    citizen5 "И не забудь оголить свои манящие груди."
    img 13345
    mt "А, нет, все нормально."
    mt "Он все тот же кретин..."
    img 13346
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13347
            m "Хватит с тебя того, что ты уже видел!"
            img 13348
            citizen5 "Мистер разочарован!"
            return
    img 13349
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13350
    citizen5 "О, конечно!"
    img 13351
    w
    sound snd_fabric1
    img 13352
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13353
    with fadelong
    citizen5 "Мистер думает, что ты не очень любишь это прекрасное занятие и хочет, чтобы ты чувствовала себя по-особенному!"
    img 13354
    mt "Он что-то задумал?"
    img 13355
    with diss
    citizen5 "Можно стартовать!"
    # движение на пилоне: моника танцует, а ситизен кидает доллары зимбабве
    # очень много на эту тему стереотипных фото аля Девушка танцует, мужчина сорит деньгами
    music Molten_Alloy
    img 13356
    with fadelong
    w
    img 13357
    with diss
    w
    img 13358
    with diss
    sound snd_take_paper
    citizen5 "Это тебе!"
    #  моника танцует
    sound snd_take_paper
    img 13359
    with diss
    w
    sound snd_take_paper
    img 13360
    with diss
    citizen5 "Получай!"
    #  моника танцует,
    sound snd_take_paper
    img 13361
    with diss
    w
    sound snd_take_paper
    img 13362
    with diss
    citizen5 "И вот еще!"
    #  моника танцует,
    img 13363
    with diss
    w
    img 13364
    with diss
    citizen5 "Все, у меня закончились деньги!"
    #  моника слезает с шеста
    music stop
    img black_screen
    with diss
    pause 1.0
    music Groove2_85
    img 13365
    with fadelong
    citizen5 "Тебе понравилось? Удалось ли мне создать атмосферу?"
    img 13366
    m "Какую еще атмосферу?"
    img 13367
    citizen5 "Атмосферу твоего рабочего места!"
    img 13369
    with diss
    mt "Знал бы ты что у меня за атмосфера на рабочем месте..."
    img 13368
    m "Нет.."
    img 13370
    with fade
    citizen5 "Ай-ай, мистер немного разочарован. Но ничего, думаю американские деньги также помогут ее созданию..."
    return

label gallery_13389:
    music Groove2_85
    img 13371
    with fade
    citizen4 "Я бы посмотрел на твои сиськи еще разок, но в танце. Что скажешь?"
    img 13372
    m "Не слишком ли многого ты хочешь?!"
    img 13373
    citizen4 "Девочка, ты забыла где ты? В этом районе каждая вторая готова таким образом заработать пару лишних долларов."
    citizen4 "Решайся быстрее, у меня нет времени. Ну дак что?"
    img 13374
    with fade
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13375
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13376
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13377
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13378
    citizen4 "Ладно, только в этот раз..."
    img 13379
    with diss
    w
    music Loved_Up
    sound snd_fabric1
    img 13380
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13381
    with fadelong
    citizen4 "Залезай уже на пилон и начинай!"
    music Groove2_85
    img 13382
    m "Почему Вы такой грубый?"
    img 13383
    citizen4 "Я нормальный, да и не твое это дело! Твое дело крутить жопой на пилоне! Начинай!"
    img 13384
    with fade
    menu:
        "Хорошо.":
            pass
        "Я передумала.":
            img 13386
            m "Знаете, я передумала!"
            return
    img 13385
    with fade
    m "Хорошо."
    mt "Мне нужны эти деньги... Черт..."
    # движение на пилоне
    music RocknRoll_loop
    img 13387
    with fadelong
    w
    img 13388
    with diss
    citizen4 "А знаешь, не плохо!"
    # движение на пилоне еще
    img 13389
    with diss
    w
    img 13390
    with diss
    w
    img 13391
    with diss
    citizen4 "Жопу бы тебе побольше!"
    # движение на пилоне еще
    img 13392
    with diss
    w
    img 13393
    with diss
    citizen4 "Да, очень не дурно."
    # движение на пилоне еще
    img 13394
    with diss
    w
    music Groove2_85
    img 13395
    with fadelong
    citizen4 "Знаешь, у тебя есть будущее, но надо больше практики и накачай жопу!"
    # моника слезает с шеста
    img 13396
    with fade
    citizen4 "Вот держи, заработала!"
    mt "!!!"
    return

label gallery_13405:
    music Groove2_85
    img 13400
    with fade
    citizen4 "Думаю, стоит закрепить начатое. Полезай на пилон. И блузку сними!"
    img 13397
    m "Зачем мне снимать блузку, если ты не хочешь смотреть на мою грудь?"
    img 13401
    citizen4 "Это не твое дело! Я говорю, ты делаешь."
    citizen4 "Ну дак что?"
    img 13398
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13402
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13399
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13403
    citizen4 "Все равно мне не интересны твои сиськи."
    sound snd_fabric1
    img 13404
    with diss
    mt "Как он может такое говорить? Моя прекрасная грудь много кого интересует!"
    # поворачиваются, моника стоит с голыми сиськами
    img 13381
    with fadelong
    citizen4 "Залезай уже на пилон и начинай!"
    img 13382
    m "Хорошо."
    mt "Мерзавец..."
    # движение на пилоне
    music RocknRoll_loop
    img 13405
    with fadelong
    w
    img 13406
    with diss
    citizen4 "Мне кажется, я начинаю любить твои сиськи!"
    # движение на пилоне еще
    img 13407
    with diss
    w
    img 13408
    with diss
    citizen4 "Да, вот так, двигайся!"
    # движение на пилоне еще
    img 13409
    with diss
    w
    img 13410
    with diss
    citizen4 "Знаешь, все равно что-то не то. Кое чего не хватает."
    # движение на пилоне еще
    # ситизен пытается схватить монику за жопу во время ее вращения, но не выходит.
    # на варианте 2 он схватит ее за зад. должна быть такая поза, когда ты держишься за пилон в позе сидя
    # моника на повороте ударяет его ногой
    img 13411
    with diss
    w
    img 13412
    with diss
    w
    sound Jump1
    img 13413
    with diss
    w
    sound snd_punch_face1
    img 13414
    with diss
    w
    sound snd_down1
    music Power_Bots_Loop
    img 13415
    with diss
    citizen4 "Черт! Ты меня ударила!"
    # моника слезает с шеста
    img 13416
    with fade
    m "Вообще то я не хотела, ты подошел слишком близко!"
    img 13417
    citizen4 "Ты мне сломала нос!"
    img 13418
    m "Не правда, у тебя даже крови нет. В следующий раз не подходи близко."
    mt "Иначе я сделаю это специально!"
    music Groove2_85
    img 13419
    with fade
    citizen4 "Ха-ха-ха! Девочка начинает входить во вкус?"
    citizen4 "Следующий раз..."
    img 13420
    m "Плати!"
    img 13421
    citizen4 "Да не вопрос!"
    img 13422
    with fade
    mt "Все это толко для того, чтобы заработать немного денег. Ведь так, Моника?"
    return

label gallery_13434:
    music Groove2_85
    img 13423
    with fade
    citizen4 "Думаю, стоит закрепить начатое. Полезай на пилон. И блузку сними!"
    img 13424
    m "Зачем мне снимать кофту, если ты не хочешь смотреть на мою грудь?"
    img 13425
    citizen4 "Это не твое дело! Я говорю, ты делаешь."
    citizen4 "Ну дак что?"
    img 13426
    with fade
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13427
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13399
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13403
    citizen4 "Все равно мне не интересны твои сиськи."
    sound snd_fabric1
    img 13404
    with diss
    mt "Как он может такое говорить? Моя прекрасная грудь много кого интересует!"
    # поворачиваются, моника стоит с голыми сиськами
    img 13381
    with fadelong
    citizen4 "Залезай уже на пилон и начинай!"
    img 13382
    m "Хорошо."
    mt "Мерзавец..."
    # движение на пилоне
    music RocknRoll_loop
    img 13428
    with fadelong
    w
    img 13429
    with diss
    citizen4 "Мне кажется, я начинаю любить твои сиськи!"
    # движение на пилоне еще
    img 13430
    with diss
    w
    img 13431
    with diss
    citizen4 "Да, вот так, двигайся!"
    # движение на пилоне еще
    img 13432
    with diss
    w
    img 13433
    with diss
    w
    img 13434
    with diss
    citizen4 "Знаешь, все равно что-то не то. Кое чего не хватает."
    # движение на пилоне еще
    # ситизен пытается схватить монику за жопу во время ее вращения. Выходит.
    img 13821
    with diss
    w
    sound Jump1
    img 13822
    with diss
    w
    sound Jump2
    img 13436
    with diss
    w
    img 13435
    with diss
    citizen4 "Вот чего не хватает! Моей руки на твоей сочной жопе!"
    music Power_Bots_Loop
    img 13437
    with hpunch
    m "Какого черта? Отпути меня!"
    img 13438
    with diss
    citizen4 "Не, мне нравится твой зад!"
    img 13439
    with fade
    mt "Черт, если я отпущу пилон, он может меня отпустить и я упаду... Что делать?"
    img 13440
    with diss
    menu:
        "Отпустить руки.":
            # моника отпускает руки и ситизен отпускает ее. моника падает
            label gallery_13449:
            music Groove2_85
            sound Jump1
            img 13446
            with diss
            w
            sound snd_down1
            img 13447
            with diss
            w
            img 13448
            with diss
            w
            sound snd_bodyfall
            img 13449
            with diss
            w
            img 13450
            with fade
            citizen4 "Ха-ха-ха! Глупая девочка!"
            pass
        "Угрожать.":
            music Power_Bots_Loop
            img 13441
            with diss
            m "Знаешь что! Если ты меня не отпустишь, у тебя будут проблемы!"
            music Groove2_85
            img 13442
            citizen4 "Девочка, ты не в тех условиях, чтобы угрожать!"
            citizen4 "Погоди минутку..."
            # лапает
            sound Jump2
            img 13443
            with diss
            citizen4 "О да, отличный зад!"
            # лапает
            img 13444
            with diss
            citizen4 "Эх, маловат, но вполне годный!"
            # отпускает
            pass
        "Терпеть.":
            img 13445
            with fade
            mt "Похоже, у меня нет выбора..."
            # лапает
            sound Jump2
            img 13443
            with diss
            citizen4 "О да, отличный зад!"
            # лапает
            img 13444
            with diss
            citizen4 "Эх, маловат, но вполне годный!"
            # отпускает
            pass
    music stop
    img black_screen
    with diss
    pause 1.5
    music Power_Bots_Loop
    img 13451
    with fadelong
    m "Я тебя убью!"
    img 13452
    with diss
    citizen4 "Началось... Вот твои два бакса, заработала."
    citizen4 "И вот еще один, за твой красивый зад!"
    # моника злая
    img 13453
    with fade
    mt "Когда нибудь ты за это ответишь, я обещаю!"
    return

label gallery_13475:
    music Groove2_85
    img 13454
    with fade
    citizen6 "Эй, как насчеет танцев?"
    img 13455
    m "Можно, но только если ты заплатишь."
    img 13456
    citizen6 "Да, я заплачу, а ты снимешь кофточку."
    img 13457
    with hpunch
    m "Что?!"
    img 13458
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13459
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13376
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13460
    with fade
    m "Сколько ты заплатишь?"
    img 13461
    citizen6 "Танцы-доллар, сиськи-по пол доллара каждая. Итого 2 доллара."
    img 13462
    with fade
    menu:
        "Хорошо.":
            pass
        "Ну уж нет!":
            img 13463
            m "Ну уж нет!"
            img 13464
            citizen6 "Ладно, тут можно и по дешевле найти!"
            return
    img 13465
    with fade
    mt "Сиськи по пол доллара каждая?! Да моя грудь стоит миллион!"
    img 13466
    with diss
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13467
    citizen6 "Хорошо, отвернусь!"
    sound snd_fabric1
    img 12023
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13468
    with fadelong
    citizen6 "Давай, не тормози, начинай!"
    music RocknRoll_loop
    # движение на пилоне
    img 13469
    with fadelong
    w
    img 13470
    with diss
    citizen6 "Хе-хе! Прекрасно!"
    # движение на пилоне еще
    img 13471
    with diss
    w
    img 13472
    with diss
    citizen6 "Давай еще! И, если мне понравится, то я, возможно, дам тебе еще доллар!"
    # движение на пилоне еще
    img 13473
    with diss
    w
    img 13474
    with diss
    w
    img 13475
    with diss
    citizen6 "Ну, не знаю, такое чувство, что ты халтуришь..."
    # моника слезает с шеста
    music Groove2_85
    img 13476
    with fadelong
    m "С тебя хватит!"
    img 13477
    citizen6 "Вот смотрю я на тебя и думаю, что нет в тебе искры, но свои 2 бакса ты заработала."
    citizen6 "Тренируйся! И получишь 2.5 доллара, а может и 3!"
    music Power_Bots_Loop
    img 13478
    with fade
    m "Когда я верну себе все то, чем я владела, я затолкаю эти 2 доллара тебе в рот!"
    return

label gallery_13482:
    music Groove2_85
    img 13479
    with fade
    citizen6 "Детка, потанцуй еще, мне нравится, как ты крутишься на пилоне."
    citizen6 "Особенно без блузки."
    img 13462
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 12021
            m "Хватит с тебя того, что ты уже видел!"
            img 13464
            citizen6 "Ладно, если ты не хочешь денег..."
            return
    img 13466
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13467
    citizen6 "Хорошо."
    sound snd_fabric1
    img 12023
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13468
    with fadelong
    citizen6 "Давай, не тормози, начинай!"
    # движение на пилоне
    music RocknRoll_loop
    img 13480
    with fadelong
    w
    img 13481
    with diss
    citizen6 "Хе-хе! Прекрасно!"
    # движение на пилоне еще
    img 13482
    with diss
    w
    img 13483
    with diss
    citizen6 "Давай еще! И, если мне понравится, то я, возможно, дам тебе еще доллар!"
    # движение на пилоне еще
    img 13485
    with diss
    w
    img 13484
    with diss
    citizen6 "Ну не знаю, такое чувство, что ты халтуришь..."
    # моника слезает с шеста
    music Groove2_85
    img 13486
    with fade
    m "С тебя хватит!"
    img 13487
    citizen6 "Вот смотрю я на тебя и думаю, что нет в тебе искры, но свои 2 бакса ты заработала."
    citizen6 "Тренируйся! И получишь 2.5 доллара, а может и 3!"
    music Power_Bots_Loop
    img 13478
    with fade
    m "Когда я верну себе все то, чем я владела, я затолкаю эти 2 доллара тебе в рот!"
    return

label gallery_13494:
    music Groove2_85
    img 13488
    with fade
    citizen6 "Детка, потанцуй еще, я устал от стрип клуба, там плохое освещение..."
    citizen6 "И сними блузку. Без нее тебе лучше."
    img 13462
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 12021
            m "Хватит с тебя того, что ты уже видел!"
            img 13464
            citizen6 "Ладно, если ты не хочешь денег..."
            return
    img 13466
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13467
    citizen6 "Ладно."
    sound snd_fabric1
    img 12023
    with diss
    # поворачиваются, моника стоит с голыми сиськами
    w
    img 13468
    with fadelong
    citizen6 "Ну давай уже! Мне долго ждатть?"
    # движение на пилоне
    music Molten_Alloy
    img 13489
    with fadelong
    w
    img 13490
    with diss
    citizen6 "Вот, другое дело!"
    # движение на пилоне еще
    img 13491
    with diss
    w
    img 13492
    with diss
    citizen6 "Давай еще! И, если мне понравится, то я, возможно, дам тебе еще доллар!"
    # движение на пилоне еще
    img 13494
    with diss
    w
    img 13493
    with diss
    citizen6 "А сегодня ты получше! Тренировалась?"
    # моника слезает с шеста
    music Groove2_85
    img 13486
    with fadelong
    m "С тебя хватит!"
    img 13495
    with diss
    citizen6 "Я тут придумал, как ты можешь заработать еще доллар."
    citizen6 "Я был в стрип клубе и там некоторые из твоих коллег наклоняются перед лицами посетителей, а между сисек у них бутылка..."
    citizen6 "Дак вот, они наклоняются, а из бутылки льется пиво прямо в рот!"
    img 13496
    with diss
    citizen6 "Я тут прикупил пивка..."
    citizen6 "Ну дак что? Сделаешь это? Я дам тебе доллар!"
    citizen6 "Ради такого я даже присяду, ведь тут нет сцены..."
    citizen6 "Ну дак что, хочешь доллар?"
    img 13497
    with fade
    menu:
        "Я хочу больше!":
            img 13501
            with fade
            m "Я хочу больше!"
            img 13502
            citizen6 "Серьезно? Я и так плачу тебе доллар! На это можно купить целый кебаб!"
            citizen6 "Сколько же ты хочешь?"
            img 13503
            mt "Черт, мне нужны деньги и я уже решила, что могу пойти на такое... Как бы сделать так, чтобы он согласился заплатить как можно больше."
            img 13504
            with fade
            m "Я хочу 50 долларов! Один человек мне заплатил столько только за то, что я показала ему грудь."
            img 13505
            citizen6 "Ха-ха-ха! Я даже знаю его! Его тут все знают! Он помешан на новых сиськах! Думаю, в другой раз он столько не заплатит."
            citizen6 "Хорошо. В стрип клубе я за это плачу 10 долларов, но девочке из этого идет не все. Я дам тебе не 1 доллар, а 3!"
            img 13506
            with fade
            m "Ладно."
            mt "Мне нужны с него хоть какие-то деньги... Черт..."
            img 13507
            mt "Козел..."
            # сцена.
            music Loved_Up
            img 13630
            with fadelong
            citizen6 "Вот кстати мое любимое пивко."
            # дает бутылку, продолжение сцены
            img 13659
            with fadelong
            sound hlup21
            w
            img 13660
            with diss
            w
            img 13661
            with diss
            citizen6 "О да, детка!"
            citizen6 "Дааа!"
            citizen6 "Даже лучше стрип клуба! Нет этих лампочек..."
            # звук питья ...
            sound snd_piss
            img 13656
            with diss
            w
            img 13657
            with diss
            w
            img 13658
            sound snd_drinking_water
            w
            music Groove2_85
            img 13662
            with fadelong
            citizen6 "Ух! Зашибись! Вот твои деньги! Я доволен!"
            pass
        "Это слишком!":
            img 13498
            with fade
            m "Думаю, тебе стоит вернуться в стрип клуб. Я не готова на такое."
            img 13499
            citizen6 "Ладно, приду, когда ты будешь работать."
            img 13507
            with diss
            mt "Козел, я не сприптизерша."
            pass
    img 13500
    with fade
    citizen6 "Да, кстати, вот 2 доллара за танец."
    return

label gallery_13494_13657:

    music Groove2_85
    img 13495
    with fadelong
    citizen6 "Я тут придумал, как ты можешь заработать еще доллар."
    citizen6 "Я был в стрип клубе и там некоторые из твоих коллег наклоняются перед лицами посетителей, а между сисек у них бутылка..."
    citizen6 "Дак вот, они наклоняются, а из бутылки льется пиво прямо в рот!"
    img 13496
    with diss
    citizen6 "Я тут прикупил пивка..."
    citizen6 "Ну дак что? Сделаешь это? Я дам тебе доллар!"
    citizen6 "Ради такого я даже присяду, ведь тут нет сцены..."
    citizen6 "Ну дак что, хочешь доллар?"
    img 13497
    with fade



    img 13501
    with fade
    m "Я хочу больше!"
    img 13502
    citizen6 "Серьезно? Я и так плачу тебе доллар! На это можно купить целый кебаб!"
    citizen6 "Сколько же ты хочешь?"
    img 13503
    mt "Черт, мне нужны деньги и я уже решила, что могу пойти на такое... Как бы сделать так, чтобы он согласился заплатить как можно больше."
    img 13504
    with fade
    m "Я хочу 50 долларов! Один человек мне заплатил столько только за то, что я показала ему грудь."
    img 13505
    citizen6 "Ха-ха-ха! Я даже знаю его! Его тут все знают! Он помешан на новых сиськах! Думаю, в другой раз он столько не заплатит."
    citizen6 "Хорошо. В стрип клубе я за это плачу 10 долларов, но девочке из этого идет не все. Я дам тебе не 1 доллар, а 3!"
    img 13506
    with fade
    m "Ладно."
    mt "Мне нужны с него хоть какие-то деньги... Черт..."
    img 13507
    mt "Козел..."
    # сцена.
    music Loved_Up
    img 13630
    with fadelong
    citizen6 "Вот кстати мое любимое пивко."
    # дает бутылку, продолжение сцены
    img 13659
    with fadelong
    sound hlup21
    w
    img 13660
    with diss
    w
    img 13661
    with diss
    citizen6 "О да, детка!"
    citizen6 "Дааа!"
    citizen6 "Даже лучше стрип клуба! Нет этих лампочек..."
    # звук питья ...
    sound snd_piss
    img 13656
    with diss
    w
    img 13657
    with diss
    w
    img 13658
    sound snd_drinking_water
    w
    music Groove2_85
    img 13662
    with fadelong
    citizen6 "Ух! Зашибись! Вот твои деньги! Я доволен!"
    pass

    img 13500
    with fade
    citizen6 "Да, кстати, вот 2 доллара за танец."
    return

label gallery_13520:
    music Groove2_85
    img 13508
    with fade
    citizen7 "Я недавно представлял твою прекрасную грудь."
    citizen7 "Хочу тебя заверить, когда я на нее смотрю, у меня поднимается... Вдохновение."
    img 13509
    mt "Извращенец."
    img 13510
    citizen7 "Но также вдохновению способствует вон та железная палочка сзади тебя."
    citizen7 "Хочу увидеть твою голую грудь и танец!"
    citizen7 "Я заплачу, но только если это добавит вдохновения!"
    img 13511
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13512
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13376
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13513
    m "Откуда я узнаю, что это даст тебе вдохновение?"
    img 13514
    citizen7 "Ооо! Сразу видно, ты ничего в этом не понимаешь! Я его почувствую..."
    citizen7 "Вдохновение... Оно идет снизу. Возможно, когда-нибудь, я тебе покажу."
    img 13515
    mt "Кажется, я поняла о чем он..."
    mt "Очередной извращенец..."
    music Loved_Up
    img 13516
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13517
    citizen7 "Что за издевательства над бедным уличным художником?"
    sound snd_fabric1
    img 12093
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13518
    with fadelong
    citizen7 "Я готов!"
    # движение на пилоне
    music RocknRoll_loop
    img 13519
    with fadelong
    w
    img 13520
    with diss
    citizen7 "Славно! Очень не плохо!"
    # движение на пилоне еще
    img 13522
    with diss
    w
    img 13521
    with diss
    citizen7 "Это намного лучше простых танцев!"
    # движение на пилоне еще
    img 13523
    with diss
    w
    img 13524
    with diss
    citizen7 "Представляю, насколько большое вдохновение я бы получил, если бы ты была голая..."
    # моника слезает с шеста
    music Groove2_85
    img 13525
    with fadelong
    m "Все, достаточно!"
    img 13526
    citizen7 "Не достаточно! У тебя нет сострадания и ты не разбираешься в искусстве!"
    # дает деньги
    img 13527
    with fade
    citizen7 "Хорошо! Вот! Я получил не так много вдохновения!"
    return

label gallery_13531:
    music Groove2_85
    img 13528
    with fade
    citizen7 "С прошлой нашей встречи, я ощущаю недостаток вдохновения!"
    citizen7 "Я просто обязан увидеть твою грудь. И обязательно в танце!"
    img 13529
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13530
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13516
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13517
    citizen7 "Что за издевательства над бедным уличным художником?"
    sound snd_fabric1
    img 12093
    with fade
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13518
    with fadelong
    citizen7 "Искусство не прощает задержек! Начинай!"
    # движение на пилоне
    music RocknRoll_loop
    img 13531
    with fadelong
    w
    img 13532
    with diss
    citizen7 "Это восхитительно!"
    # движение на пилоне еще
    img 13533
    with diss
    w
    img 13534
    with diss
    citizen7 "Какая красота!"
    # движение на пилоне еще
    img 13535
    with diss
    w
    img 13536
    with diss
    citizen7 "Да ты просто богиня!"
    # моника слезает с шеста
    music Groove2_85
    img 13537
    with fadelong
    m "Все, достаточно!"
    img 13538
    citizen7 "Богиня, но почему? Мы же только начали... Меня начало наполнять вдохновение!"
    # дает деньги
    img 13539
    m "Хватит, я и так слишком долго танцевала."
    mt "Не могу поверить что я это делала..."
    img 13540
    citizen7 "Здесь я решаю, что долго, а что нет!"
    citizen7 "Придется искать вдохновение где-то еще."
    citizen7 "И за это я дам только доллар!"
    img 13541
    m "Почему так мало?"
    img 13542
    citizen7 "Ты не поймешь!"
    img 13543
    with fade
    mt "Какой-то неадекватный псих... Ну и пошел он к черту..."
#    mt "Какой-то он не адекватный... Думаю, лучше его не провоцировать."
    return

label gallery_13551:
    music Groove2_85
    img 13528
    with fade
    citizen7 "Недостаток вдохновения! Его необходимо восполнить! Иначе я не смогу создавать свои шедевры!"
    citizen7 "Я просто обязан увидеть твою грудь. И обязательно в танце!"
    img 13529
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13530
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13516
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13517
    citizen7 "Что за издевательства над бедным уличным художником?"
    sound snd_fabric1
    img 12093
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13518
    with fadelong
    citizen7 "Искусство не прощает задержек! Начинай!"
    # движение на пилоне
    music RocknRoll_loop
    img 13544
    with fadelong
    w
    img 13545
    with diss
    citizen7 "Да! Я чувствую прилив вдохновения!"
    # движение на пилоне еще
    img 13547
    with diss
    w
    img 13546
    with diss
    citizen7 "Изумительно!"
    # движение на пилоне еще
    img 13548
    with diss
    w
    img 13549
    with diss
    citizen7 "О да! Когда-нибудь я тебя нарисую!"
    # моника слезает с шеста
    music Groove2_85
    img 13550
    with fadelong
    m "Все, достаточно!"
    img 13551
    citizen7 "Нет не достаточно! Не достаточно! Нужно еще!"
    img 13552
    m "Хватит, я и так слишком долго танцевала."
    img 13553
    citizen7 "Не достаточно долго! Что же делать?!"
    citizen7 "Ага, придумал! Да, это то, что нужно!"
    citizen7 "Наклонись!"
    img 13554
    m "Что?"
    img 13555
    citizen7 "Да, да! Наклонись! Иначе я останусь без вдохновения!"
    #художник подходит и птыается наклонить монику, слегка получается
    img 13556
    with diss
    w
    sound highheels_short_walk
    img 13557
    with diss
    w
    sound Jump1
    img 13558
    with diss
    w
    music Power_Bots_Loop
    img 13559
    with hpunch
    mt "Какого черта происходит? Он выглядит не очень адекватно... Что же делать?"
    img 13560
    with diss
    menu:
        "Потерпеть.":
            label gallery_13565:
            music Groove2_85
            img 13561
            with diss
            mt "Думаю, лучше потерпеть, а то мало ли что."
            # художник ставит монику в позу...
            img 13562
            with diss
            citizen7 "Вот! Уже готовая скульптура!"
            img 13563
            mt "Да что он несет?"
            img 13564
            with diss
            citizen7 "Чуточку формалина и..."
            img 13565
            mt "Так, о чем это он... Формалин? Черт! Думаю, не стоит с ним часто видеться..."
            # моника стоит пару сек
            img 13566
            with fade
            citizen7 "Да, вот теперь хорошо! Вот твои деньги."
            pass
        "Не выдержать.":
            music Power_Bots_Loop
            img 13567
            with hpunch
            m "Какого черта ты делаешь?! Не трогай меня!"
            img 13568
            m "Убери свои грязные руки! И плати! А то обещаю, у тебя еще долго не будет вдохновения!"
            img 13569
            with fade
            citizen7 "ОЙ-ой! Ладно, ладно, хорошо! Вот, возьми!"
            pass
    return

label gallery_13584:
    music Groove2_85
    img 13570
    with fade
    citizen8 "Добавим разнообразия: оголяй сиськи, иди на пилон. Все просто."
    citizen8 "Ты делаешь, я плачу."
    citizen8 "Сколько плачу-зависит от тебя."
    img 13571
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13572
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13316
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже не будет..."
    img 13573
    m "Откуда я знаю, что ты не обманешь?"
    img 13574
    citizen8 "Я тебя обманывал?"
    img 13575
    with diss
    m "Нет."
    img 13576
    citizen8 "Вот именно. И вообще, я не предлагаю сделку, если не могу ее выполнить."
    img 13577
    m "Хорошо. Только отвернись!"
    img 13578
    citizen8 "Зачем? Мы уже это проходили: я не отвернусь, иначе сделки не будет."
    citizen8 "Переодевайся."
    img 13579
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13572
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13580
    with fade
    mt "Он уже видел как я переодеваюсь..."
    music Loved_Up
    img 13581
    m "Хорошо."
    # переодевается
    img 12223
    with diss
    w
    sound snd_fabric1
    img 12224
    with diss
    w
    img 13582
    with fadelong
    citizen8 "Вот так, умница!"
    citizen8 "Я вижу, ты готова, начинай!"
    # движение на пилоне
    music Molten_Alloy
    img 13583
    with fadelong
    w
    img 13584
    with diss
    citizen8 "А ты подготовилась. Не дурно."
    # движение на пилоне еще
    img 13585
    with diss
    w
    img 13586
    with diss
    citizen8 "Скажи честно, ты тренировалась?"
    # движение на пилоне еще
    img 13587
    with diss
    w
    img 13588
    with diss
    citizen8 "Хотя постой, ты двигаешься как обычно. Я бы назвал это эффектом сисек."
    # моника слезает с шеста
    music Groove2_85
    img 13589
    with fadelong
    m "Все, достаточно!"
    img 13590
    citizen8 "Как скажешь. Да, эффект сисек работает! Даже если бы ты двигалась неумело, я бы все равно заплатил за твои голые сиськи."
    # дает деньги
    img 13591
    with fade
    citizen8 "Сделка состоялась."
    return

label gallery_13601:
    music Groove2_85
    img 13592
    with fade
    citizen8 "Новая сделка: снимай кофту и на пилон."
    img 13579
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13572
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13581
    with fade
    m "Хорошо."
    img 13593
    citizen8 "Чего же ты ждешь? Переодевайся."
    img 13594
    m "..."
    #  переодевается
    music Loved_Up
    sound snd_fabric1
    img 13595
    with diss
    w
    img 13596
    with fadelong
    citizen8 "Я смотрю, это вызывает у тебя все меньше стеснения."
    img 13597
    m "Это не правда"
    img 13598
    citizen8 "Да? А я так не думаю. Ты даже не просишь меня отвернуться."
    img 13599
    with fade
    mt "Да, не прошу... Неужели он прав насчет моего стеснения?!"
    mt "До чего ты докатилась, Моника?"
    # разделась
    img 13600
    with diss
    citizen8 "Улыбнись! У тебя отличные сиськи."
    citizen8 "А теперь на пилон!"
    # движение на пилоне
    music Molten_Alloy
    img 13601
    with fadelong
    w
    img 13602
    with diss
    citizen8 "Ты и сама знаешь, что у тебя прогресс..."
    # движение на пилоне еще
    img 13603
    with diss
    w
    img 13604
    with diss
    citizen8 "Так что я не буду ничего говорить..."
    # движение на пилоне еще
    img 13606
    with diss
    w
    img 13605
    with diss
    citizen8 "Но ты молодец."
    # моника слезает с шеста
    music Groove2_85
    img 13589
    with fadelong
    m "Все, достаточно!"
    img 13607
    citizen8 "Хорошо."
    # дает деньги
    img 13591
    with fade
    citizen8 "Сделка состоялась."
    return

label gallery_13612:
    music Groove2_85
    img 13570
    with fade
    citizen8 "Давай продолжим наши упражнения на пилоне."
    img 13579
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13572
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13593
    with fade
    citizen8 "Раздевайся."
    # раздевается и стоит с гол сиськами
    music Loved_Up
    sound snd_fabric1
    img 13595
    with diss
    w
    img 13596
    with diss
    w
    img 13608
    with diss
    w
    img 13609
    with fade
    citizen8 "Меня не покидает ощущение, что что-то тут не то."
    citizen8 "Ты танцуешь на пилоне и мы как будто в стрип клубе, но это не так."
    img 13610
    with diss
    citizen8 "Представим что мы в стрип клубе..."
    img 13611
    with diss
    m "?"
    music stop
    img black_screen
    with diss
    pause 1.0
    music Loved_Up
    img 13612
    with fadelong
    citizen8 "Привет! Я хочу приватный танец. Сколько он стоит?"
    img 13613
    m "..."
    img 13614
    with diss
    menu:
        "Эм... 100 долларов.":
            pass
        "Я не собираюсь играть в твои дурацкие игры!":
            music Power_Bots_loop
            img 13615
            with fade
            m "Я не собираюсь играть в твои дурацкие игры!"
            return
    #  переодевается
    img 13616
    with diss
    m "100 долларов."
    img 13617
    citizen8 "А у вас дорогой стрип клуб!"
    citizen8 "Слишком дорого! Пусть будет обычный танец. Можешь начинать."
    m "!!!"
    # движение на пилоне
    label gallery_13626:
    music Molten_Alloy
    img 13618
    with fadelong
    w
    img 13619
    with diss
    citizen8 "А теперь поинтересуйся, нравится ли мне все, что я вижу."
    img 13620
    with diss
    menu:
        "Поинтересоваться.":
            img 13621
            with diss
            m "Мистер, Вам нравится?"
            img 13622
            with diss
            citizen8 "Да, детка, более чем!"
            pass
        "Иди к черту!":
            music Groove2_85
            img 13623
            with diss
            m "..."
            img 13624
            with diss
            citizen8 "Что же ты молчишь?"
            music Molten_Alloy
            pass
    # движение на пилоне еще
    img 13625
    with diss
    w
    img 13626
    with diss
    citizen8 "Да, ты горяча!"
    # движение на пилоне еще
    img 13628
    with diss
    w
    img 13627
    with diss
    citizen8 "Прекрасно!"
    # моника слезает с шеста
    music Groove2_85
    img 13589
    with fadelong
    m "Все, достаточно!"
    img 13607
    citizen8 "Хорошо. Точнее не очень хорошо. Почему я должен говорить, что ты должна говорить?"
    citizen8 "Хотя ладно, это вопрос времени..."
    img 13629
    with fade
    mt "То, что я тебе что-то говорю, еще ничего не значит..."
    # дает деньги
    img 13591
    with diss
    citizen8 "Сделка состоялась."
    return

label gallery_13645:
    music Groove2_85
    img 13631
    with fade
    citizen9 "Йо, дамочка! Давай посмотрим на твои сисечки!"
    img 13632
    mt "Как же ты меня бесишь, если бы мне не были так нужны деньги, то я..."
    img 13633
    citizen9 "И ты же уже знаешь, зачем нужен пилон..."
    citizen9 "Лезь на него!"
    img 13634
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            music Power_Bots_Loop
            img 13635
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13316
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13636
    m "Знаешь что, я тебе не верю. Деньги сразу!"
    img 13637
    citizen9 "Вот это ты придумала!"
    citizen9 "А если мне не понравится?"
    img 13638
    mt "Ах ты сволочь..."
    img 13639
    m "Тебе же нравилось все, что ты видел до этого..."
    img 13640
    citizen9 "Ладно, дамочка, держи! А теперь раздевайся!"
    img 13641
    m "Отвернись!"
    # отворачивается
    img 13642
    citizen9 "Так и быть!"
    sound snd_fabric1
    img 12251
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13643
    with fadelong
    w
    img 13644
    with diss
    citizen9 "Йо! Ну неужели сама не догадываешься, что пилон уже тебя заждался?!"
    # движение на пилоне
    music RocknRoll_loop
    img 13645
    with fadelong
    w
    img 13646
    with diss
    citizen9 "О да!"
    # движение на пилоне еще
    img 13648
    with diss
    w
    img 13647
    with diss
    citizen9 "Порадуй старину Найджела!"
    # движение на пилоне еще
    img 13649
    with diss
    w
    img 13650
    with diss
    citizen9 "Горяча!"
    # моника слезает с шеста
    music Groove2_85
    img 13651
    with fadelong
    m "Все, достаточно!"
    img 13652
    citizen9 "И правда хватит. Пора засунуть мой член меджу твоих сисек!"
    citizen9 "Я же уже заплатил..."
    music Power_Bots_Loop
    img 13653
    with hpunch
    m "?!"
    music Groove2_85
    img 13654
    with fade
    citizen9 "Шутка! Дамочка, в тебе ни капли чувства юмора."
    img 13655
    mt "Зато твое чувство юмора ужасно... Мерзавец!"
    return

label gallery_13675:
    music Groove2_85
    img 13663
    with fade
    citizen9 "Йо, я соскучился по твоим танцам на пилоне!"
    citizen9 "Станцуй!"
    img 13634
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            music Power_Bots_Loop
            img 13635
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13664
    with fade
    m "Знаешь что, почему ты так плохо со мной обращаешься?"
    img 13665
    citizen9 "Не, дамочка, с тобой я еще хорошо обращаюсь!"
    citizen9 "Здесь недалеко есть пара шлюх, вот с ними я..."
    img 13666
    m "Мне неинтересно!"
    img 13667
    citizen9 "Ну и ладно! Тогда пулей на пилон! И разденься!"
    img 13668
    m "А ты отвернись!"
    # отворачивается. достает тел и по тихому снимает как моника переодевается
    sound Jump1
    img 13669
    with diss
    citizen9 "О да! Это видео непременно пойдет в мою коллекцию..."
    img 13670
    call photoshop_flash() from _rcall_photoshop_flash_13
    w
    sound snd_fabric1
    img 13671
    with fadelong
    # поворачивается моника стоит с сиськами
    w
    img 13672
    citizen9 "Класс! Я доволен!"
    img 13673
    with diss
    mt "Интересно чем..."
    img 13674
    citizen9 "Танцуй же уже!"
    # движение на пилоне
    music RocknRoll_loop
    img 13675
    with fadelong
    w
    img 13676
    with diss
    citizen9 "Да, дамочка, это твое призвание!"
    # движение на пилоне
    img 13677
    with diss
    w
    img 13678
    with diss
    citizen9 "Да ты просто бомба!"
    # моника слезает с шеста
    music Groove2_85
    img 13651
    with fadelong
    m "Все, достаточно!"
    img 13652
    citizen9 "Я бы так не сказал, но в любом случае, дома у меня будет еще неколько часов важных дел..."
    citizen9 "Я буду смотреть порно!"
    img 13653
    with diss
    m "Я и без тебя это поняла..."
    img 13654
    citizen9 "А ты догадливая ... Иногда..."
    citizen9 "Но все равно, надеюсь, к следующему разу ты разучишь больше движений."
    return

label gallery_13681:
    music Groove2_85
    img 13663
    with fade
    citizen9 "Расчехляй близняжек и на шест!"
    img 13634
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13635
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13637
    with fade
    citizen9 "Я даже сам отвернусь..."
    img 13638
    mt "Что это с ним?"
#    w
#    img 1225
    # поворачивается, моника с сиськами
    sound snd_fabric1
    img 13643
    with fadelong
    citizen9 "Залезай пожалуйста на шест."
    img 13673
    mt "А где же Йо? Что с ним сегодня?"
    # движение на пилоне
    music RocknRoll_loop
    img 13680
    with fadelong
    w
    img 13679
    with diss
    citizen9 "Очень красиво!"
    # движение на пилоне
    img 13681
    with diss
    w
    img 13682
    with diss
    citizen9 "Очень, очень красиво!"
    # моника слезает с шеста
    music Groove2_85
    img 13683
    with fadelong
    m "Что с тобой сегодня?"
    img 13684
    citizen9 "Со мной все в порядке, просто я прочитал в гороскопе, что в течение дня мне лучше быть вежливым и, возможно, я добьюсь чего-то большего."
    img 13685
    mt "Возможно, но явно не со мной."
    img 13686
    with fade
    citizen9 "Вот, возьми пожалуйста твои деньги."
    # моника берет дкньги
    img 13687
    with fadelong
    citizen9 "И все?"
    img 13688
    with diss
    m "А чего ты хотел?"
    img 13689
    citizen9 "Ну я же был вежлив..."
    img 13690
    with diss
    m "Ну тебе же ясно в гороскопе сказали 'возможно добьетесь'. Со мной ничего не удалось."
    img 13691
    citizen9 "Йо, дамочка! Все гороскопы отстой, я знал это!"
    return

label gallery_13711:
    music Groove2_85
    img 13692
    with fade
    citizen13 "Подруга, я часто вспоминаю тебя. Точнее твою красивую грудь и твои движения на пилоне."
    citizen13 "Может быть покажешь мне эти две вещи одновременно?"
    img 13316
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    img 13693
    with diss
    m "Что я получу за это?"
    img 13694
    citizen13 "Вот ты какая... Я думал, что ты сделаешь это ради нашей дружбы..."
    img 13695
    m "Нет, мне нужны деньги."
    img 13696
    with diss
    mt "Какой еще дружбы? Я вообще тебя не знаю..."
    mt "У такой леди как Я не может быть друзей в этих грязных трущобах!"
    mt "Это все какое-то недоразумение... Временное..."
    img 13697
    citizen13 "Хорошо, подруга, я дам тебе немного денег."
    img 13698
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13699
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13700
    with fade
    m "Хорошо. Только отвернись!"
    img 13701
    citizen13 "А ты смешная! Зачем? Я же уже видел твою грудь."
    img 13702
    m "Я не привыкла переодеваться, когда на меня смотрит мужчина."
    img 13703
    citizen13 "Но я ведь не мужчина, а твой друг, а ты моя подруга."
    img 13704
    m "Это не важно, отвернись!"
    img 13705
    citizen13 "Скучная ты, ну ладно."
    sound snd_fabric1
    img 12334
    with diss
    w
    # отворачивается
    # поворачиваются, моника стоит с голыми сиськами
    img 13706
    with fadelong
    citizen13 "Привет, близняшки! Готовы потанцевать?"
    img 13707
    with diss
    mt "Господи, лучше бы ты молчал..."
    # движение на пилоне
    music RocknRoll_loop
    img 13708
    with fadelong
    w
    img 13709
    with diss
    citizen13 "Подруга, я же уже говорил, что у тебя талант?"
    # движение на пилоне еще
    img 13710
    with diss
    w
    img 13711
    with diss
    citizen13 "Вот это пластика!"
    # движение на пилоне еще
    img 13712
    with diss
    w
    img 13713
    with diss
    citizen13 "Ты же научишь меня также? По дружбе..."
    # моника слезает с шеста
    music Groove2_85
    img 13714
    with fadelong
    citizen13 "Дак что, научишь?"
    img 13422
    mt "Да ни за что на свете."
    img 13715
    with diss
    m "Нет!"
    img 13716
    with fade
    citizen13 "Жаль, но, возможно скоро ты изменишь свое мнение. Мы бы классно провели время."
    citizen13 "Чуть не забыл... Вот твои деньги."
    return

label gallery_13724:
    music Groove2_85
    img 13717
    with fade
    citizen13 "Потанцуй еще! И грудь оголи, пожалуйста!"
    citizen13 "Мы же подруги!"
    img 13698
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13699
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13700
    with fade
    m "Хорошо. Только отвернись!"
    img 13701
    citizen13 "Ну, подруга, это уже не смешно..."
    img 13702
    m "Отвернись, иначе ничего не будет."
    img 13703
    citizen13 "Ладно, подруга, как скажешь."
    sound snd_fabric1
    img 12334
    with diss
    w
    # отворачивается
    # поворачиваются, моника стоит с голыми сиськами
    img 13718
    with fadelong
    citizen13 "Начинаем!"
    # движение на пилоне
    music RocknRoll_loop
    img 13719
    with fadelong
    w
    img 13720
    with diss
    citizen13 "Отлично!"
    # движение на пилоне еще
    img 13721
    with diss
    w
    img 13722
    with diss
    citizen13 "Подруга, ты прекрасна!"
    # моника крутится на пилони и у нее растегивается и падает туфля. ситизен поднимает
    img 13723
    with diss
    w
    sound Jump1
    img 13724
    with diss
    w
    sound Jump2
    img 13725
    with diss
    w
    img 13726
    with diss
    citizen13 "Ух ты! Что тут у нас?"
    # моника слезает с шеста
    label gallery_13745:
    music Groove2_85
    img 13727
    with fadelong
    m "Отдай мою туфлю!"
    img 13728
    citizen13 "Подруга, как не вежливо! Это Луи Витон? Очень похоже..."
    img 13729
    mt "Господи, откуда ты это услышал проживая в этой дыре..."
    img 13730
    with diss
    m "Нет."
    img 13731
    citizen13 "Очень похоже..."
    img 13732
    m "Наверное, а теперь отдай мне туфлю."
    img 13733
    citizen13 "Погоди, подруга. Мне кажется, только я думаю о нашей дружбе и тебе на нее наплевать."
    img 13734
    mt "У нас нет никакой дружбы и мне на тебя плевать..."
    img 13735
    citizen13 "Знаешь что... Обними меня, как свою лучшую подругу и я отдам тебе туфлю, но если ты откажешься, я выкину ее в помойку."
    img 13729
    with fade
    mt "Было бы очень не приятно потерять туфлю... В одной я далеко не уйду... Что делать?"
    img 13736
    with diss
    menu:
        "Хорошо.":
            mt "Возможно, стоит сделать вид что я обнимаюсь с ним."
            mt "Мне нужна моя туфля назад. Я не смогу его догнать в одной туфле..."
            img 13737
            with fade
            m "Хорошо, давай обнимемся."
            img 13738
            citizen13 "Ура! Я знал, что ты не откажешь!"
            # моника обнимает ситизена, а он ее ситизен лапает монику за зад
            music Loved_Up
            img 13744
            with fadelong
            w
            sound Jump2
            img 13745
            with diss
            w
            img 13746
            with hpunch
            mt "Какого черта? Он лапает мой зад?!"
            img 13743
            with fade
            citizen13 "Вот это я понимаю дружба! Вот, возьми свою туфлю."
            pass
        "Подруги так не поступают!":
            music Power_Bots_Loop
            img 13739
            with fade
            m "Подруги так не поступают!"
            img 13740
            citizen13 "Хм... Да, возможно ты права."
            img 13741
            m "Дружба должна быть на доверии, а после такого я не уверена, что могу тебе доверять."
            m "А теперь, если мы и правда подруги, отдай мне туфлю!"
            music Groove2_85
            img 13742
            with fade
            citizen13 "Конечно мы подруги! Вот, возьми."
            pass
    img 13823
    with diss
    citizen13 "Кстати, чуть не забыл: вот твои деньги."
    return

label gallery_13759:
    music Groove2_85
    img 13747
    with fade
    citizen13 "Потанцуй еще! И грудь оголи пожалуйста!"
    citizen13 "Мы же подруги!"
    img 13748
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            img 13749
            m "Хватит с тебя того, что ты уже видел!"
            return
    img 13750
    with fade
    m "Хорошо. Только отвернись!"
    img 13751
    citizen13 "Ну, подруга, ну хватит уже..."
    img 13702
    m "Отвернись, иначе ничего не будет."
    img 13703
    citizen13 "Какая же ты скучная..."
    sound snd_fabric1
    img 12334
    with diss
    w
    # отворачивается
    # поворачиваются, моника стоит с голыми сиськами
    img 13752
    with fadelong
    citizen13 "Твоя грудь стала больше? Или мне показалось?"
    citizen13 "Ладно, не важно, танцуй!"
    # движение на пилоне
    music RocknRoll_loop
    img 13753
    with fadelong
    w
    img 13754
    with diss
    citizen13 "Йуху! Какие обороты!"
    # движение на пилоне еще
    img 13755
    with diss
    w
    img 13756
    with diss
    citizen13 "Ты  даже так умеешь?!"
    # моника крутится на пилони
    img 13757
    with diss
    w
    img 13758
    with diss
    citizen13 "Круто! Ой, что это?!"
    # ситизен снимает штаны. у него очень маленький член и он стоит.
    # моника слезает с шеста
    sound Jump1
    img 13759
    with diss
    w
    sound Jump2
    img 13760
    with vpunch
    w
    music Groove2_85
    img 13761
    with fade
    w
    img 13762
    with diss
    m "Какого хрена ты делаешь?"
    img 13763
    with diss
    citizen13 "Подруга, это чудо! Видимо ты понравилась моему дружочку! Это так неожиданно!"
    img 13764
    with fade
    m "Оденься!"
    img 13765
    mt "Его член просто крохотный, Фи!"
    img 13766
    with fade
    citizen13 "Обязательно расскажу об этом всем!"
    # ситизен одевает штаны.
    img 13767
    with diss
    citizen13 "Кстати, подруга, вот тебе лишнй доллар! Уверен, ты рада!"
    return

label gallery_13783:
    music Groove2_85
    img 13768
    with fade
    citizen15 "Бэйба! Я удивлен, что ты еще не крутишься голая на этом пилоне!"
    img 13769
    m "Разве я должна?"
    img 13770
    citizen15 "Конечно! Все девочки так делают при виде меня!"
    img 13771
    m "Я не из таких."
    img 13772
    citizen15 "Ты что, лезбиянка?"
    img 13773
    m "Нет!"
    citizen15 "Отлично! Значит так: показывай свои сисечки и пулей на пилон!"
    citizen15 "Я за это плачу!"
    img 13774
    with diss
    menu:
        "Мне нужны деньги...":
            pass
        "Хватит с тебя того, что ты уже видел!":
            music Power_Bots_Loop
            img 13775
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            img 13776
            citizen15 "Я знаю, ты передумаешь!"
            return
    img 13777
    with fade
    mt "Я уже танцевала, мою прекрасную грудь он видел... Не так страшно, если все это будет вместе."
    mt "Хуже уже не будет..."
    img 13778
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13779
    citizen15 "Ну ты как обычно, ладно!"
    sound snd_fabric1
    img 12444
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13780
    with fadelong
    citizen15 "Давай, залазь!"
    img 13781
    with diss
    mt "Когда-нибудь моему терпению придет конец..."
    # движение на пилоне
    music Molten_Alloy
    img 13782
    with fadelong
    w
    img 13783
    with diss
    citizen15 "Давай, бейби, покажи на что ты способна!"
    # движение на пилоне еще
    img 13784
    with diss
    w
    img 13785
    with diss
    citizen15 "Вот так вот! Уверен, ты уже мокрая!"
    img 13786
    with diss
    mt "И не надейся..."
    # моника слезает с шеста
    music Groove2_85
    img 13787
    with fadelong
    citizen15 "И это все? Не густо..."
    citizen15 "Ааа... Я тебя понял! Ты меня дразнишь... Хорошо..."
    img 13655
    mt "И не надейся, ничтожество."
    img 13788
    with diss
    citizen15 "Ладно, держи, заработала."
    return

label gallery_13792:
    music Groove2_85
    img 13789
    with fade
    citizen15 "Ну что, ты готова меня развлекать?"
    citizen15 "Зачем я спрашиваю? Я же знаю, что да!"
    citizen15 "Раздевайся и на пилон!"
    img 13790
    m "Нет."
    img 13774
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            music Power_Bots_Loop
            img 13775
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            img 13776
            citizen15 "Я знаю, ты передумаешь!"
            return
    img 13778
    with fade
    m "Хорошо. Только отвернись!"
    citizen15 "Что с тобой не так? Все девочки хотят, чтобы я на них смотрел!"
    # отворачиваются
    img 13779
    citizen15 "Ладно, сыграем снова в твою игру!"
    sound snd_fabric1
    img 12444
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13780
    with fadelong
    citizen15 "Начинай уже!"
    img 13781
    with diss
    mt "Когда-нибудь моему терпению придет конец..."
    # движение на пилоне
    music Molten_Alloy
    img 13792
    with fadelong
    w
    img 13791
    with diss
    citizen15 "О да! Девочка вошла во вкус!"
    # движение на пилоне еще
    img 13793
    with diss
    w
    img 13794
    with diss
    citizen15 "Йо! Вот это ты раскрутилась!"
    citizen15 "Уверен, ты не против также покрутиться на моем толстом члене!"
    img 13786
    with diss
    mt "Скорее, я не против его оторвать..."
    # моника слезает с шеста
    music Groove2_85
    img 13787
    with fadelong
    citizen15 "И это все? Не густо..."
    citizen15 "Ааа... Ты продолжаешь меня дразнить... Хорошо..."
    img 13655
    mt "И не надейся, ничтожество."
    img 13788
    citizen15 "Вот твои деньги, девочка. И я тут подумал: если ты попросишь, чтобы я тебя трахнул, скорее всего, я соглашусь, но я не уверен."
    # кадр как ситизен держится за член, который пока в штанах и моника видит какой он большой
    # короче у этого негра огромный хер. Моника это видит и охеревает
    sound Jump1
    img 13795
    with diss
    w
    img 13796
    with diss
    mt "Черт! У него там что, бейсбольная бита?"
    img 13797
    with fade
    citizen15 "Что, нравится мой инструмент? Я знаю, он всем нравится!"
    return

label gallery_13807:
    music Groove2_85
    img 13768
    with fade
    citizen15 "Давай повторим наши танцы! И не забудь про сиськи!"
    citizen15 "И не вздумая отказываться, я ведь знаю, что ты от меня без ума."
    img 13798
    with diss
    menu:
        "Хорошо.":
            pass
        "Хватит с тебя того, что ты уже видел!":
            music Power_Bots_Loop
            img 13775
            with fade
            m "Хватит с тебя того, что ты уже видел!"
            img 13776
            citizen15 "Я знаю, ты передумаешь!"
            return
    img 13778
    with fade
    m "Хорошо. Только отвернись!"
    # отворачиваются
    img 13779
    citizen15 "Ладно, сыграем снова в твою игру!"
    sound snd_fabric1
    img 12444
    with diss
    w
    # поворачиваются, моника стоит с голыми сиськами
    img 13799
    with fadelong
    citizen15 "Крутись уже! И не разочаруй меня!"
    img 13781
    with diss
    mt "Когда-нибудь моему терпению придет конец..."
    # движение на пилоне
    music Molten_Alloy
    img 13801
    with fadelong
    w
    img 13800
    with diss
    citizen15 "Йо, детка, а ты сегодня в ударе!"
    # движение на пилоне еще. в это время к пилону подходит ситизен14
    img 13802
    with diss
    w
    music Groove2_85
    img 13803
    with fade
    citizen14 "Ик! Эй друг, я смотрю ты тут развлекаешься!"
    citizen14 "Кстати, ты знаешь, я нравлюсь этой девочке! Хрюк..."
    citizen14 "Пожалуй, постою с тобой!"
    img 13804
    with diss
    citizen15 "Йо! Это моя бейба, друг!"
    # моника слезает с шеста
    music Power_Bots_Loop
    img 13805
    with hpunch
    m "Какого хрена здесь еще кто-то?"
    music Loved_Up
    img 13806
    with diss
    citizen15 "Бейб, не злись, это мой друг, а у друзей не может быть секретов!"
    img 13807
    citizen14 "Хрюк!"
    music Groove2_85
    img 13808
    m "Или ты сейчас же просишь своего друга свалить отсюда или я..."
    img 13809
    with fade
    citizen15 "Ого! Какая же ты горячая когда злишься!"
    citizen15 "Я слышал, что иногда надо делать вещи, о которых просят девочки."
    citizen15 "После этого они будут лучше сосать! Я уверен скоро ты меня об этом попросишь..."
    img 13810
    with diss
    menu:
        "Перестать терпеть это.":
            # моника злая
            music Power_Bots_Loop
            img 13811
            with fade
            m "Ах ты сволочь! А ну проваливай отсюда иначе тебе не поздоровится!"
            img 13812
            with diss
            citizen15 "Йо, девочка! Ты уверена? Если я уйду, ты не ничего не получишь и все закончится тем, что ты снова ко мне придешь."
            img 13813
            m "Мне плевать! Ты меня достал!"
            img 13814
            with fade
            citizen15 "Ха-ха-ха! Ладно, как скажешь"
            # ситизен15 уходит, событие у пилона полностью заканчивается. моника не получает денег
            return
        "Молча слушать.":
            pass
    img 13815
    with diss
    citizen15 "Йо, друг! Думаю тебе лучше уйти, это моя девочка!"
    citizen15 "Скоро я подгоню тебе какую нибудь дешевую шлюшку, не волнуйся."
    img 13816
    with diss
    citizen14 "Ик! А ты знаешь мои слабости. Ладно, уговорил."
    # ситизен14 уходит
    img 13817
    with diss
    w
    img 13818
    with fade
    citizen15 "Ну что, не хочешь ли ты попросить меня кое о чем?"
    img 13819
    m "Да. Где мои деньги?"
    img 13820
    with fade
    citizen15 "Я не совсем это имел ввиду, ну да ладно, в другой раз. Надо нагулять апетит."
    citizen15 "Вот твои деньги, бейба."
    return

label gallery_13921:
# Моника подходит к секретарше и просит флешку для отчетов.
# Спрашивает у нее и как часто ей надо их сдавать?
# Секретарша отвечает что не знает.
# Может быть раз в неделю будет достаточно?
# Но, если честно, она не знает, так как Мистер Биф очень непредсказуем.
    music Groove2_85
    img 12944
    with fade
    m "Дорогуша..."
    img 12945
    secretary "Да, Миссис Бакфетт?"
    img 13911
    with diss
    m "Дорогуша, мне нужна флешка для отчетов."
    sound desk_open
    img 13921
    with fadelong
    w
    img 13922
    with diss
    secretary "Да, Миссис Бакфетт, пожалуйста." # дает флешку
    sound click1
    img 13912
    with fade
    m "И как часто мне надо сдавать эти дурацкие отчеты?"
    img 12945
    with diss
    secretary "Я не знаю, Миссис Бакфетт."
    secretary "Может быть, раз в неделю будет достаточно?"
    secretary "Но, если честно, я не знаю."
    img 12941
    secretary "Мистер Биф очень непредсказуем."
    secretary "Все зависит от того, сколько бутылок виски он сегодня выпил..."

# Моника говорит что он просто сволочь
# Секретарша отвечает что Мистер Биф лучше нас знает что делать
# Моника ...
    img 13913
    with diss
    m "Он просто сволочь, вот и все!"
    # с каменным лицом в сторону (как зомби)
    img 13915
    with diss
    secretary "Мистер Биф знает что для нас лучше..."
    secretary "Мистер Биф заботится о нас..."
    img 13916
    with diss
    m "..." # Смотрит как на ненормальную
    return



############ Steve 1############

label gallery_9944:

    music stop
    img black_screen
    with Dissolve(0.5)
    sound highheels_short_walk
    pause 1.0
    sound snd_door_open1
    music Groove2_85

    img 9932
    with fadelong
#    sound bottle1
    w
    img 9933
    with fade
#    sound bottle1
    m "Вот, Мистер Робертс... Пожалуйста..."
    img 9934
    with fade
    w
    img 9935
    with diss
    sound Jump1
    w
    if monicaBettyPanties == False:
        if monicaUnder != "Nude":
    #подглядывание с 9935
    #governess
            img 9978
        else:
            #nude
            img 9984
    else:
        if monicaBettyPantiesId == 1:
            #betty
            img 9979
        if monicaBettyPantiesId == 2:
            img 9980
        if monicaBettyPantiesId == 3:
            img 9981
        if monicaBettyPantiesId == 4:
            img 9982
        if monicaBettyPantiesId == 5:
            img 9983
    with diss
    sound Jump2
    w
    m "Миссис Робертс приготовила для Вас эту закуску..."
    sound highheels_short_walk
    img 9936
    with fade
    w
    img 9937
    with diss
    steve "..."
    img 9938
    w
    sound Jump1
    img 9939
    with fade
    w
    #звук падающей вилки
    sound snd_forkfall
    img 9940
    with diss
    w

# Стив говорит: Ой, гувернантка, ты не могла бы поднять прибор, я нечаянно уронил его.
# Моника наклоняется, чтобы подобрать.
# Стив наклоняется и видит что у Моники нет трусиков.
# Стив удивляется и пытается схватить ее рукой. Моника отскакивает и ненавидяще смотрит на Стива.
    img 9942
    steve "Ой, гувернантка!"
    steve "Ты не могла бы поднять прибор? Я нечаянно уронил его..."
    music Pyro_Flow
    img 9941
    with diss
    w
    img 9943
    with fade
    w
    img 9944
    with diss
    m "!!!"
    steve "..."
    img 9945
    with fade
    w
    img 9946
    with fade
    w
    img 9947
    with fade
    w
    img 9948
    with Dissolve(0.5)
    w
    img 9949
    with Dissolve(0.5)
    sound Jump1
    w

    #подглядывание
    if monicaBettyPanties == False:
        if monicaUnder != "Nude":
            #governess
            img 9985
        else:
            #nude
            img 9992
            with diss
            w
            img 9991
            with diss
            w
            img 9993
            with diss
            w
            img 9994
    else:
        if monicaBettyPantiesId == 1:
            #betty
            img 9986
        if monicaBettyPantiesId == 2:
            img 9987
        if monicaBettyPantiesId == 3:
            img 9988
        if monicaBettyPantiesId == 4:
            img 9989
        if monicaBettyPantiesId == 5:
            img 9990

    with diss
    w
    sound Jump2
    img 9950
    with diss
    w
    music stop
    img 9951
    m "!!!"
    menu:
        "Отдать вилку Стиву...":
            music Pyro_Flow
            img 9964
            with fade
            m "Пожалуйста, Мистер Стив."
            img 9962
            with diss
            "Вот Ваша вилка..."
        "Взять вилку в руку! (Bitchiness!)" if monicaBitch == True:
            #звук Моника разворачивается с вилкой
            music Villainous_Treachery
            img 9952
            with fadelong
            w
            img 9953
            with diss
            w
            img 9954
            with diss
            w
            img 9955
            ralph "А? Что за шум?"
            img 9956
            with diss
            w
            img 9957
            with diss
            w
            img 9958
            with fade
            w
            music Hidden_Agenda
            img 9959
            with fadelong
            m "Мистер Робертс, все в порядке!"
            img 9960
            with diss
            m "Просто упал столовый прибор."
            img 9961
            with fade
            m "Пожалуйста, Мистер Стив."
            "Вот Ваша вилка..."
            img 9963
            with diss
            w
            img 9962
            with Dissolve(0.5)
            w
            music Pyro_Flow
            img 9964
            with fade
            w
        "Взять вилку в руку! (Моника слишком приличная) (disabled)" if monicaBitch == False:
            pass
    sound highheels_short_walk
    img 9965
    with fade
    w

    music stop
    sound snd_door_open1
    img black_screen
    with Dissolve(0.5)
    pause 1.5
    sound snd_door_close1

    music BossaBossa
    img 9966
    with fadelong
    steve "Какая у тебя горячая гувернантка, Ральф!"
    steve "Давай скорее еще выпьем!"
    ralph "Давай, Стив!"
    return

label gallery_10094:
# Выбор: отказаться, либо череда выборов с торговлей
# В итоге сходятся на $ 5.000
    img 10092
    with diss
    menu:
        "$ 8.000 за весь объект аренды!":
            img 10093
            with diss
            m "$ 8.000 за весь объект аренды!"
            steve "$ 2.000 за половину!"
            img 10094
            with diss
            menu:
                "Тогда за целый объект $ 7.000!":
                    img 10093
                    with diss
                    m "Тогда за целый объект $ 7.000!"
                    steve "За целый объект $ 4.000"
                    jump gallery_10094
                "$ 6.000 за половину! За целый $ 10.000!":
                    img 10093
                    with diss
                    m "$ 6.000 за половину! За целый $ 10.000!"
                    steve "$ 3.500 за целый! $ 1.500 за половину!"
                    jump gallery_10094
        "$ 7.000 за половину, за целый $ 10.000!":
            img 10094
            with diss
            m "$ 7.000 за половину, за целый $ 10.000!"
            steve "$ 2.000 за половину!"
            menu:
                "За половину $ 4.000, за целый $ 7.000...":
                    img 10093
                    with diss
                    m "За половину $ 4.000, за целый $ 7.000..."
                    steve "$ 2.200 за половину!"
                    jump gallery_10094
                "$ 3.000 за половину, за целый $ 6.000!":
                    img 10093
                    with diss
                    m "$ 3.000 за половину, за целый $ 6.000!"
                    steve "$ 5.000 за целый!"
                    img 10095
                    with diss
                    menu:
                        "Я согласна...":
                            pass
                        "$ 5.500 за целый!":
                            img 10093
                            with diss
                            m "$ 5.500 за целый!"
                            steve "За целый $4.000!"
                            jump gallery_10094
# Черт с тобой, Стив!
# (по крайней мере у меня будут деньги для этой сучки Виктории!)
# (и мне не придется позориться перед камерой на весь мир!)
# Я согласна...
    music Groove2_85
    img 10096
    with fade
    m "Черт с тобой, Стив!"
    mt "По крайней мере у меня будут деньги для этой сучки Виктории!"
    mt "И мне не придется позориться перед камерой на весь мир!"
    mt "Обо мне уже начинают ходить слухи..."
    mt "Это нехорошо. Я скоро верну свое положение и мне не стоит терять репутацию..."
    img 10097
    with fade
    m "Я согласна..."
# Стив начинает движение
# Моника говорит: Стой!
# Стив, ты же понимаешь, что тебе это не сойдет с рук?!
# Стив: да, Моника, я понимаю, но я готов рискнуть!
# Стив, ты понимаешь что я убъю тебя за это?!
    music Turbo_Tornado
    img 10098
    with fade
    steve "..."
    sound plastinka2
    music Power_Bots_Loop
    img 10099
    m "СТОЙ!"
    m "Стив, ты же понимаешь, что тебе это не сойдет с рук?!"
    steve "Да, Моника, я понимаю, но я готов рискнуть!"
    m "И ты понимаешь, что за это я сотру тебя в порошок?!"
    m "Я закрою твою фирму и заставлю тебя жить на улице!"
# Моника, но у нас честная сделка!
# Стив, ты понимаешь что эта задница стоит миллиарды?!
# Стив отвечает: Да, Моника! Я знаю!
# Это очень редкая и выгодная сделка!
    steve "Моника, но у нас честная сделка!"
    img 10100
    with diss
    m "Стив, ты понимаешь что эта задница стоит миллиарды?!"
    music Turbo_Tornado
    img 10098
    steve "Стив отвечает: Да, Моника! Я знаю!"
    steve "Это очень редкая и выгодная сделка!"
#    music stop
    w

    #звук входа
    sound hlup10
    img 10101
    with diss
    w
    sound snd_monica_ahh
    img 10102
    m "Ааааххххххх!!!"

# И входит в Монику
# Идет секс
    music stop
    img black_screen
    with Dissolve(0.5)
#    pause 0.3
    #видео1 начало
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_1 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_1.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_1
    with fadelong
    wclean
    m "Я забыла спросить, Стив..."
    m "Деньги у тебя с собой?!"
    steve "Моника, конечно с собой!"
    steve "Они у меня на банковской карте! Я могу перевести их тебе прямо сейчас..."
    steve "Вернее, после окончания аренды твоей..."
    m "Заткнись! Я так и знала!"
    m "Купишь подарочный сертификат и отправишь его на адрес, который я скажу."
    steve "Нет проблем, Моника! Не отвлекайся!"
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_2 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_2.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_2
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_3 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_3.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_3
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_4 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_4.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_4
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_5 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_5.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_5
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_6 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_6.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_6
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_7 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_7.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_7
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_8 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_8.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_8
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_1.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_1_9 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_1_9.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_1_9
    wclean


# Во время секса Моника говорит: я забыла спросить, Стив...
# Деньги у тебя с собой?!
# Стив отвечает: Моника, конечно с собой!
# Они у меня на банковской карте! Я могу тебе перевести их тебе прямо сейчас...
# Вернее, после окончания аренды твоей ...
# Моника говорит: Заткнись! Я так и знала!
# Купишь подарочный сертификат и отправишь его на адрес, который я скажу.
# Стив: Нет проблем, Моника! Не отвлекайся!

# Моника: черт, Стив! Какой ты огромный!
# Стив: Моника, тебе нравится? Я так и знал!
# Моника: Нет, Стив!
# Мне... Ах...
# Мне не нравится, конечно же! Ах!!!
    m "Черт, Стив! Какой ты огромный!"
    steve "Моника, тебе нравится? Я так и знал!"
    m "Нет, Стив!"
    stop music
    sound snd_orgasm1
    m "Мне... Ах..."
    sound snd_orgasm2
    m "Мне не нравится, конечно же! Ах!!!"

    #видео1 конец

# Ах!! Ах!! Ааааааххх!!
# Моника падает... Она кончила
# (снова это ощущение...)
# (что это было снова?!?!)
    music Loved_up2
    img 10103
    sound snd_orgasm3
    m "Ах!! Ах!! Ааааааххх!!"
    sound snd_bodyfall
    img 10104
    with fade
    m "..."
    img 10105
    with diss
    mt "Снова это ощущение..."
    mt "Что это было снова?!?!"
# Стив: Моника, я понимаю что ты кончила, но срок аренды твоей попы действует до тех пор пока не кончу Я!
# Пожалуйста, встань как ты стояла до этого, задери юбку!
# И обеспечь мне доступ к объету аренды!
    music Groove2_85
    img 10106
    with fade
    steve "Моника, я понимаю что ты кончила, но срок аренды твоей попы действует до тех пор, пока не кончу Я!"
    steve "Пожалуйста, встань как ты стояла до этого, задери юбку!"
    img 10104
    with fade
    steve "И обеспечь мне доступ к объекту аренды!"
    steve "В соответствии с договором!"
# Моника: Мерзавец...
# Моника встает. Стив снова входит.
# Стив: аааах!!!
# Моника кричит: не вздумай кончить в меня!
    img black_screen
    with diss
    pause 1.0
    sound highheels_short_walk
    img 10107
    with fade
    w
    img 10108
    with diss
    steve "Иначе сделка недействительна!"

    sound highheels_short_walk
    img 10109
    with fade
    w
    img 10110
    with Dissolve(0.5)
    w
    label gallery_10117:
    music Loved_up2
    img 10111
    with fade
    w
    img 10112
    with fade
    w
    img 10113
    with fade
    w
    img 10114
    with fade
    m "Мерзавец..."
    music stop
    w
    #звук входа
    sound hlup10
    img 10115
    with diss
    w
    sound snd_monica_ahh
    img 10118
    m "Ааааххххххх!!!"

    img black_screen
    with diss
    pause 1.0
    #видео2
    music stop
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_1 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_1.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_1
    with fadelong
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_2 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_2.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_2
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_3 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_3.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_3
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_4 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_4.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_4
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_5 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_5.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_5
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_6 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_6.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_6
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_8 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_8.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_8
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_9 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_9.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_9
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_10 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_10.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_10
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_11 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_11.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_11
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_12 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_12.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_12
    wclean
    stop music
    play music "<from " + str((rand(1,6)*1.5)) + " loop 0.0>Sounds/audio_Pool_Basement_Steve_Monica_Sex_2.mp3"
    scene black
    image videov_Pool_Basement_Steve_Monica_Sex_2_13 = Movie(play="video/v_Pool_Basement_Steve_Monica_Sex_2_13.mkv", fps=30)
    show videov_Pool_Basement_Steve_Monica_Sex_2_13
    wclean

    stop music
    music Indo_Rock
    img 10117
    with diss
    w
    img 10116
    with diss
    w

    img 10119
    with fade
    steve "Аааах!!!"
    img 10120
    m "Не вздумай кончить в меня!"
# Стив вынимает и хочет кончить на юбку Моники.
# Не вздумай кончить на мою униформу! У меня нет другой!
# Стив хочет кончить на коврик.
# Не вздумай кончать на коврик! Я не собираюсь убирать за тобой!
    img 10121
    with fade
    steve "Аааах!!!"
    m "Не вздумай кончить на мою униформу! У меня нет другой!"

    img 10122
    with fade
    steve "Аааах!!!"
    m "Не вздумай кончать на коврик! Я не собираюсь убирать за тобой!"

# Стив: О боже! Моника! Куда же мне можно кончить?! Скорее!
# Кончай в бассейн!
    img 10123
    with diss
    steve "О Боже! Моника! Куда же мне можно кончить?! Скорее!"
    img 10124
    m "Кончай в бассейн!"
# Стив поворачивается к бассейну и кончает.
# Выбор: если Моника сучка, то она может толкнуть Стива в бассейн.
# Остынь, Стив! Ты слишком возбудился, малыш!
# После этого бросает визитку у бассейна и говорит.
# И только попробуй не прислать сертификат!
# Тогда я наведаюсь к тебе!
# Либо:
# Стив, вот визитка. Пришли сертификат по этому адресу.
# И, Стив...
# Давай забудем об этом... Об этой сделке...
# И, необязательно об этом кому-то говорить. Ты понимаешь меня?
# О, Моника! Конечно!
# Если захочешь вспомнить, приходи ко мне в офис!
    img 10125
    with diss
    steve "Аааах!!!"
    img 10126
    with diss
    menu:
        "Толкнуть Стива в бассейн..." if monicaBitch == True:
            img 10127
            with fade
            #звук бульк
            w
            music stop
            img black_screen
            with diss
            sound snd_water_splash
            pause 1.5
            music Pyro_Flow
            img 10128
            with fadelong
            m "Остынь, Стив! Ты слишком возбудился, малыш!"

# После этого бросает визитку у бассейна и говорит.
            sound snd_take_paper
            img 10129
            with fade
            m "Вот адрес!"
            img 10130
            with diss
            m "И только попробуй не прислать сертификат!"
            m "Тогда я наведаюсь к тебе!"
        "Толкнуть Стива в бассейн... (Моника недостаточно стерва) (disabled)" if monicaBitch == False:
            pass

        "Дать визитку..." if monicaBitch == False:
            music Groove2_85
            img 10131
            with fade
            m "Стив, вот визитка. Пришли сертификат по этому адресу."
            music Hidden_Agenda
            img 10132
            with diss
            m "И, Стив..."
            m "Давай забудем об этом... Об этой сделке..."
            m "Необязательно об этом кому-то говорить. Ты понимаешь меня?"
            img 10133
            with fade
            m "О, Моника! Конечно!"
            m "Если захочешь вспомнить, приходи ко мне в офис!"

        "Дать визитку... (Моника слишком стерва) (disabled)" if monicaBitch == True:
            pass

    img black_screen
    with Dissolve(1.0)
    pause 2.0
    return

label gallery_11368:
# Второй приход к Стиву. Моника встречает Джейн, а также Тиффани.
# Стива все нет. Моника наезжает на них обеих.
    img 11308
    with fadelong
    jane "Миссис Бакфетт!"
    music Pyro_Flow
    img 11309
    with fade
    m "Встать, когда с тобой говорит твой Босс!"
    img 11310
    with fade
    # Джейн встает
    jane "..."
    img 11311
    with diss
    m "Ты снова одета в это, Джейн?!"
    m "Ты решила поиграть с огнем, да?!"
    img 11312
    with fade
    jane "Миссис Бакфетт, Мистер Стив приказал мне носить это..."
    img 11313
    with diss
    m "Стив?!"
    img 11314
    with diss
    m "Кто твой Босс, Джейн?!"
    m "Стив или Я?!"
    img 11315
    with fade
    jane "..."
    img 11316
    with diss
    m "Отвечай, быстро!"
    img 11317
    with fade
    jane "Вы, Миссис Бакфетт..."
    music Groove2_85
    img 11318
    with fade
    m "Хорошо, можешь продолжать ходить в этом..."
    m "Это будет отличный повод уволить тебя!"
    img 11319
    jane "..."

    music stop
    img black_screen
    with diss
    pause 2.0
    music Indo_Rock2
    img 11321
    with fadelong
    # Заходит Тиффани
    tiffany "Джейн!"
    img 11320
    with diss
    tiffany "Я нашла то свадебное платье, которое ты хочешь!"
    img 11322
    with diss
    tiffany "Поехали скорее в тот магазин!"
    img 11323
    with diss
    jane "!!!"
    img 11324
    with diss
    tiffany "???"
    music stop
    sound plastinka2
    img 11325
    with diss
    w
    music Pyro_Flow
    img 11326
    with fadelong
    m "..."
    img 11327
    with diss
    tiffany "Ой!"
    img 11328
    with fade
    tiffany "Миссис Бакфетт..."
    tiffany "Здравствуйте..."
    img 11329
    with diss
    m "Знакомое личико..."
    if monicaBitch == True:
        m "Напомни-ка, сучка, как тебя зовут?!"
    else:
        m "Напомни-ка, девочка, как тебя зовут?!"
    img 11330
    with fade
    tiffany "Меня зовут Тиффани, Мэм..."
    if janeTiffanyFirePlanned == True:
        img 11331
        with diss
        m "Насколько я помню, тебя я тоже собиралась уволить!"
        img 11332
        with diss
        m "Посмотри на свой внешний вид!"
        img 11333
        with fade
        m "Ты недалеко ушла от этой проститутки, Джейн!"
        img 11334
        with diss
        tiffany "!!!"
        img 11335
        with diss
        jane "!!!"
    else:
        img 11331
        with diss
        m "Удивительно как тебя еще не уволили!"
        img 11332
        with diss
        m "Посмотри на свой внешний вид!"
        img 11333
        with fade
        m "Вы тут все одеты как проститутки!"
        img 11334
        with diss
        tiffany "!!!"
        img 11335
        with diss
        jane "!!!"

    music Pyro_Flow
    img 11336
    with fadelong
    m "Я разберусь и с тобой тоже!"
    img 11337
    with diss
    m "Где Стив?! Он в своем кабинете?"
    img 11338
    with diss
    jane "Миссис Бакфетт, Мистера Стива сегодня снова нет..."
    img 11339
    with fade
    m "Этот слизняк что, скрывается от меня?!"
    m "Может быть это ты предупредила его, Джейн?!"
    img 11340
    with diss
    jane "Нет, Миссис Бакфетт."
    jane "Я ничего ему не говорила, как Вы и приказали..."
    img 11341
    with fade
    m "Может быть это ты ему сообщила, Тиффани?!"
    img 11342
    with diss
    tiffany "Нет, Мэм. У меня нет личного номера Мистера Стива..."
    img 11343
    with fade
    m "Пойду-ка я проверю, вдруг Вы меня обманываете!"
    img black_screen
    with diss
    sound highheels_short_walk
    pause 1.0
    img 11344
    with diss
    jane "Миссис Бакфетт, но в кабинет Мистера Стива запрещено заходить в его отсутствие!"
    img 11345
    with fade
    m "Джейн, ты забыла?!"
    m "Кто здесь Босс?!"
    m "Стив или Я?"
    # Джейн смотрит на Тиффани
    img 11346
    with diss
    jane "..."
    img 11347
    with diss
    w
    img 11348
    with fade
    jane "Вы, Миссис Бакфетт..."
    img 11349
    with fade
    m "А ты, Тиффани?!"
    m "Ты в курсе кто здес Босс?"
    img 11350
    with diss
    jane "Миссис Бакфетт, здесь Босс Вы..."
    img 11351
    with diss
    m "Правильный ответ."
    m "А теперь, проводите меня в кабинет!"
    # Заходят в кабинет
    # Там Стива нет

    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 3.0
    music Groove2_85
    #идут
    img 11352
    with fadelong
    w
    img 11353
    with diss
    m "Этого слизняка здесь нет..."
    img 11354
    with diss
    m "Надо проверить под столом, вдруг он прячется там..."
    # Смотрит под стол, там никого нет
    music stop
    img black_screen
    with diss
    sound highheels_short_walk
    pause 2.0
    music Groove2_85
    img 11355
    with fadelong
    w
    img 11356
    with diss
    w
    img 11357
    with diss
    mt "Никого нет..."

    # Моника садится на стул Стива
    music stop
    img black_screen
    pause 1.0
    pause 2.0
    music Stealth_Groover
    img 11358
    with fadelong
    m "Итак, девочки..."
    m "Когда будет Стив?"
    img 11359
    with diss
    jane "Миссис Бакфетт..."
    jane "Мистер Стив должен быть завтра..."
    img 11360
    with fade
    m "Может быть мне подождать его здесь?"
    img 11361
    with diss
    m "Вдруг он появится... СЕГОДНЯ..."
    img 11362
    with fade
    jane "..."
    img 11363
    with diss
    m "А, Тиффани?"
    img 11364
    with fade
    tiffany "Миссис Бакфетт."
    tiffany "Мистер Стив вряд-ли появится сегодня..."
    img black_screen
    with diss
    pause 1.0
    img 11365
    with fadelong
    w
    img 11366
    with diss
    w
    sound highheels_short_walk
    img 11367
    with diss
    w
    # Моника уходит
    img 11368
    with diss
    m "Хорошо"
    img 11369
    with diss
    m "Я приду завтра."
    img 11370
    with fade
    w
    # повтор ep25_dialogues2_steve1a
    return

label gallery_11459:
    img black_screen
    with diss
    pause 2.0
    img 11390
    music Groove2_85
    with fadelong
    m "Итак, Стив!"
    m "Ответь мне!"
    img 11391
    with diss
    m "Почему ты не перевел деньги на тот адрес?"
    img 11392
    with fade
    steve "Моника... Я..."
    steve "Я собирался это сделать..."
    img 11393
    with diss
    m "!!!"
    music stop
    sound plastinka2
    img 11394
    with diss
    steve "..."
    music Groove2_85
    img 11395
    with fadelong
    steve "Моника, погоди. Ты ведь теперь снова Босс?"
    steve "Но какое тогда значение имеют эти $ 5000 для тебя?"
    img 11396
    with diss
    m "Я - Бизнес Леди!"
    m "Для меня все деньги имеют значение!"
    img 11397
    with fade
    steve "Моника, скажи, так ты вернула все назад?"
    steve "Эта компания снова принадлежит тебе?"
    img 11398
    with diss
    m "..."
    img 11399
    with diss
    steve "..."
    img 11400
    with fade
    m "Ты прекрасно знаешь что эта компания принадлежит мне!"
    img 11401
    with diss
    steve "..."
    img 11402
    with fade
    steve "Моника, а ты можешь это доказать?"
# Моника говорит что не собирается ничего доказывать Стиву!
# И чтобы он перевел деньги немедленно!
# Стив говорит что Моника ввела его в заблуждение своим внешним видом.
# Что он действительно подумал что Моника снова Босс и она его этим напугала.
# Моника отвечает что скоро она будет Боссом и Стиву стоит бояться ее, потому что она сотрет его в порошок!
# Стив оправдывается что он всего-лишь бизнесмен.
# Моника говорит чтобы он перевел деньги немедленно.
# Стив говорит что не может сделать этого, потому что сделка не была закрыта.
# Моника спрашивает какого черта?! Стив получил что хотел и сделка закрыта.
# Стив говорит что нет.
    music Power_Bots_Loop
    img 11403
    with fade
    m "Я не собираюсь тебе ничего доказывать, жалкий слизняк!"
    m "Переводи деньги, немедленно!"
    music Groove2_85
    img 11404
    with fade
    steve "Моника, ты ввела меня в заблуждение."
    steve "Я действительно подумал что ты теперь снова мой Босс."
    img 11405
    with diss
    steve "Ты очень напугала меня!"
    music Power_Bots_Loop
    img 11406
    with fade
    m "Очень скоро я снова стану твоим Боссом!"
    m "И тебе стоит бояться меня, потому что я сотру тебя в порошок!"
    m "За то что ты сделал!"
    music Groove2_85
    img 11407
    with fade
    steve "За то что я не перевел деньги?"
    steve "Или за то что я взял в аренду твою..."
    music Power_Bots_Loop
    img 11408
    with diss
    m "Молчать! Ты прекрасно сам все понимаешь!"
    music Groove2_85
    img 11409
    with fade
    steve "Но Моника, я всего-лишь бизнесмен!"
    img 11410
    with diss
    m "Переведи деньги немедленно!"
    img 11411
    with fade
    steve "Моника, но я не могу сделать это, потому что сделка не была закрыта."
    img 11412
    with diss
    m "Какого черта, Стив?"
    m "Ты получил что хотел и сделка закрыта!"
    img 11413
    with diss
    steve "Нет, Моника, она не закрыта..."
# Моника спрашивает почему это?
# Стив отвечает что потому что доступ к объекту был прекращен раньше завершения срока аренды.
# Моника бесится: аренда была предоставлена в полной мере, сделка закрыта.
# Нет
# Почему?!
# Потому что Стив не кончил в объект аренды.
# Моника бесится: это невозможно! я не собираюсь иметь детей от такого мешка с дерьмом как ты!
# Стив говорит что у объекта аренды есть еще один вход, вполне безопасный для того чтобы туда кончить.
# Моника спрашивает у Стива что он имеет ввиду.
    img 11414
    with fade
    m "Почему это, Стив?!"
    img 11415
    with diss
    steve "Потому что доступ к объекту был прекращен раньше завершения срока аренды."
    img 11416
    with fade
    m "Аренда была предоставлена в полной мере, сделка закрыта!"
    steve "Нет!"
    img 11417
    with diss
    m "Почему?!"
    img 11418
    with fade
    steve "Потому что арендатор не смог кончить в объект аренды."
    img 11419
    with diss
    m "Это невозможно!"
    m "У владельца объекта аренды нет никакого желания иметь детей от такого мешка с дерьмом как ты!"
    img 11420
    with fade
    steve "У объекта аренды есть еще один вход, вполне безопасный для того, чтобы туда кончить."
    m "Что ты имеешь ввиду?"

# Стив молча улыбается.
# Моника догадывается: Ах ты про это?! Негодяй!
# Это невозможно!
# У Моники такого никогда не было и, она клянется, не будет никогда!
# Стив улыбается.
# Говорит что есть еще один вариант.
    img 11421
    with diss
    steve "..."
    music Power_Bots_Loop
    img 11422
    with fade
    m "Ах ты про это?! Негодяй!"
    m "Это невозможно!"
    m "У меня никогда такого не было и, я клянусь, не будет никогда!"
    music Groove2_85
    img 11423
    with fade
    steve "..."
    img 11424
    with diss
    steve "Есть еще один вариант..."
# Моника делает выбор:
    menu:
        "Мне не нужны никакие варианты, мерзавец!":
# Мне не нужны никакие варианты, мерзавец. Если он не заплатит то Моника прибъет его прямо здесь!
# Стив платит
            music Power_Bots_Loop
            img 11425
            with fade
            w
            img 11426
            with diss
            m "Мне не нужны никакие варианты, мерзавец!"
            img 11427
            with diss
            m "Если ты не заплатишь, то я прибью тебя прямо здесь!"
            img 11428
            with fade
            steve "Хорошо, Моника!"
            steve "Я сейчас переведу деньги!"
            steve "Не надо меня прибивать!"
            return
        "Какой вариант?":
            pass
# Либо спрашивает. Хорошо, Стив, ты мерзавец и я покончу с тобой, но мне сейчас нужен этот платеж. Какие варианты еще есть?
# Стив достает член и говорит что у объекта недвижимости есть еще один безопасный способ принять его сперму.
# Моника спрашивает что еще этот извращенец Стив имеет ввиду? Какой еще способ?
# Стив отвечает что это ротик Моники. Что она все-равно не закрывает его, так что если она подержит его открытым еще немного,
# то сможет быстро закрыть эту сделку.
    music stop
    img black_screen
    with diss
    pause 2.0
    music Groove2_85
    img 11429
    with fadelong
    m "Хорошо, Стив..."
    m "Ты мерзавец и я покончу с тобой."
    img 11430
    with diss
    m "Но мне сейчас нужен этот платеж."
    m "Какой вариант еще есть?"

    # Стив достает член
    #zip
    img black_screen
    with diss
    sound snd_zip
    pause 2.0
    sound Jump1
    img 11431
    with fadelong
    w
    img 11432
    with fade
    steve "У объекта аренды есть еще один безопасный способ принять сперму."
    music Power_Bots_Loop
    img 11433
    with fade
    m "Стив, извращенец! Что ты имеешь ввиду?"
    m "Какой еще способ?"
    music Groove2_85
    img 11434
    with diss
    steve "Это ротик объекта аренды."
    steve "Объект аренды все-равно не закрывает его."
    steve "Так что, если ротик побудет открытым еще немного, то сможет быстро закрыть эту сделку."

# Член около лица Моники.
# Моника отвечает со злобой что сделка касалась только ее....
# Стив говорит: Да, Моника, скажи это, произнеси это слово.
# Моника отвечает что не собирается произносить и что то что хочет Стив будет ему стоить в два раза дороже!
# Стив отвечает что у него сверху есть только $100.
# Моника говорит что Стив что, издевается над ней?
# Стив отвечает что нет, она ведь в курсе насчет его и Джейн.
# Что Моника и так оставит Стива без денег на ланч на целую неделю.
# Пусть Моника скорее откроет ротик, Стив уже изнемогает.
    img 11435
    with diss
    m "!!!"
    m "Сделка касалась только моей..."
    m "Моей..."
    img 11436
    with diss
    steve "Да, Моника! Скажи это!"
    steve "Произнеси это слово!"
    img 11439
    with diss
    m "Нет!"
    img 11437
    with diss
    m "Я не собираюсь ничего произносить, Стив!"
    img 11438
    m "И то что ты хочешь, будет стоить тебе в два раза дороже!"
    img 11440
    with diss
    steve "Моника, у меня сверху есть только $ 100."
    img 11441
    with fade
    w
    img 11442
    with fade
    w
    img 11443
    with diss
    m "Стив, ты что, издеваешься надо мной?!"
    img 11444
    with diss
    steve "Нет, Моника, я не издеваюсь над тобой."
    img 11445
    with diss
    steve "Ты ведь в курсе насчет меня и Джейн..."
    img 11446
    with fade
    steve "Ты и так оставишь меня без денег на ланч на целую неделю!"
    img 11447
    with fade
    steve "Открой скорее свой ротик, я уже изнемогаю!"
    img 11448
    with diss
# Моника делает выбор:
    menu:
        "Я не собираюсь заключать никаких новых сделок.":

# Я не собираюсь заключать никаких новых сделок.
# Если ты не заплатишь сейчас-же, то я убью тебя прямо здесь!
# Стив платит
            music Power_Bots_Loop
            img 11449
            with fadelong
            m "Я не собираюсь заключать никаких новых сделок."
            m "Если ты не заплатишь сейчас-же, то я убью тебя прямо здесь!"
            img 11450
            with diss
            steve "Хорошо, Моника!"
            steve "Я сейчас переведу деньги!"
            steve "Не надо меня убивать!"
            return
        "Открыть свой ротик.":
            pass

# Либо Моника молчит и зло смотрит на Стива
# Стив говорит что ну-же! Моника!
# Сделай это и через пять минут деньги будут переведены!
# Моника думает.
# Стив смотрит.
# Моника, давай быстрее! Джейн может войти в любой момент!
# Моника молча открывает рот и зло смотрит.
# Стив вгоняет в нее член с криком О ДА!!!
# Как же я мечтал об этом дне!
# Когда я вгоню свой член в твой ротик!
# Каждый раз когда ты приходила и кричала на меня, я мечтал об этом дне!
# Моника зло смотрит.
# Стив кончает.
    m "..."
    img 11451
    with fade
    steve "Ну же, Моника!"
    img 11452
    with diss
    steve "Сделай это и через пять минут деньги будут переведены!"
    img 11453
    with diss
    m "..."
    img 11454
    with diss
    steve "..."
    sound hlup10
    img 11455
    with diss
    steve "Моника, давай быстрее!"
    img 11456
    with fade
    steve "Джейн может войти в любой момент!"
    img 11457
    w
    m "..."

    music stop
    img 11458
    with diss
    steve "Ну же!"
    sound hlup10
    img 11459
    with diss
    steve "О ДА!!!"
    music Loved_Up2
    steve "Как же я мечтал об этом дне!"
    steve "О дне, когда я вгоню свой член в твой ротик!"
    img 11460
    with diss
    steve "Каждый раз, когда ты приходила и кричала на меня, я мечтал об этом дне!"
    img 11461
    with diss
    m "!!!"


    # video
    music stop
    music2 Loved_Up2
    $ renpy.music.set_volume(0.3, 0.0, 'music2')
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_1 = Movie(play="video/v_Steve_Monica_Blowjob_1_1.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_1
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_2 = Movie(play="video/v_Steve_Monica_Blowjob_1_2.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_2
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_3 = Movie(play="video/v_Steve_Monica_Blowjob_1_3.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_3
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_4 = Movie(play="video/v_Steve_Monica_Blowjob_1_4.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_4
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_5 = Movie(play="video/v_Steve_Monica_Blowjob_1_5.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_5
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_6 = Movie(play="video/v_Steve_Monica_Blowjob_1_6.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_6
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_7 = Movie(play="video/v_Steve_Monica_Blowjob_1_7.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_7
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_8 = Movie(play="video/v_Steve_Monica_Blowjob_1_8.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_8
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_9 = Movie(play="video/v_Steve_Monica_Blowjob_1_9.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_9
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_10 = Movie(play="video/v_Steve_Monica_Blowjob_1_10.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_10
    with fadelong
    wclean
    img black_screen
    with diss
    stop music
    play music "<from " + str((rand(1,5)*1.5)) + " loop 0.0>Sounds/audio_Steve_Blowjob1.mp3"
    scene black
    image videov_Steve_Monica_Blowjob_1_11 = Movie(play="video/v_Steve_Monica_Blowjob_1_11.mkv", fps=30)
    show videov_Steve_Monica_Blowjob_1_11
    with fadelong
    wclean
    $ renpy.music.set_volume(1.0, 0.0, 'music2')

    stop music
    music stop
    music2 stop
    img black_screen
    with diss
    pause 1.0
    img 11462
    with fadelong
    sound bulk1
    steve "АААААХХХХХХХ!!!"
    m "!!!"
    music Groove2_85
    img 11463
    with fadelong
    m "Тьфу!"
    mt "Мерзость!"

# Моника уходит вытирая рот: только попробуй не перевести деньги, мерзавец!
    music Power_Bots_Loop
    img 11464
    with fadelong
    m "Только попробуй не перевести деньги, мерзавец!"
    return
